turatsamar/DRV8889/src/rl78_ca78k0r.h
/*****************************************************************************/
/*ファイル内容	：ANSI と コンパイラの差を吸収                               */
/*対応マイコン	：RL78シリーズ                                               */
/*****************************************************************************/
/*変更履歴：                                                                 */
/*  Ver1_0                                                                   */
/*        新規作成 2015/05/29 黒川                                           */
/*  Ver1_1                                                                   */
/*        16進数表現,CPU制御命令,DI/EI命令の置換を追加 2015/7/15 黒川        */
/*  Ver1_2                                                                   */
/*        マクロ誤記修正  2015/7/24 黒川                                     */
/******************************************************************************/

/*****************************************************************************/
/*  使用方法                                                                 */
/*   ・プラグマ指令後に本ファイルをインクルードする。                        */
/*   ・main.cでDEFINE_SFR_GLOBALを#define指令する。                          */
/*****************************************************************************/

/* 同一cファイル内での多重定義を防止する */
#ifndef	rl78_ca78k0r_h
#define	rl78_ca78k0r_h

/*****************************************************************************/
/*                 SFR変数を通常の変数に置換                                 */
/*****************************************************************************/

/* 各cファイルでの多重定義を防止する */
#if (defined DEFINE_SFR_GLOBAL)&&(!defined __RL78__)
	#define	SFR_GLOBAL
#else
	#define	SFR_GLOBAL		extern
#endif


/******************************************************************************/
/*                 型宣言                                                     */
/******************************************************************************/
typedef	unsigned char		SFR_UNSIGNED_CHAR;
typedef	unsigned int		SFR_UNSIGNED_INT;
typedef	unsigned short int	SFR_UNSIGNED_SHORT_INT;
typedef unsigned long int	SFR_UNSIGNED_LONG_INT;

/******************************************************************************/
/*                 追加予約語の型をunsigned charに置換                        */
/******************************************************************************/
#ifdef __RL78__
#else
	typedef	unsigned char	bit;
	typedef	unsigned char	boolean;
	typedef	unsigned char	__boolean;
#endif

/******************************************************************************/
/*                 拡張機能の追加予約語を空白に変換                           */
/******************************************************************************/
#ifdef __RL78__
#else
	#define	sreg
	#define	__sreg
	#define	callt
	#define	__callt
	#define	callf
	#define	__callf
	#define	norec
	#define	__leaf
	#define	noauto
	#define	__interrupt
	#define	__interrupt_brk
	#define	__asm
	#define	__rtos_interrupt
	#define	__pascal
	#define	__flash
	#define	__flashf
	#define	__directmap
	#define	__temp
	#define	__near
	#define	__far
	#define	__mxcall
#endif


/******************************************************************************/
/*                 SFRをビットアクセスする為の構造体                          */
/******************************************************************************/
typedef struct	{
	SFR_UNSIGNED_INT	bit0:1;
	SFR_UNSIGNED_INT	bit1:1;
	SFR_UNSIGNED_INT	bit2:1;
	SFR_UNSIGNED_INT	bit3:1;
	SFR_UNSIGNED_INT	bit4:1;
	SFR_UNSIGNED_INT	bit5:1;
	SFR_UNSIGNED_INT	bit6:1;
	SFR_UNSIGNED_INT	bit7:1;
} SFR_BIT8;

/* 150715 write nakagawa 16bitアクセス用構造体追加 */
typedef struct	{
	SFR_UNSIGNED_INT	bit0:1;
	SFR_UNSIGNED_INT	bit1:1;
	SFR_UNSIGNED_INT	bit2:1;
	SFR_UNSIGNED_INT	bit3:1;
	SFR_UNSIGNED_INT	bit4:1;
	SFR_UNSIGNED_INT	bit5:1;
	SFR_UNSIGNED_INT	bit6:1;
	SFR_UNSIGNED_INT	bit7:1;
	SFR_UNSIGNED_INT	bit8:1;
	SFR_UNSIGNED_INT	bit9:1;
	SFR_UNSIGNED_INT	bit10:1;
	SFR_UNSIGNED_INT	bit11:1;
	SFR_UNSIGNED_INT	bit12:1;
	SFR_UNSIGNED_INT	bit13:1;
	SFR_UNSIGNED_INT	bit14:1;
	SFR_UNSIGNED_INT	bit15:1;
} SFR_BIT16;
/* 150715 write end nakagawa 16bitアクセス用構造体追加 */


/******************************************************************************/
/*                       SFRの置換規則                                        */
/******************************************************************************/

/* P0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P0;

SFR_GLOBAL	SFR_P0	p0;

#ifdef __RL78__
	#define	P0_0	(P0.0)
	#define	P0_1	(P0.1)
	#define	P0_2	(P0.2)
	#define	P0_3	(P0.3)
	#define	P0_4	(P0.4)
	#define	P0_5	(P0.5)
	#define	P0_6	(P0.6)
	#define	P0_7	(P0.7)
#else
	#define	P0_0	(p0.BIT_NUMBER.bit0)
	#define	P0_1	(p0.BIT_NUMBER.bit1)
	#define	P0_2	(p0.BIT_NUMBER.bit2)
	#define	P0_3	(p0.BIT_NUMBER.bit3)
	#define	P0_4	(p0.BIT_NUMBER.bit4)
	#define	P0_5	(p0.BIT_NUMBER.bit5)
	#define	P0_6	(p0.BIT_NUMBER.bit6)
	#define	P0_7	(p0.BIT_NUMBER.bit7)
	#define	P0	(p0.ALL)
#endif

/* P1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P1;

SFR_GLOBAL	SFR_P1	p1;

#ifdef __RL78__
	#define	P1_0	(P1.0)
	#define	P1_1	(P1.1)
	#define	P1_2	(P1.2)
	#define	P1_3	(P1.3)
	#define	P1_4	(P1.4)
	#define	P1_5	(P1.5)
	#define	P1_6	(P1.6)
	#define	P1_7	(P1.7)
#else
	#define	P1_0	(p1.BIT_NUMBER.bit0)
	#define	P1_1	(p1.BIT_NUMBER.bit1)
	#define	P1_2	(p1.BIT_NUMBER.bit2)
	#define	P1_3	(p1.BIT_NUMBER.bit3)
	#define	P1_4	(p1.BIT_NUMBER.bit4)
	#define	P1_5	(p1.BIT_NUMBER.bit5)
	#define	P1_6	(p1.BIT_NUMBER.bit6)
	#define	P1_7	(p1.BIT_NUMBER.bit7)
	#define	P1	(p1.ALL)
#endif

/* P3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P3;

SFR_GLOBAL	SFR_P3	p3;

#ifdef __RL78__
	#define	P3_0	(P3.0)
	#define	P3_1	(P3.1)
	#define	P3_2	(P3.2)
	#define	P3_3	(P3.3)
	#define	P3_4	(P3.4)
	#define	P3_5	(P3.5)
	#define	P3_6	(P3.6)
	#define	P3_7	(P3.7)
#else
	#define	P3_0	(p3.BIT_NUMBER.bit0)
	#define	P3_1	(p3.BIT_NUMBER.bit1)
	#define	P3_2	(p3.BIT_NUMBER.bit2)
	#define	P3_3	(p3.BIT_NUMBER.bit3)
	#define	P3_4	(p3.BIT_NUMBER.bit4)
	#define	P3_5	(p3.BIT_NUMBER.bit5)
	#define	P3_6	(p3.BIT_NUMBER.bit6)
	#define	P3_7	(p3.BIT_NUMBER.bit7)
	#define	P3	(p3.ALL)
#endif

/* P4 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P4;

SFR_GLOBAL	SFR_P4	p4;

#ifdef __RL78__
	#define	P4_0	(P4.0)
	#define	P4_1	(P4.1)
	#define	P4_2	(P4.2)
	#define	P4_3	(P4.3)
	#define	P4_4	(P4.4)
	#define	P4_5	(P4.5)
	#define	P4_6	(P4.6)
	#define	P4_7	(P4.7)
#else
	#define	P4_0	(p4.BIT_NUMBER.bit0)
	#define	P4_1	(p4.BIT_NUMBER.bit1)
	#define	P4_2	(p4.BIT_NUMBER.bit2)
	#define	P4_3	(p4.BIT_NUMBER.bit3)
	#define	P4_4	(p4.BIT_NUMBER.bit4)
	#define	P4_5	(p4.BIT_NUMBER.bit5)
	#define	P4_6	(p4.BIT_NUMBER.bit6)
	#define	P4_7	(p4.BIT_NUMBER.bit7)
	#define	P4	(p4.ALL)
#endif

/* P5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P5;

