turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_P5	p5;

#ifdef __RL78__
	#define	P5_0	(P5.0)
	#define	P5_1	(P5.1)
	#define	P5_2	(P5.2)
	#define	P5_3	(P5.3)
	#define	P5_4	(P5.4)
	#define	P5_5	(P5.5)
	#define	P5_6	(P5.6)
	#define	P5_7	(P5.7)
#else
	#define	P5_0	(p5.BIT_NUMBER.bit0)
	#define	P5_1	(p5.BIT_NUMBER.bit1)
	#define	P5_2	(p5.BIT_NUMBER.bit2)
	#define	P5_3	(p5.BIT_NUMBER.bit3)
	#define	P5_4	(p5.BIT_NUMBER.bit4)
	#define	P5_5	(p5.BIT_NUMBER.bit5)
	#define	P5_6	(p5.BIT_NUMBER.bit6)
	#define	P5_7	(p5.BIT_NUMBER.bit7)
	#define	P5	(p5.ALL)
#endif

/* P6 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P6;

SFR_GLOBAL	SFR_P6	p6;

#ifdef __RL78__
	#define	P6_0	(P6.0)
	#define	P6_1	(P6.1)
	#define	P6_2	(P6.2)
	#define	P6_3	(P6.3)
	#define	P6_4	(P6.4)
	#define	P6_5	(P6.5)
	#define	P6_6	(P6.6)
	#define	P6_7	(P6.7)
#else
	#define	P6_0	(p6.BIT_NUMBER.bit0)
	#define	P6_1	(p6.BIT_NUMBER.bit1)
	#define	P6_2	(p6.BIT_NUMBER.bit2)
	#define	P6_3	(p6.BIT_NUMBER.bit3)
	#define	P6_4	(p6.BIT_NUMBER.bit4)
	#define	P6_5	(p6.BIT_NUMBER.bit5)
	#define	P6_6	(p6.BIT_NUMBER.bit6)
	#define	P6_7	(p6.BIT_NUMBER.bit7)
	#define	P6	(p6.ALL)
#endif

/* P7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P7;

SFR_GLOBAL	SFR_P7	p7;

#ifdef __RL78__
	#define	P7_0	(P7.0)
	#define	P7_1	(P7.1)
	#define	P7_2	(P7.2)
	#define	P7_3	(P7.3)
	#define	P7_4	(P7.4)
	#define	P7_5	(P7.5)
	#define	P7_6	(P7.6)
	#define	P7_7	(P7.7)
#else
	#define	P7_0	(p7.BIT_NUMBER.bit0)
	#define	P7_1	(p7.BIT_NUMBER.bit1)
	#define	P7_2	(p7.BIT_NUMBER.bit2)
	#define	P7_3	(p7.BIT_NUMBER.bit3)
	#define	P7_4	(p7.BIT_NUMBER.bit4)
	#define	P7_5	(p7.BIT_NUMBER.bit5)
	#define	P7_6	(p7.BIT_NUMBER.bit6)
	#define	P7_7	(p7.BIT_NUMBER.bit7)
	#define	P7	(p7.ALL)
#endif

/* P8 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P8;

SFR_GLOBAL	SFR_P8	p8;

#ifdef __RL78__
	#define	P8_0	(P8.0)
	#define	P8_1	(P8.1)
	#define	P8_2	(P8.2)
	#define	P8_3	(P8.3)
	#define	P8_4	(P8.4)
	#define	P8_5	(P8.5)
	#define	P8_6	(P8.6)
	#define	P8_7	(P8.7)
#else
	#define	P8_0	(p8.BIT_NUMBER.bit0)
	#define	P8_1	(p8.BIT_NUMBER.bit1)
	#define	P8_2	(p8.BIT_NUMBER.bit2)
	#define	P8_3	(p8.BIT_NUMBER.bit3)
	#define	P8_4	(p8.BIT_NUMBER.bit4)
	#define	P8_5	(p8.BIT_NUMBER.bit5)
	#define	P8_6	(p8.BIT_NUMBER.bit6)
	#define	P8_7	(p8.BIT_NUMBER.bit7)
	#define	P8	(p8.ALL)
#endif

/* P9 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P9;

SFR_GLOBAL	SFR_P9	p9;

#ifdef __RL78__
	#define	P9_0	(P9.0)
	#define	P9_1	(P9.1)
	#define	P9_2	(P9.2)
	#define	P9_3	(P9.3)
	#define	P9_4	(P9.4)
	#define	P9_5	(P9.5)
	#define	P9_6	(P9.6)
	#define	P9_7	(P9.7)
#else
	#define	P9_0	(p9.BIT_NUMBER.bit0)
	#define	P9_1	(p9.BIT_NUMBER.bit1)
	#define	P9_2	(p9.BIT_NUMBER.bit2)
	#define	P9_3	(p9.BIT_NUMBER.bit3)
	#define	P9_4	(p9.BIT_NUMBER.bit4)
	#define	P9_5	(p9.BIT_NUMBER.bit5)
	#define	P9_6	(p9.BIT_NUMBER.bit6)
	#define	P9_7	(p9.BIT_NUMBER.bit7)
	#define	P9	(p9.ALL)
#endif

/* P10 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P10;

SFR_GLOBAL	SFR_P10	p10;

#ifdef __RL78__
	#define	P10_0	(P10.0)
	#define	P10_1	(P10.1)
	#define	P10_2	(P10.2)
	#define	P10_3	(P10.3)
	#define	P10_4	(P10.4)
	#define	P10_5	(P10.5)
	#define	P10_6	(P10.6)
	#define	P10_7	(P10.7)
#else
	#define	P10_0	(p10.BIT_NUMBER.bit0)
	#define	P10_1	(p10.BIT_NUMBER.bit1)
	#define	P10_2	(p10.BIT_NUMBER.bit2)
	#define	P10_3	(p10.BIT_NUMBER.bit3)
	#define	P10_4	(p10.BIT_NUMBER.bit4)
	#define	P10_5	(p10.BIT_NUMBER.bit5)
	#define	P10_6	(p10.BIT_NUMBER.bit6)
	#define	P10_7	(p10.BIT_NUMBER.bit7)
	#define	P10	(p10.ALL)
#endif

/* P12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P12;

SFR_GLOBAL	SFR_P12	p12;

#ifdef __RL78__
	#define	P12_0	(P12.0)
	#define	P12_1	(P12.1)
	#define	P12_2	(P12.2)
	#define	P12_3	(P12.3)
	#define	P12_4	(P12.4)
	#define	P12_5	(P12.5)
	#define	P12_6	(P12.6)
	#define	P12_7	(P12.7)
#else
	#define	P12_0	(p12.BIT_NUMBER.bit0)
	#define	P12_1	(p12.BIT_NUMBER.bit1)
	#define	P12_2	(p12.BIT_NUMBER.bit2)
	#define	P12_3	(p12.BIT_NUMBER.bit3)
	#define	P12_4	(p12.BIT_NUMBER.bit4)
	#define	P12_5	(p12.BIT_NUMBER.bit5)
	#define	P12_6	(p12.BIT_NUMBER.bit6)
	#define	P12_7	(p12.BIT_NUMBER.bit7)
	#define	P12	(p12.ALL)
#endif

/* P13 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P13;

SFR_GLOBAL	SFR_P13	p13;

#ifdef __RL78__
	#define	P13_0	(P13.0)
	#define	P13_1	(P13.1)
	#define	P13_2	(P13.2)
	#define	P13_3	(P13.3)
	#define	P13_4	(P13.4)
	#define	P13_5	(P13.5)
	#define	P13_6	(P13.6)
	#define	P13_7	(P13.7)
#else
	#define	P13_0	(p13.BIT_NUMBER.bit0)
	#define	P13_1	(p13.BIT_NUMBER.bit1)
	#define	P13_2	(p13.BIT_NUMBER.bit2)
	#define	P13_3	(p13.BIT_NUMBER.bit3)
	#define	P13_4	(p13.BIT_NUMBER.bit4)
	#define	P13_5	(p13.BIT_NUMBER.bit5)
	#define	P13_6	(p13.BIT_NUMBER.bit6)
	#define	P13_7	(p13.BIT_NUMBER.bit7)
	#define	P13	(p13.ALL)
#endif

/* P14 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P14;

SFR_GLOBAL	SFR_P14	p14;

#ifdef __RL78__
	#define	P14_0	(P14.0)
	#define	P14_1	(P14.1)
	#define	P14_2	(P14.2)
	#define	P14_3	(P14.3)
	#define	P14_4	(P14.4)
	#define	P14_5	(P14.5)
	#define	P14_6	(P14.6)
	#define	P14_7	(P14.7)
#else
	#define	P14_0	(p14.BIT_NUMBER.bit0)
	#define	P14_1	(p14.BIT_NUMBER.bit1)
	#define	P14_2	(p14.BIT_NUMBER.bit2)
	#define	P14_3	(p14.BIT_NUMBER.bit3)
	#define	P14_4	(p14.BIT_NUMBER.bit4)
	#define	P14_5	(p14.BIT_NUMBER.bit5)
	#define	P14_6	(p14.BIT_NUMBER.bit6)
	#define	P14_7	(p14.BIT_NUMBER.bit7)
	#define	P14	(p14.ALL)
#endif

/* P15 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_P15;

SFR_GLOBAL	SFR_P15	p15;

#ifdef __RL78__
	#define	P15_0	(P15.0)
	#define	P15_1	(P15.1)
	#define	P15_2	(P15.2)
	#define	P15_3	(P15.3)
	#define	P15_4	(P15.4)
	#define	P15_5	(P15.5)
	#define	P15_6	(P15.6)
	#define	P15_7	(P15.7)
#else
	#define	P15_0	(p15.BIT_NUMBER.bit0)
	#define	P15_1	(p15.BIT_NUMBER.bit1)
	#define	P15_2	(p15.BIT_NUMBER.bit2)
	#define	P15_3	(p15.BIT_NUMBER.bit3)
	#define	P15_4	(p15.BIT_NUMBER.bit4)
	#define	P15_5	(p15.BIT_NUMBER.bit5)
	#define	P15_6	(p15.BIT_NUMBER.bit6)
	#define	P15_7	(p15.BIT_NUMBER.bit7)
	#define	P15	(p15.ALL)
#endif

