turatsamar/DRV8889/src/rl78_ca78k0r.h
/* SDR00L */
#ifdef __RL78__
#else
	#define	SDR00L	(sdr00.BYTE.sdr00l)
#endif

/* SDR00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sdr00l;
	SFR_UNSIGNED_SHORT_INT	sdr00h;
}SFR_BYTE_SDR00;

typedef union{
	SFR_BYTE_SDR00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SDR00;

SFR_GLOBAL	SFR_SDR00	sdr00;

#ifdef __RL78__
#else
	#define	SDR00	(sdr00.ALL)
#endif

/* SDR01L */
#ifdef __RL78__
#else
	#define	SDR01L	(sdr01.BYTE.sdr01l)
#endif

/* SDR01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sdr01l;
	SFR_UNSIGNED_SHORT_INT	sdr01h;
}SFR_BYTE_SDR01;

typedef union{
	SFR_BYTE_SDR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SDR01;

SFR_GLOBAL	SFR_SDR01	sdr01;

#ifdef __RL78__
#else
	#define	SDR01	(sdr01.ALL)
#endif

/*TDR00*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr00;
#ifdef __RL78__
#else
	#define	TDR00	(tdr00)
#endif

/* TDR01L */
#ifdef __RL78__
#else
	#define	TDR01L	(tdr01.BYTE.tdr01l)
#endif

/* TDR01H */
#ifdef __RL78__
#else
	#define	TDR01H	(tdr01.BYTE.tdr01h)
#endif

/* TDR01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tdr01l;
	SFR_UNSIGNED_SHORT_INT	tdr01h;
}SFR_BYTE_TDR01;

typedef union{
	SFR_BYTE_TDR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TDR01;

SFR_GLOBAL	SFR_TDR01	tdr01;

#ifdef __RL78__
#else
	#define	TDR01	(tdr01.ALL)
#endif

/* ADCR */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT adcr;
#ifdef __RL78__
#else
	#define	ADCR	(adcr)
#endif

/* ADCRH */
SFR_GLOBAL SFR_UNSIGNED_CHAR adcrh;

#ifdef __RL78__
#else
    #define ADCRH (adcrh)
#endif

/* PM0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM0;

SFR_GLOBAL	SFR_PM0	pm0;

#ifdef __RL78__
	#define	PM0_0	(PM0.0)
	#define	PM0_1	(PM0.1)
	#define	PM0_2	(PM0.2)
	#define	PM0_3	(PM0.3)
	#define	PM0_4	(PM0.4)
	#define	PM0_5	(PM0.5)
	#define	PM0_6	(PM0.6)
	#define	PM0_7	(PM0.7)
#else
	#define	PM0_0	(pm0.BIT_NUMBER.bit0)
	#define	PM0_1	(pm0.BIT_NUMBER.bit1)
	#define	PM0_2	(pm0.BIT_NUMBER.bit2)
	#define	PM0_3	(pm0.BIT_NUMBER.bit3)
	#define	PM0_4	(pm0.BIT_NUMBER.bit4)
	#define	PM0_5	(pm0.BIT_NUMBER.bit5)
	#define	PM0_6	(pm0.BIT_NUMBER.bit6)
	#define	PM0_7	(pm0.BIT_NUMBER.bit7)
	#define	PM0	(pm0.ALL)
#endif

/* PM1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM1;

SFR_GLOBAL	SFR_PM1	pm1;

#ifdef __RL78__
	#define	PM1_0	(PM1.0)
	#define	PM1_1	(PM1.1)
	#define	PM1_2	(PM1.2)
	#define	PM1_3	(PM1.3)
	#define	PM1_4	(PM1.4)
	#define	PM1_5	(PM1.5)
	#define	PM1_6	(PM1.6)
	#define	PM1_7	(PM1.7)
#else
	#define	PM1_0	(pm1.BIT_NUMBER.bit0)
	#define	PM1_1	(pm1.BIT_NUMBER.bit1)
	#define	PM1_2	(pm1.BIT_NUMBER.bit2)
	#define	PM1_3	(pm1.BIT_NUMBER.bit3)
	#define	PM1_4	(pm1.BIT_NUMBER.bit4)
	#define	PM1_5	(pm1.BIT_NUMBER.bit5)
	#define	PM1_6	(pm1.BIT_NUMBER.bit6)
	#define	PM1_7	(pm1.BIT_NUMBER.bit7)
	#define	PM1	(pm1.ALL)
#endif

/* PM3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM3;

SFR_GLOBAL	SFR_PM3	pm3;

#ifdef __RL78__
	#define	PM3_0	(PM3.0)
	#define	PM3_1	(PM3.1)
	#define	PM3_2	(PM3.2)
	#define	PM3_3	(PM3.3)
	#define	PM3_4	(PM3.4)
	#define	PM3_5	(PM3.5)
	#define	PM3_6	(PM3.6)
	#define	PM3_7	(PM3.7)
#else
	#define	PM3_0	(pm3.BIT_NUMBER.bit0)
	#define	PM3_1	(pm3.BIT_NUMBER.bit1)
	#define	PM3_2	(pm3.BIT_NUMBER.bit2)
	#define	PM3_3	(pm3.BIT_NUMBER.bit3)
	#define	PM3_4	(pm3.BIT_NUMBER.bit4)
	#define	PM3_5	(pm3.BIT_NUMBER.bit5)
	#define	PM3_6	(pm3.BIT_NUMBER.bit6)
	#define	PM3_7	(pm3.BIT_NUMBER.bit7)
	#define	PM3	(pm3.ALL)
#endif

/* PM4 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM4;

SFR_GLOBAL	SFR_PM4	pm4;

#ifdef __RL78__
	#define	PM4_0	(PM4.0)
	#define	PM4_1	(PM4.1)
	#define	PM4_2	(PM4.2)
	#define	PM4_3	(PM4.3)
	#define	PM4_4	(PM4.4)
	#define	PM4_5	(PM4.5)
	#define	PM4_6	(PM4.6)
	#define	PM4_7	(PM4.7)
#else
	#define	PM4_0	(pm4.BIT_NUMBER.bit0)
	#define	PM4_1	(pm4.BIT_NUMBER.bit1)
	#define	PM4_2	(pm4.BIT_NUMBER.bit2)
	#define	PM4_3	(pm4.BIT_NUMBER.bit3)
	#define	PM4_4	(pm4.BIT_NUMBER.bit4)
	#define	PM4_5	(pm4.BIT_NUMBER.bit5)
	#define	PM4_6	(pm4.BIT_NUMBER.bit6)
	#define	PM4_7	(pm4.BIT_NUMBER.bit7)
	#define	PM4	(pm4.ALL)
#endif

/* PM5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM5;

SFR_GLOBAL	SFR_PM5	pm5;

#ifdef __RL78__
	#define	PM5_0	(PM5.0)
	#define	PM5_1	(PM5.1)
	#define	PM5_2	(PM5.2)
	#define	PM5_3	(PM5.3)
	#define	PM5_4	(PM5.4)
	#define	PM5_5	(PM5.5)
	#define	PM5_6	(PM5.6)
	#define	PM5_7	(PM5.7)
#else
	#define	PM5_0	(pm5.BIT_NUMBER.bit0)
	#define	PM5_1	(pm5.BIT_NUMBER.bit1)
	#define	PM5_2	(pm5.BIT_NUMBER.bit2)
	#define	PM5_3	(pm5.BIT_NUMBER.bit3)
	#define	PM5_4	(pm5.BIT_NUMBER.bit4)
	#define	PM5_5	(pm5.BIT_NUMBER.bit5)
	#define	PM5_6	(pm5.BIT_NUMBER.bit6)
	#define	PM5_7	(pm5.BIT_NUMBER.bit7)
	#define	PM5	(pm5.ALL)
#endif

/* PM6 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM6;

SFR_GLOBAL	SFR_PM6	pm6;

#ifdef __RL78__
	#define	PM6_0	(PM6.0)
	#define	PM6_1	(PM6.1)
	#define	PM6_2	(PM6.2)
	#define	PM6_3	(PM6.3)
	#define	PM6_4	(PM6.4)
	#define	PM6_5	(PM6.5)
	#define	PM6_6	(PM6.6)
	#define	PM6_7	(PM6.7)
#else
	#define	PM6_0	(pm6.BIT_NUMBER.bit0)
	#define	PM6_1	(pm6.BIT_NUMBER.bit1)
	#define	PM6_2	(pm6.BIT_NUMBER.bit2)
	#define	PM6_3	(pm6.BIT_NUMBER.bit3)
	#define	PM6_4	(pm6.BIT_NUMBER.bit4)
	#define	PM6_5	(pm6.BIT_NUMBER.bit5)
	#define	PM6_6	(pm6.BIT_NUMBER.bit6)
	#define	PM6_7	(pm6.BIT_NUMBER.bit7)
	#define	PM6	(pm6.ALL)
#endif

/* PM7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM7;

SFR_GLOBAL	SFR_PM7	pm7;

#ifdef __RL78__
	#define	PM7_0	(PM7.0)
	#define	PM7_1	(PM7.1)
	#define	PM7_2	(PM7.2)
	#define	PM7_3	(PM7.3)
	#define	PM7_4	(PM7.4)
	#define	PM7_5	(PM7.5)
	#define	PM7_6	(PM7.6)
	#define	PM7_7	(PM7.7)
#else
	#define	PM7_0	(pm7.BIT_NUMBER.bit0)
	#define	PM7_1	(pm7.BIT_NUMBER.bit1)
	#define	PM7_2	(pm7.BIT_NUMBER.bit2)
	#define	PM7_3	(pm7.BIT_NUMBER.bit3)
	#define	PM7_4	(pm7.BIT_NUMBER.bit4)
	#define	PM7_5	(pm7.BIT_NUMBER.bit5)
	#define	PM7_6	(pm7.BIT_NUMBER.bit6)
	#define	PM7_7	(pm7.BIT_NUMBER.bit7)
	#define	PM7	(pm7.ALL)
#endif

/* PM8 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM8;

