turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_PM8	pm8;

#ifdef __RL78__
	#define	PM8_0	(PM8.0)
	#define	PM8_1	(PM8.1)
	#define	PM8_2	(PM8.2)
	#define	PM8_3	(PM8.3)
	#define	PM8_4	(PM8.4)
	#define	PM8_5	(PM8.5)
	#define	PM8_6	(PM8.6)
	#define	PM8_7	(PM8.7)
#else
	#define	PM8_0	(pm8.BIT_NUMBER.bit0)
	#define	PM8_1	(pm8.BIT_NUMBER.bit1)
	#define	PM8_2	(pm8.BIT_NUMBER.bit2)
	#define	PM8_3	(pm8.BIT_NUMBER.bit3)
	#define	PM8_4	(pm8.BIT_NUMBER.bit4)
	#define	PM8_5	(pm8.BIT_NUMBER.bit5)
	#define	PM8_6	(pm8.BIT_NUMBER.bit6)
	#define	PM8_7	(pm8.BIT_NUMBER.bit7)
	#define	PM8	(pm8.ALL)
#endif

/* PM9 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM9;

SFR_GLOBAL	SFR_PM9	pm9;

#ifdef __RL78__
	#define	PM9_0	(PM9.0)
	#define	PM9_1	(PM9.1)
	#define	PM9_2	(PM9.2)
	#define	PM9_3	(PM9.3)
	#define	PM9_4	(PM9.4)
	#define	PM9_5	(PM9.5)
	#define	PM9_6	(PM9.6)
	#define	PM9_7	(PM9.7)
#else
	#define	PM9_0	(pm9.BIT_NUMBER.bit0)
	#define	PM9_1	(pm9.BIT_NUMBER.bit1)
	#define	PM9_2	(pm9.BIT_NUMBER.bit2)
	#define	PM9_3	(pm9.BIT_NUMBER.bit3)
	#define	PM9_4	(pm9.BIT_NUMBER.bit4)
	#define	PM9_5	(pm9.BIT_NUMBER.bit5)
	#define	PM9_6	(pm9.BIT_NUMBER.bit6)
	#define	PM9_7	(pm9.BIT_NUMBER.bit7)
	#define	PM9	(pm9.ALL)
#endif

/* PM10 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM10;

SFR_GLOBAL	SFR_PM10	pm10;

#ifdef __RL78__
	#define	PM10_0	(PM10.0)
	#define	PM10_1	(PM10.1)
	#define	PM10_2	(PM10.2)
	#define	PM10_3	(PM10.3)
	#define	PM10_4	(PM10.4)
	#define	PM10_5	(PM10.5)
	#define	PM10_6	(PM10.6)
	#define	PM10_7	(PM10.7)
#else
	#define	PM10_0	(pm10.BIT_NUMBER.bit0)
	#define	PM10_1	(pm10.BIT_NUMBER.bit1)
	#define	PM10_2	(pm10.BIT_NUMBER.bit2)
	#define	PM10_3	(pm10.BIT_NUMBER.bit3)
	#define	PM10_4	(pm10.BIT_NUMBER.bit4)
	#define	PM10_5	(pm10.BIT_NUMBER.bit5)
	#define	PM10_6	(pm10.BIT_NUMBER.bit6)
	#define	PM10_7	(pm10.BIT_NUMBER.bit7)
	#define	PM10	(pm10.ALL)
#endif

/* PM12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM12;

SFR_GLOBAL	SFR_PM12	pm12;

#ifdef __RL78__
	#define	PM12_0	(PM12.0)
	#define	PM12_1	(PM12.1)
	#define	PM12_2	(PM12.2)
	#define	PM12_3	(PM12.3)
	#define	PM12_4	(PM12.4)
	#define	PM12_5	(PM12.5)
	#define	PM12_6	(PM12.6)
	#define	PM12_7	(PM12.7)
#else
	#define	PM12_0	(pm12.BIT_NUMBER.bit0)
	#define	PM12_1	(pm12.BIT_NUMBER.bit1)
	#define	PM12_2	(pm12.BIT_NUMBER.bit2)
	#define	PM12_3	(pm12.BIT_NUMBER.bit3)
	#define	PM12_4	(pm12.BIT_NUMBER.bit4)
	#define	PM12_5	(pm12.BIT_NUMBER.bit5)
	#define	PM12_6	(pm12.BIT_NUMBER.bit6)
	#define	PM12_7	(pm12.BIT_NUMBER.bit7)
	#define	PM12	(pm12.ALL)
#endif

/* PM14 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM14;

SFR_GLOBAL	SFR_PM14	pm14;

#ifdef __RL78__
	#define	PM14_0	(PM14.0)
	#define	PM14_1	(PM14.1)
	#define	PM14_2	(PM14.2)
	#define	PM14_3	(PM14.3)
	#define	PM14_4	(PM14.4)
	#define	PM14_5	(PM14.5)
	#define	PM14_6	(PM14.6)
	#define	PM14_7	(PM14.7)
#else
	#define	PM14_0	(pm14.BIT_NUMBER.bit0)
	#define	PM14_1	(pm14.BIT_NUMBER.bit1)
	#define	PM14_2	(pm14.BIT_NUMBER.bit2)
	#define	PM14_3	(pm14.BIT_NUMBER.bit3)
	#define	PM14_4	(pm14.BIT_NUMBER.bit4)
	#define	PM14_5	(pm14.BIT_NUMBER.bit5)
	#define	PM14_6	(pm14.BIT_NUMBER.bit6)
	#define	PM14_7	(pm14.BIT_NUMBER.bit7)
	#define	PM14	(pm14.ALL)
#endif

/* PM15 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PM15;

SFR_GLOBAL	SFR_PM15	pm15;

#ifdef __RL78__
	#define	PM15_0	(PM15.0)
	#define	PM15_1	(PM15.1)
	#define	PM15_2	(PM15.2)
	#define	PM15_3	(PM15.3)
	#define	PM15_4	(PM15.4)
	#define	PM15_5	(PM15.5)
	#define	PM15_6	(PM15.6)
	#define	PM15_7	(PM15.7)
#else
	#define	PM15_0	(pm15.BIT_NUMBER.bit0)
	#define	PM15_1	(pm15.BIT_NUMBER.bit1)
	#define	PM15_2	(pm15.BIT_NUMBER.bit2)
	#define	PM15_3	(pm15.BIT_NUMBER.bit3)
	#define	PM15_4	(pm15.BIT_NUMBER.bit4)
	#define	PM15_5	(pm15.BIT_NUMBER.bit5)
	#define	PM15_6	(pm15.BIT_NUMBER.bit6)
	#define	PM15_7	(pm15.BIT_NUMBER.bit7)
	#define	PM15	(pm15.ALL)
#endif

/* ADM0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADM0;

SFR_GLOBAL	SFR_ADM0	adm0;

#ifdef __RL78__
	#define	ADM0_0	(ADM0.0)
	#define	ADM0_1	(ADM0.1)
	#define	ADM0_2	(ADM0.2)
	#define	ADM0_3	(ADM0.3)
	#define	ADM0_4	(ADM0.4)
	#define	ADM0_5	(ADM0.5)
	#define	ADM0_6	(ADM0.6)
	#define	ADM0_7	(ADM0.7)
#else
	#define	ADCE	(adm0.BIT_NUMBER.bit0)
	#define	ADCS	(adm0.BIT_NUMBER.bit7)
	#define	ADM0_0	(adm0.BIT_NUMBER.bit0)
	#define	ADM0_1	(adm0.BIT_NUMBER.bit1)
	#define	ADM0_2	(adm0.BIT_NUMBER.bit2)
	#define	ADM0_3	(adm0.BIT_NUMBER.bit3)
	#define	ADM0_4	(adm0.BIT_NUMBER.bit4)
	#define	ADM0_5	(adm0.BIT_NUMBER.bit5)
	#define	ADM0_6	(adm0.BIT_NUMBER.bit6)
	#define	ADM0_7	(adm0.BIT_NUMBER.bit7)
	#define	ADM0	(adm0.ALL)
#endif

/* ADS */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADS;

SFR_GLOBAL	SFR_ADS	ads;

#ifdef __RL78__
	#define	ADS_0	(ADS.0)
	#define	ADS_1	(ADS.1)
	#define	ADS_2	(ADS.2)
	#define	ADS_3	(ADS.3)
	#define	ADS_4	(ADS.4)
	#define	ADS_5	(ADS.5)
	#define	ADS_6	(ADS.6)
	#define	ADS_7	(ADS.7)
#else
	#define	ADS_0	(ads.BIT_NUMBER.bit0)
	#define	ADS_1	(ads.BIT_NUMBER.bit1)
	#define	ADS_2	(ads.BIT_NUMBER.bit2)
	#define	ADS_3	(ads.BIT_NUMBER.bit3)
	#define	ADS_4	(ads.BIT_NUMBER.bit4)
	#define	ADS_5	(ads.BIT_NUMBER.bit5)
	#define	ADS_6	(ads.BIT_NUMBER.bit6)
	#define	ADS_7	(ads.BIT_NUMBER.bit7)
	#define	ADS	(ads.ALL)
#endif

/* ADM1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADM1;

SFR_GLOBAL	SFR_ADM1	adm1;

#ifdef __RL78__
	#define	ADM1_0	(ADM1.0)
	#define	ADM1_1	(ADM1.1)
	#define	ADM1_2	(ADM1.2)
	#define	ADM1_3	(ADM1.3)
	#define	ADM1_4	(ADM1.4)
	#define	ADM1_5	(ADM1.5)
	#define	ADM1_6	(ADM1.6)
	#define	ADM1_7	(ADM1.7)
#else
	#define	ADM1_0	(adm1.BIT_NUMBER.bit0)
	#define	ADM1_1	(adm1.BIT_NUMBER.bit1)
	#define	ADM1_2	(adm1.BIT_NUMBER.bit2)
	#define	ADM1_3	(adm1.BIT_NUMBER.bit3)
	#define	ADM1_4	(adm1.BIT_NUMBER.bit4)
	#define	ADM1_5	(adm1.BIT_NUMBER.bit5)
	#define	ADM1_6	(adm1.BIT_NUMBER.bit6)
	#define	ADM1_7	(adm1.BIT_NUMBER.bit7)
	#define	ADM1	(adm1.ALL)
#endif

