turatsamar/DRV8889/src/rl78_ca78k0r.h
/* DACS0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	dacs0;

#ifdef __RL78__
#else
	#define	DACS0	(dacs0)
#endif

/* DAM */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DAM;

SFR_GLOBAL	SFR_DAM	dam;

#ifdef __RL78__
	#define	DAM_0	(DAM.0)
	#define	DAM_1	(DAM.1)
	#define	DAM_2	(DAM.2)
	#define	DAM_3	(DAM.3)
	#define	DAM_4	(DAM.4)
	#define	DAM_5	(DAM.5)
	#define	DAM_6	(DAM.6)
	#define	DAM_7	(DAM.7)
#else
	#define	DACE0	(dam.BIT_NUMBER.bit4)
	#define	DAM_0	(dam.BIT_NUMBER.bit0)
	#define	DAM_1	(dam.BIT_NUMBER.bit1)
	#define	DAM_2	(dam.BIT_NUMBER.bit2)
	#define	DAM_3	(dam.BIT_NUMBER.bit3)
	#define	DAM_4	(dam.BIT_NUMBER.bit4)
	#define	DAM_5	(dam.BIT_NUMBER.bit5)
	#define	DAM_6	(dam.BIT_NUMBER.bit6)
	#define	DAM_7	(dam.BIT_NUMBER.bit7)
	#define	DAM	(dam.ALL)
#endif

/* KRM */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_KRM;

SFR_GLOBAL	SFR_KRM	krm;

#ifdef __RL78__
	#define	KRM_0	(KRM.0)
	#define	KRM_1	(KRM.1)
	#define	KRM_2	(KRM.2)
	#define	KRM_3	(KRM.3)
	#define	KRM_4	(KRM.4)
	#define	KRM_5	(KRM.5)
	#define	KRM_6	(KRM.6)
	#define	KRM_7	(KRM.7)
#else
	#define	KRM_0	(krm.BIT_NUMBER.bit0)
	#define	KRM_1	(krm.BIT_NUMBER.bit1)
	#define	KRM_2	(krm.BIT_NUMBER.bit2)
	#define	KRM_3	(krm.BIT_NUMBER.bit3)
	#define	KRM_4	(krm.BIT_NUMBER.bit4)
	#define	KRM_5	(krm.BIT_NUMBER.bit5)
	#define	KRM_6	(krm.BIT_NUMBER.bit6)
	#define	KRM_7	(krm.BIT_NUMBER.bit7)
	#define	KRM	(krm.ALL)
#endif

/* EGP0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_EGP;

SFR_GLOBAL	SFR_EGP	egp;

#ifdef __RL78__
	#define	EGP_0	(EGP.0)
	#define	EGP_1	(EGP.1)
	#define	EGP_2	(EGP.2)
	#define	EGP_3	(EGP.3)
	#define	EGP_4	(EGP.4)
	#define	EGP_5	(EGP.5)
	#define	EGP_6	(EGP.6)
	#define	EGP_7	(EGP.7)
#else
	#define	EGP_0	(egp.BIT_NUMBER.bit0)
	#define	EGP_1	(egp.BIT_NUMBER.bit1)
	#define	EGP_2	(egp.BIT_NUMBER.bit2)
	#define	EGP_3	(egp.BIT_NUMBER.bit3)
	#define	EGP_4	(egp.BIT_NUMBER.bit4)
	#define	EGP_5	(egp.BIT_NUMBER.bit5)
	#define	EGP_6	(egp.BIT_NUMBER.bit6)
	#define	EGP_7	(egp.BIT_NUMBER.bit7)
	#define	EGP	(egp.ALL)
#endif

/* EGN0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_EGN;

SFR_GLOBAL	SFR_EGN	egn;

#ifdef __RL78__
	#define	EGN_0	(EGN.0)
	#define	EGN_1	(EGN.1)
	#define	EGN_2	(EGN.2)
	#define	EGN_3	(EGN.3)
	#define	EGN_4	(EGN.4)
	#define	EGN_5	(EGN.5)
	#define	EGN_6	(EGN.6)
	#define	EGN_7	(EGN.7)
#else
	#define	EGN_0	(egn.BIT_NUMBER.bit0)
	#define	EGN_1	(egn.BIT_NUMBER.bit1)
	#define	EGN_2	(egn.BIT_NUMBER.bit2)
	#define	EGN_3	(egn.BIT_NUMBER.bit3)
	#define	EGN_4	(egn.BIT_NUMBER.bit4)
	#define	EGN_5	(egn.BIT_NUMBER.bit5)
	#define	EGN_6	(egn.BIT_NUMBER.bit6)
	#define	EGN_7	(egn.BIT_NUMBER.bit7)
	#define	EGN	(egn.ALL)
#endif

/* EGP1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_EGP1;

SFR_GLOBAL	SFR_EGP1	egp1;

#ifdef __RL78__
	#define	EGP1_0	(EGP1.0)
	#define	EGP1_1	(EGP1.1)
	#define	EGP1_2	(EGP1.2)
	#define	EGP1_3	(EGP1.3)
	#define	EGP1_4	(EGP1.4)
	#define	EGP1_5	(EGP1.5)
	#define	EGP1_6	(EGP1.6)
	#define	EGP1_7	(EGP1.7)
#else
	#define	EGP1_0	(egp1.BIT_NUMBER.bit0)
	#define	EGP1_1	(egp1.BIT_NUMBER.bit1)
	#define	EGP1_2	(egp1.BIT_NUMBER.bit2)
	#define	EGP1_3	(egp1.BIT_NUMBER.bit3)
	#define	EGP1_4	(egp1.BIT_NUMBER.bit4)
	#define	EGP1_5	(egp1.BIT_NUMBER.bit5)
	#define	EGP1_6	(egp1.BIT_NUMBER.bit6)
	#define	EGP1_7	(egp1.BIT_NUMBER.bit7)
	#define	EGP1	(egp1.ALL)
#endif

/* EGN1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_EGN1;

SFR_GLOBAL	SFR_EGN	egn1;

#ifdef __RL78__
	#define	EGN1_0	(EGN1.0)
	#define	EGN1_1	(EGN1.1)
	#define	EGN1_2	(EGN1.2)
	#define	EGN1_3	(EGN1.3)
	#define	EGN1_4	(EGN1.4)
	#define	EGN1_5	(EGN1.5)
	#define	EGN1_6	(EGN1.6)
	#define	EGN1_7	(EGN1.7)
#else
	#define	EGN1_0	(egn1.BIT_NUMBER.bit0)
	#define	EGN1_1	(egn1.BIT_NUMBER.bit1)
	#define	EGN1_2	(egn1.BIT_NUMBER.bit2)
	#define	EGN1_3	(egn1.BIT_NUMBER.bit3)
	#define	EGN1_4	(egn1.BIT_NUMBER.bit4)
	#define	EGN1_5	(egn1.BIT_NUMBER.bit5)
	#define	EGN1_6	(egn1.BIT_NUMBER.bit6)
	#define	EGN1_7	(egn1.BIT_NUMBER.bit7)
	#define	EGN1	(egn1.ALL)
#endif

/* SDR10L */
#ifdef __RL78__
#else
	#define	SDR10L	(sdr10.BYTE.sdr10l)
#endif

/* SDR10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sdr10l;
	SFR_UNSIGNED_SHORT_INT	sdr10h;
}SFR_BYTE_SDR10;

typedef union{
	SFR_BYTE_SDR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SDR10;

SFR_GLOBAL	SFR_SDR10	sdr10;

#ifdef __RL78__
#else
	#define	SDR10	(sdr10.ALL)
#endif

/* SDR11L */
#ifdef __RL78__
#else
	#define	SDR11L	(sdr11.BYTE.sdr11l)
#endif

/* SDR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sdr11l;
	SFR_UNSIGNED_SHORT_INT	sdr11h;
}SFR_BYTE_SDR11;

typedef union{
	SFR_BYTE_SDR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SDR11;

SFR_GLOBAL	SFR_SDR11	sdr11;

#ifdef __RL78__
#else
	#define	SDR11	(sdr11.ALL)
#endif

/* IICA0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	iica0;

#ifdef __RL78__
#else
	#define	IICA0	(iica0)
#endif

/* IICS0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_IICS0;

SFR_GLOBAL	SFR_IICS0	iics0;

#ifdef __RL78__
	#define	IICS0_0	(IICS0.0)
	#define	IICS0_1	(IICS0.1)
	#define	IICS0_2	(IICS0.2)
	#define	IICS0_3	(IICS0.3)
	#define	IICS0_4	(IICS0.4)
	#define	IICS0_5	(IICS0.5)
	#define	IICS0_6	(IICS0.6)
	#define	IICS0_7	(IICS0.7)
#else
	#define	SPD0		(iics0.BIT_NUMBER.bit0)
	#define	STD0		(iics0.BIT_NUMBER.bit1)
	#define	ACKD0		(iics0.BIT_NUMBER.bit2)
	#define	TRC0		(iics0.BIT_NUMBER.bit3)
	#define	COI0		(iics0.BIT_NUMBER.bit4)
	#define	EXC0		(iics0.BIT_NUMBER.bit5)
	#define	ALD0		(iics0.BIT_NUMBER.bit6)
	#define	MSTS0		(iics0.BIT_NUMBER.bit7)
	#define	IICS0_0		(iics0.BIT_NUMBER.bit0)
	#define	IICS0_1		(iics0.BIT_NUMBER.bit1)
	#define	IICS0_2		(iics0.BIT_NUMBER.bit2)
	#define	IICS0_3		(iics0.BIT_NUMBER.bit3)
	#define	IICS0_4		(iics0.BIT_NUMBER.bit4)
	#define	IICS0_5		(iics0.BIT_NUMBER.bit5)
	#define	IICS0_6		(iics0.BIT_NUMBER.bit6)
	#define	IICS0_7		(iics0.BIT_NUMBER.bit7)
	#define	IICS0		(iics0.ALL)
#endif

