turatsamar/DRV8889/src/rl78_ca78k0r.h
/* IICF0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_IICF0;

SFR_GLOBAL	SFR_IICF0	iicf0;

#ifdef __RL78__
	#define	IICF0_0	(IICF0.0)
	#define	IICF0_1	(IICF0.1)
	#define	IICF0_2	(IICF0.2)
	#define	IICF0_3	(IICF0.3)
	#define	IICF0_4	(IICF0.4)
	#define	IICF0_5	(IICF0.5)
	#define	IICF0_6	(IICF0.6)
	#define	IICF0_7	(IICF0.7)
#else
	#define	IICRSV0		(iicf0.BIT_NUMBER.bit0)
	#define	STCEN0		(iicf0.BIT_NUMBER.bit1)
	#define	IICBSY0		(iicf0.BIT_NUMBER.bit6)
	#define	STCF0		(iicf0.BIT_NUMBER.bit7)
	#define	IICF0_0		(iicf0.BIT_NUMBER.bit0)
	#define	IICF0_1		(iicf0.BIT_NUMBER.bit1)
	#define	IICF0_2		(iicf0.BIT_NUMBER.bit2)
	#define	IICF0_3		(iicf0.BIT_NUMBER.bit3)
	#define	IICF0_4		(iicf0.BIT_NUMBER.bit4)
	#define	IICF0_5		(iicf0.BIT_NUMBER.bit5)
	#define	IICF0_6		(iicf0.BIT_NUMBER.bit6)
	#define	IICF0_7		(iicf0.BIT_NUMBER.bit7)
	#define	IICF0		(iicf0.ALL)
#endif

/*SUBCUDW*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT subsudw;
#ifdef __RL78__
#else
	#define	SUBCUDW	(subsudw)
#endif

/*TRDGRC0*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrc0;
#ifdef __RL78__
#else
	#define	TRDGRC0	(trdgrc0)
#endif

/*TRDGRD0*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrd0;
#ifdef __RL78__
#else
	#define	TRDGRD0	(trdgrd0)
#endif

/*TRDGRC1*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrc1;
#ifdef __RL78__
#else
	#define	TRDGRC1	(trdgrc1)
#endif

/*TRDGRD1*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrd1;
#ifdef __RL78__
#else
	#define	TRDGRD1	(trdgrd1)
#endif

/*TDR02*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr02;
#ifdef __RL78__
#else
	#define	TDR02	(tdr02)
#endif

/* TDR03L */
#ifdef __RL78__
#else
	#define	TDR03L	(tdr03.BYTE.tdr03l)
#endif

/* TDR03H */
#ifdef __RL78__
#else
	#define	TDR03H	(tdr03.BYTE.tdr03h)
#endif

/* TDR03 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tdr03l;
	SFR_UNSIGNED_SHORT_INT	tdr03h;
}SFR_BYTE_TDR03;

typedef union{
	SFR_BYTE_TDR03	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TDR03;

SFR_GLOBAL	SFR_TDR03	tdr03;

#ifdef __RL78__
#else
	#define	TDR03	(tdr03.ALL)
#endif

/*TDR04*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr04;
#ifdef __RL78__
#else
	#define	TDR04	(tdr04)
#endif

/*TDR05*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr05;
#ifdef __RL78__
#else
	#define	TDR05	(tdr05)
#endif

/*TDR06*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr06;
#ifdef __RL78__
#else
	#define	TDR06	(tdr06)
#endif

/*TDR07*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr07;
#ifdef __RL78__
#else
	#define	TDR07	(tdr07)
#endif

/*TDR10*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr10;
#ifdef __RL78__
#else
	#define	TDR10	(tdr10)
#endif

/* TDR11L */
#ifdef __RL78__
#else
	#define	TDR11L	(tdr11.BYTE.tdr11l)
#endif

/* TDR11H */
#ifdef __RL78__
#else
	#define	TDR11H	(tdr11.BYTE.tdr11h)
#endif

/* TDR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tdr11l;
	SFR_UNSIGNED_SHORT_INT	tdr11h;
}SFR_BYTE_TDR11;

typedef union{
	SFR_BYTE_TDR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TDR11;

SFR_GLOBAL	SFR_TDR11	tdr11;

#ifdef __RL78__
#else
	#define	TDR11	(tdr11.ALL)
#endif

/*TDR12*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr12;
#ifdef __RL78__
#else
	#define	TDR12	(tdr12)
#endif

/* TDR13L */
#ifdef __RL78__
#else
	#define	TDR13L	(tdr13.BYTE.tdr13l)
#endif

/* TDR13H */
#ifdef __RL78__
#else
	#define	TDR13H	(tdr13.BYTE.tdr13h)
#endif

/* TDR13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tdr13l;
	SFR_UNSIGNED_SHORT_INT	tdr13h;
}SFR_BYTE_TDR13;

typedef union{
	SFR_BYTE_TDR13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TDR13;

SFR_GLOBAL	SFR_TDR13	tdr13;

#ifdef __RL78__
#else
	#define	TDR13	(tdr13.ALL)
#endif

/*TDR14*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr14;
#ifdef __RL78__
#else
	#define	TDR14	(tdr14)
#endif

/*TDR15*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr15;
#ifdef __RL78__
#else
	#define	TDR15	(tdr15)
#endif

/*TDR16*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr16;
#ifdef __RL78__
#else
	#define	TDR16	(tdr16)
#endif

/*TDR17*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tdr17;
#ifdef __RL78__
#else
	#define	TDR17	(tdr17)
#endif

/* SEC */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	sec;

#ifdef __RL78__
#else
	#define	SEC	(sec)
#endif

/* MIN */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	min;

#ifdef __RL78__
#else
	#define	MIN	(min)
#endif

/* HOUR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	hour;

#ifdef __RL78__
#else
	#define	HOUR	(hour)
#endif

/* WEEK */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	week;

#ifdef __RL78__
#else
	#define	WEEK	(week)
#endif

/* DAY */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	day;

#ifdef __RL78__
#else
	#define	DAY	(day)
#endif

/* MONTH */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	month;

#ifdef __RL78__
#else
	#define	MONTH	(month)
#endif

/* YEAR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	year;

#ifdef __RL78__
#else
	#define	YEAR	(year)
#endif

/* SUBCUD */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	subcud;

#ifdef __RL78__
#else
	#define	SUBCUD	(subcud)
#endif

/* ALARMWM */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	alarmwm;

#ifdef __RL78__
#else
	#define	ALARMWM	(alarmwm)
#endif

/* ALARMWH */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	alarmwh;

#ifdef __RL78__
#else
	#define	ALARMWH	(alarmwh)
#endif

/* ALARMWW */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	alarmww;

#ifdef __RL78__
#else
	#define	ALARMWW	(alarmww)
#endif

/* RTCC0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_RTCC0;

SFR_GLOBAL	SFR_RTCC0	rtcc0;

#ifdef __RL78__
	#define	RTCC0_0	(RTCC0.0)
	#define	RTCC0_1	(RTCC0.1)
	#define	RTCC0_2	(RTCC0.2)
	#define	RTCC0_3	(RTCC0.3)
	#define	RTCC0_4	(RTCC0.4)
	#define	RTCC0_5	(RTCC0.5)
	#define	RTCC0_6	(RTCC0.6)
	#define	RTCC0_7	(RTCC0.7)
#else
	#define	RCLOE1		(rtcc0.BIT_NUMBER.bit5)
	#define	RTCE		(rtcc0.BIT_NUMBER.bit7)
	#define	RTCC0_0		(rtcc0.BIT_NUMBER.bit0)
	#define	RTCC0_1		(rtcc0.BIT_NUMBER.bit1)
	#define	RTCC0_2		(rtcc0.BIT_NUMBER.bit2)
	#define	RTCC0_3		(rtcc0.BIT_NUMBER.bit3)
	#define	RTCC0_4		(rtcc0.BIT_NUMBER.bit4)
	#define	RTCC0_5		(rtcc0.BIT_NUMBER.bit5)
	#define	RTCC0_6		(rtcc0.BIT_NUMBER.bit6)
	#define	RTCC0_7		(rtcc0.BIT_NUMBER.bit7)
	#define	RTCC0		(rtcc0.ALL)
#endif

/* RTCC1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_RTCC1;

