turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_RTCC1	rtcc1;

#ifdef __RL78__
	#define	RTCC1_0	(RTCC1.0)
	#define	RTCC1_1	(RTCC1.1)
	#define	RTCC1_2	(RTCC1.2)
	#define	RTCC1_3	(RTCC1.3)
	#define	RTCC1_4	(RTCC1.4)
	#define	RTCC1_5	(RTCC1.5)
	#define	RTCC1_6	(RTCC1.6)
	#define	RTCC1_7	(RTCC1.7)
#else
	#define	RWAIT		(rtcc1.BIT_NUMBER.bit0)
	#define	RWST		(rtcc1.BIT_NUMBER.bit1)
	#define	RIFG		(rtcc1.BIT_NUMBER.bit3)
	#define	WAFG		(rtcc1.BIT_NUMBER.bit4)
	#define	WALIE		(rtcc1.BIT_NUMBER.bit6)
	#define	WALE		(rtcc1.BIT_NUMBER.bit7)
	#define	RTCC1_0		(rtcc1.BIT_NUMBER.bit0)
	#define	RTCC1_1		(rtcc1.BIT_NUMBER.bit1)
	#define	RTCC1_2		(rtcc1.BIT_NUMBER.bit2)
	#define	RTCC1_3		(rtcc1.BIT_NUMBER.bit3)
	#define	RTCC1_4		(rtcc1.BIT_NUMBER.bit4)
	#define	RTCC1_5		(rtcc1.BIT_NUMBER.bit5)
	#define	RTCC1_6		(rtcc1.BIT_NUMBER.bit6)
	#define	RTCC1_7		(rtcc1.BIT_NUMBER.bit7)
	#define	RTCC1		(rtcc1.ALL)
#endif

/* CMC */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	cmc;

#ifdef __RL78__
#else
	#define	CMC	(cmc)
#endif

/* CSC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CSC;

SFR_GLOBAL	SFR_CSC	csc;

#ifdef __RL78__
	#define	CSC_0	(CSC.0)
	#define	CSC_1	(CSC.1)
	#define	CSC_2	(CSC.2)
	#define	CSC_3	(CSC.3)
	#define	CSC_4	(CSC.4)
	#define	CSC_5	(CSC.5)
	#define	CSC_6	(CSC.6)
	#define	CSC_7	(CSC.7)
#else
	#define	HIOSTOP		(csc.BIT_NUMBER.bit0)
	#define	XTSTOP		(csc.BIT_NUMBER.bit6)
	#define	MSTOP		(csc.BIT_NUMBER.bit7)
	#define	CSC_0		(csc.BIT_NUMBER.bit0)
	#define	CSC_1		(csc.BIT_NUMBER.bit1)
	#define	CSC_2		(csc.BIT_NUMBER.bit2)
	#define	CSC_3		(csc.BIT_NUMBER.bit3)
	#define	CSC_4		(csc.BIT_NUMBER.bit4)
	#define	CSC_5		(csc.BIT_NUMBER.bit5)
	#define	CSC_6		(csc.BIT_NUMBER.bit6)
	#define	CSC_7		(csc.BIT_NUMBER.bit7)
	#define	CSC		(csc.ALL)
#endif

/* OSTC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_OSTC;

SFR_GLOBAL	SFR_OSTC	ostc;

#ifdef __RL78__
	#define	OSTC_0	(OSTC.0)
	#define	OSTC_1	(OSTC.1)
	#define	OSTC_2	(OSTC.2)
	#define	OSTC_3	(OSTC.3)
	#define	OSTC_4	(OSTC.4)
	#define	OSTC_5	(OSTC.5)
	#define	OSTC_6	(OSTC.6)
	#define	OSTC_7	(OSTC.7)
#else
	#define	OSTC_0	(ostc.BIT_NUMBER.bit0)
	#define	OSTC_1	(ostc.BIT_NUMBER.bit1)
	#define	OSTC_2	(ostc.BIT_NUMBER.bit2)
	#define	OSTC_3	(ostc.BIT_NUMBER.bit3)
	#define	OSTC_4	(ostc.BIT_NUMBER.bit4)
	#define	OSTC_5	(ostc.BIT_NUMBER.bit5)
	#define	OSTC_6	(ostc.BIT_NUMBER.bit6)
	#define	OSTC_7	(ostc.BIT_NUMBER.bit7)
	#define	OSTC	(ostc.ALL)
#endif

/* OSTS */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	osts;

#ifdef __RL78__
#else
	#define	OSTS	(osts)
#endif

/* CKC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CKC;

SFR_GLOBAL	SFR_CKC	ckc;

#ifdef __RL78__
	#define	CKC_0	(CKC.0)
	#define	CKC_1	(CKC.1)
	#define	CKC_2	(CKC.2)
	#define	CKC_3	(CKC.3)
	#define	CKC_4	(CKC.4)
	#define	CKC_5	(CKC.5)
	#define	CKC_6	(CKC.6)
	#define	CKC_7	(CKC.7)
#else
	#define	MCM0		(ckc.BIT_NUMBER.bit4)
	#define	MCS			(ckc.BIT_NUMBER.bit5)
	#define	CSS			(ckc.BIT_NUMBER.bit6)
	#define	CLS			(ckc.BIT_NUMBER.bit7)
	#define	CKC_0		(ckc.BIT_NUMBER.bit0)
	#define	CKC_1		(ckc.BIT_NUMBER.bit1)
	#define	CKC_2		(ckc.BIT_NUMBER.bit2)
	#define	CKC_3		(ckc.BIT_NUMBER.bit3)
	#define	CKC_4		(ckc.BIT_NUMBER.bit4)
	#define	CKC_5		(ckc.BIT_NUMBER.bit5)
	#define	CKC_6		(ckc.BIT_NUMBER.bit6)
	#define	CKC_7		(ckc.BIT_NUMBER.bit7)
	#define	CKC			(ckc.ALL)
#endif

/* CKS0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CKS0;

SFR_GLOBAL	SFR_CKS0	cks0;

#ifdef __RL78__
	#define	CKS0_0	(CKS0.0)
	#define	CKS0_1	(CKS0.1)
	#define	CKS0_2	(CKS0.2)
	#define	CKS0_3	(CKS0.3)
	#define	CKS0_4	(CKS0.4)
	#define	CKS0_5	(CKS0.5)
	#define	CKS0_6	(CKS0.6)
	#define	CKS0_7	(CKS0.7)
#else
	#define	PCLOE0		(cks0.BIT_NUMBER.bit7)
	#define	CKS0_0		(cks0.BIT_NUMBER.bit0)
	#define	CKS0_1		(cks0.BIT_NUMBER.bit1)
	#define	CKS0_2		(cks0.BIT_NUMBER.bit2)
	#define	CKS0_3		(cks0.BIT_NUMBER.bit3)
	#define	CKS0_4		(cks0.BIT_NUMBER.bit4)
	#define	CKS0_5		(cks0.BIT_NUMBER.bit5)
	#define	CKS0_6		(cks0.BIT_NUMBER.bit6)
	#define	CKS0_7		(cks0.BIT_NUMBER.bit7)
	#define	CKS0		(cks0.ALL)
#endif

/* RESF */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	resf;

#ifdef __RL78__
#else
	#define	RESF	(resf)
#endif

/* LVIM */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_LVIM;

SFR_GLOBAL	SFR_LVIM	lvim;

#ifdef __RL78__
	#define	LVIM_0	(LVIM.0)
	#define	LVIM_1	(LVIM.1)
	#define	LVIM_2	(LVIM.2)
	#define	LVIM_3	(LVIM.3)
	#define	LVIM_4	(LVIM.4)
	#define	LVIM_5	(LVIM.5)
	#define	LVIM_6	(LVIM.6)
	#define	LVIM_7	(LVIM.7)
#else
	#define	LVIF	(lvim.BIT_NUMBER.bit0)
	#define	LVIOMSK	(lvim.BIT_NUMBER.bit1)
	#define	LVISEN	(lvim.BIT_NUMBER.bit7)
	#define	LVIM_1	(lvim.BIT_NUMBER.bit1)
	#define	LVIM_2	(lvim.BIT_NUMBER.bit2)
	#define	LVIM_3	(lvim.BIT_NUMBER.bit3)
	#define	LVIM_4	(lvim.BIT_NUMBER.bit4)
	#define	LVIM_5	(lvim.BIT_NUMBER.bit5)
	#define	LVIM_6	(lvim.BIT_NUMBER.bit6)
	#define	LVIM_7	(lvim.BIT_NUMBER.bit7)
	#define	LVIM	(lvim.ALL)
#endif

/* LVIS */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_LVIS;

SFR_GLOBAL	SFR_LVIS	lvis;

#ifdef __RL78__
	#define	LVIS_0	(LVIS.0)
	#define	LVIS_1	(LVIS.1)
	#define	LVIS_2	(LVIS.2)
	#define	LVIS_3	(LVIS.3)
	#define	LVIS_4	(LVIS.4)
	#define	LVIS_5	(LVIS.5)
	#define	LVIS_6	(LVIS.6)
	#define	LVIS_7	(LVIS.7)
#else
	#define	LVILV	(lvis.BIT_NUMBER.bit0)
	#define	LVIMD	(lvis.BIT_NUMBER.bit7)
	#define	LVIS_1	(lvis.BIT_NUMBER.bit1)
	#define	LVIS_2	(lvis.BIT_NUMBER.bit2)
	#define	LVIS_3	(lvis.BIT_NUMBER.bit3)
	#define	LVIS_4	(lvis.BIT_NUMBER.bit4)
	#define	LVIS_5	(lvis.BIT_NUMBER.bit5)
	#define	LVIS_6	(lvis.BIT_NUMBER.bit6)
	#define	LVIS_7	(lvis.BIT_NUMBER.bit7)
	#define	LVIS	(lvis.ALL)
#endif

/* WDTE */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	wdte;

#ifdef __RL78__
#else
	#define	WDTE	(wdte)
#endif

/* CRCIN */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	crcin;

#ifdef __RL78__
#else
	#define	CRCIN	(crcin)
#endif

/* IF2L */
#ifdef __RL78__
	#define	IF2L_0	(IF2L.0)
	#define	IF2L_1	(IF2L.1)
	#define	IF2L_2	(IF2L.2)
	#define	IF2L_3	(IF2L.3)
	#define	IF2L_4	(IF2L.4)
	#define	IF2L_5	(IF2L.5)
	#define	IF2L_6	(IF2L.6)
	#define	IF2L_7	(IF2L.7)
#else
	#define	TMIF05		(if2.BIT_NUMBER_16.bit0)
	#define	TMIF06		(if2.BIT_NUMBER_16.bit1)
	#define	TMIF07		(if2.BIT_NUMBER_16.bit2)
	#define	PIF11		(if2.BIT_NUMBER_16.bit3)
	#define	LIN0WUPIF	(if2.BIT_NUMBER_16.bit3)
	#define	KRIF		(if2.BIT_NUMBER_16.bit4)
	#define	CAN0ERRIF	(if2.BIT_NUMBER_16.bit5)
	#define	CAN0WUPIF	(if2.BIT_NUMBER_16.bit6)
	#define	CAN0CFRIF	(if2.BIT_NUMBER_16.bit7)
	#define	IF2L_0		(if2.BIT_NUMBER_16.bit0)
	#define	IF2L_1		(if2.BIT_NUMBER_16.bit1)
	#define	IF2L_2		(if2.BIT_NUMBER_16.bit2)
	#define	IF2L_3		(if2.BIT_NUMBER_16.bit3)
	#define	IF2L_4		(if2.BIT_NUMBER_16.bit4)
	#define	IF2L_5		(if2.BIT_NUMBER_16.bit5)
	#define	IF2L_6		(if2.BIT_NUMBER_16.bit6)
	#define	IF2L_7		(if2.BIT_NUMBER_16.bit7)
	#define	IF2L		(if2.BYTE.if2l)
#endif

/* IF2H */
#ifdef __RL78__
	#define	IF2H_0	(IF2H.0)
	#define	IF2H_1	(IF2H.1)
	#define	IF2H_2	(IF2H.2)
	#define	IF2H_3	(IF2H.3)
	#define	IF2H_4	(IF2H.4)
	#define	IF2H_5	(IF2H.5)
	#define	IF2H_6	(IF2H.6)
	#define	IF2H_7	(IF2H.7)
#else
	#define	CAN0TRMIF	(if2.BIT_NUMBER_16.bit8)
	#define	CANGRFRIF	(if2.BIT_NUMBER_16.bit9)
	#define	CANGERRIF	(if2.BIT_NUMBER_16.bit10)
	#define	TMIF10		(if2.BIT_NUMBER_16.bit11)
	#define	TMIF11		(if2.BIT_NUMBER_16.bit12)
	#define	TMIF12		(if2.BIT_NUMBER_16.bit13)
	#define	TMIF13		(if2.BIT_NUMBER_16.bit14)
	#define	FLIF		(if2.BIT_NUMBER_16.bit15)
	#define	IF2H_0		(if2.BIT_NUMBER_16.bit8)
	#define	IF2H_1		(if2.BIT_NUMBER_16.bit9)
	#define	IF2H_2		(if2.BIT_NUMBER_16.bit10)
	#define	IF2H_3		(if2.BIT_NUMBER_16.bit11)
	#define	IF2H_4		(if2.BIT_NUMBER_16.bit12)
	#define	IF2H_5		(if2.BIT_NUMBER_16.bit13)
	#define	IF2H_6		(if2.BIT_NUMBER_16.bit14)
	#define	IF2H_7		(if2.BIT_NUMBER_16.bit15)
	#define	IF2H		(if2.BYTE.if2h)
#endif

