turatsamar/DRV8889/src/rl78_ca78k0r.h
/* IF2 */
typedef struct{
	SFR_UNSIGNED_CHAR	if2l;
	SFR_UNSIGNED_CHAR	if2h;
}SFR_BYTE_IF2;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_IF2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_IF2;

SFR_GLOBAL	SFR_IF2	if2;

#ifdef __RL78__
#else
	#define	IF2	(if2.ALL)
#endif

/* IF3L */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_IF3L;

SFR_GLOBAL	SFR_IF3L	if3l;

#ifdef __RL78__
	#define	IF3L_0	(IF3L.0)
	#define	IF3L_1	(IF3L.1)
	#define	IF3L_2	(IF3L.2)
	#define	IF3L_3	(IF3L.3)
	#define	IF3L_4	(IF3L.4)
	#define	IF3L_5	(IF3L.5)
	#define	IF3L_6	(IF3L.6)
	#define	IF3L_7	(IF3L.7)
#else
	#define	PIF12		(if3l.BIT_NUMBER.bit0)
	#define	LIN1WUPIF	(if3l.BIT_NUMBER.bit0)
	#define	LIN1TRMIF	(if3l.BIT_NUMBER.bit1)
	#define	LIN1RVCIF	(if3l.BIT_NUMBER.bit2)
	#define	LIN1STAIF	(if3l.BIT_NUMBER.bit3)
	#define	LIN1IF		(if3l.BIT_NUMBER.bit3)
	#define	TMIF14		(if3l.BIT_NUMBER.bit4)
	#define	TMIF15		(if3l.BIT_NUMBER.bit5)
	#define	TMIF16		(if3l.BIT_NUMBER.bit6)
	#define	TMIF17		(if3l.BIT_NUMBER.bit7)
	#define	IF3L_0		(if3l.BIT_NUMBER.bit0)
	#define	IF3L_1		(if3l.BIT_NUMBER.bit1)
	#define	IF3L_2		(if3l.BIT_NUMBER.bit2)
	#define	IF3L_3		(if3l.BIT_NUMBER.bit3)
	#define	IF3L_4		(if3l.BIT_NUMBER.bit4)
	#define	IF3L_5		(if3l.BIT_NUMBER.bit5)
	#define	IF3L_6		(if3l.BIT_NUMBER.bit6)
	#define	IF3L_7		(if3l.BIT_NUMBER.bit7)
	#define	IF3L		(if3l.ALL)
#endif

/* MK2L */
#ifdef __RL78__
	#define	MK2L_0	(MK2L.0)
	#define	MK2L_1	(MK2L.1)
	#define	MK2L_2	(MK2L.2)
	#define	MK2L_3	(MK2L.3)
	#define	MK2L_4	(MK2L.4)
	#define	MK2L_5	(MK2L.5)
	#define	MK2L_6	(MK2L.6)
	#define	MK2L_7	(MK2L.7)
#else
	#define	TMMK05			(mk2.BIT_NUMBER_16.bit0)
	#define	TMMK06			(mk2.BIT_NUMBER_16.bit1)
	#define	TMMK07			(mk2.BIT_NUMBER_16.bit2)
	#define	PMK11			(mk2.BIT_NUMBER_16.bit3)
	#define	LIN0WUPMK		(mk2.BIT_NUMBER_16.bit3)
	#define	KRMK			(mk2.BIT_NUMBER_16.bit4)
	#define	CAN0ERRMK		(mk2.BIT_NUMBER_16.bit5)
	#define	CAN0WUPMK		(mk2.BIT_NUMBER_16.bit6)
	#define	CAN0CFRMK		(mk2.BIT_NUMBER_16.bit7)
	#define	MK2L_0			(mk2.BIT_NUMBER_16.bit0)
	#define	MK2L_1			(mk2.BIT_NUMBER_16.bit1)
	#define	MK2L_2			(mk2.BIT_NUMBER_16.bit2)
	#define	MK2L_3			(mk2.BIT_NUMBER_16.bit3)
	#define	MK2L_4			(mk2.BIT_NUMBER_16.bit4)
	#define	MK2L_5			(mk2.BIT_NUMBER_16.bit5)
	#define	MK2L_6			(mk2.BIT_NUMBER_16.bit6)
	#define	MK2L_7			(mk2.BIT_NUMBER_16.bit7)
	#define	MK2L			(mk2.BYTE.mk2l)
#endif

/* MK2H */
#ifdef __RL78__
	#define	MK2H_0	(MK2H.0)
	#define	MK2H_1	(MK2H.1)
	#define	MK2H_2	(MK2H.2)
	#define	MK2H_3	(MK2H.3)
	#define	MK2H_4	(MK2H.4)
	#define	MK2H_5	(MK2H.5)
	#define	MK2H_6	(MK2H.6)
	#define	MK2H_7	(MK2H.7)
#else
	#define	CAN0TRMMK	(mk2.BIT_NUMBER_16.bit8)
	#define	CANGRFRMK	(mk2.BIT_NUMBER_16.bit9)
	#define	CANGERRMK	(mk2.BIT_NUMBER_16.bit10)
	#define	TMMK10		(mk2.BIT_NUMBER_16.bit11)
	#define	TMMK11		(mk2.BIT_NUMBER_16.bit12)
	#define	TMMK12		(mk2.BIT_NUMBER_16.bit13)
	#define	TMMK13		(mk2.BIT_NUMBER_16.bit14)
	#define	FLMK		(mk2.BIT_NUMBER_16.bit15)
	#define	MK2H_0		(mk2.BIT_NUMBER_16.bit8)
	#define	MK2H_1		(mk2.BIT_NUMBER_16.bit9)
	#define	MK2H_2		(mk2.BIT_NUMBER_16.bit10)
	#define	MK2H_3		(mk2.BIT_NUMBER_16.bit11)
	#define	MK2H_4		(mk2.BIT_NUMBER_16.bit12)
	#define	MK2H_5		(mk2.BIT_NUMBER_16.bit13)
	#define	MK2H_6		(mk2.BIT_NUMBER_16.bit14)
	#define	MK2H_7		(mk2.BIT_NUMBER_16.bit15)
	#define	MK2H		(mk2.BYTE.mk2h)
#endif

/* MK2 */
typedef struct{
	SFR_UNSIGNED_CHAR	mk2l;
	SFR_UNSIGNED_CHAR	mk2h;
}SFR_BYTE_MK2;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_MK2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_MK2;

SFR_GLOBAL	SFR_MK2	mk2;

#ifdef __RL78__
#else
	#define	MK2	(mk2.ALL)
#endif

/* MK3L */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_MK3L;

SFR_GLOBAL	SFR_MK3L	mk3l;

#ifdef __RL78__
	#define	MK3L_0	(MK3L.0)
	#define	MK3L_1	(MK3L.1)
	#define	MK3L_2	(MK3L.2)
	#define	MK3L_3	(MK3L.3)
	#define	MK3L_4	(MK3L.4)
	#define	MK3L_5	(MK3L.5)
	#define	MK3L_6	(MK3L.6)
	#define	MK3L_7	(MK3L.7)
#else
	#define	PMK12		(mk3l.BIT_NUMBER.bit0)
	#define	LIN1WUPMK	(mk3l.BIT_NUMBER.bit0)
	#define	LIN1TRMMK	(mk3l.BIT_NUMBER.bit1)
	#define	LIN1RVCMK	(mk3l.BIT_NUMBER.bit2)
	#define	LIN1STAMK	(mk3l.BIT_NUMBER.bit3)
	#define	LIN1MK		(mk3l.BIT_NUMBER.bit3)
	#define	TMMK14		(mk3l.BIT_NUMBER.bit4)
	#define	TMMK15		(mk3l.BIT_NUMBER.bit5)
	#define	TMMK16		(mk3l.BIT_NUMBER.bit6)
	#define	TMMK17		(mk3l.BIT_NUMBER.bit7)
	#define	MK3L_0		(mk3l.BIT_NUMBER.bit0)
	#define	MK3L_1		(mk3l.BIT_NUMBER.bit1)
	#define	MK3L_2		(mk3l.BIT_NUMBER.bit2)
	#define	MK3L_3		(mk3l.BIT_NUMBER.bit3)
	#define	MK3L_4		(mk3l.BIT_NUMBER.bit4)
	#define	MK3L_5		(mk3l.BIT_NUMBER.bit5)
	#define	MK3L_6		(mk3l.BIT_NUMBER.bit6)
	#define	MK3L_7		(mk3l.BIT_NUMBER.bit7)
	#define	MK3L		(mk3l.ALL)
#endif

/* PR02L */
#ifdef __RL78__
	#define	PR02L_0	(PR02L.0)
	#define	PR02L_1	(PR02L.1)
	#define	PR02L_2	(PR02L.2)
	#define	PR02L_3	(PR02L.3)
	#define	PR02L_4	(PR02L.4)
	#define	PR02L_5	(PR02L.5)
	#define	PR02L_6	(PR02L.6)
	#define	PR02L_7	(PR02L.7)
#else
	#define	TMPR005		(pr02.BIT_NUMBER_16.bit0)
	#define	TMPR006		(pr02.BIT_NUMBER_16.bit1)
	#define	TMPR007		(pr02.BIT_NUMBER_16.bit2)
	#define	PPR011		(pr02.BIT_NUMBER_16.bit3)
	#define	LIN0WUPPR0	(pr02.BIT_NUMBER_16.bit3)
	#define	KRPR0		(pr02.BIT_NUMBER_16.bit4)
	#define	CAN0ERRPR0	(pr02.BIT_NUMBER_16.bit5)
	#define	CAN0WUPPR0	(pr02.BIT_NUMBER_16.bit6)
	#define	CAN0CFRPR	(pr02.BIT_NUMBER_16.bit7)
	#define	PR02L_0		(pr02.BIT_NUMBER_16.bit0)
	#define	PR02L_1		(pr02.BIT_NUMBER_16.bit1)
	#define	PR02L_2		(pr02.BIT_NUMBER_16.bit2)
	#define	PR02L_3		(pr02.BIT_NUMBER_16.bit3)
	#define	PR02L_4		(pr02.BIT_NUMBER_16.bit4)
	#define	PR02L_5		(pr02.BIT_NUMBER_16.bit5)
	#define	PR02L_6		(pr02.BIT_NUMBER_16.bit6)
	#define	PR02L_7		(pr02.BIT_NUMBER_16.bit7)
	#define	PR02L		(pr02.BYTE.pr02l)
#endif

/* PR02H */
#ifdef __RL78__
	#define	PR02H_0	(PR02H.0)
	#define	PR02H_1	(PR02H.1)
	#define	PR02H_2	(PR02H.2)
	#define	PR02H_3	(PR02H.3)
	#define	PR02H_4	(PR02H.4)
	#define	PR02H_5	(PR02H.5)
	#define	PR02H_6	(PR02H.6)
	#define	PR02H_7	(PR02H.7)
#else
	#define	CAN0TRMPR0	(pr02.BIT_NUMBER_16.bit8)
	#define	CANGRFRPR0	(pr02.BIT_NUMBER_16.bit9)
	#define	CANGERRPR0	(pr02.BIT_NUMBER_16.bit10)
	#define	TMPR010		(pr02.BIT_NUMBER_16.bit11)
	#define	TMPR011		(pr02.BIT_NUMBER_16.bit12)
	#define	TMPR012		(pr02.BIT_NUMBER_16.bit13)
	#define	TMPR013		(pr02.BIT_NUMBER_16.bit14)
	#define	FLPR0		(pr02.BIT_NUMBER_16.bit15)
	#define	PR02H_0		(pr02.BIT_NUMBER_16.bit8)
	#define	PR02H_1		(pr02.BIT_NUMBER_16.bit9)
	#define	PR02H_2		(pr02.BIT_NUMBER_16.bit10)
	#define	PR02H_3		(pr02.BIT_NUMBER_16.bit11)
	#define	PR02H_4		(pr02.BIT_NUMBER_16.bit12)
	#define	PR02H_5		(pr02.BIT_NUMBER_16.bit13)
	#define	PR02H_6		(pr02.BIT_NUMBER_16.bit14)
	#define	PR02H_7		(pr02.BIT_NUMBER_16.bit15)
	#define	PR02H		(pr02.BYTE.pr02h)
#endif

/* PR02 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr02l;
	SFR_UNSIGNED_CHAR	pr02h;
}SFR_BYTE_PR02;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR02	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR02;

