turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_PR02	pr02;

#ifdef __RL78__
#else
	#define	PR02	(pr02.ALL)
#endif

/* PR03L */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PR03L;

SFR_GLOBAL	SFR_PR03L	pr03l;

#ifdef __RL78__
	#define	PR03L_0	(PR03L.0)
	#define	PR03L_1	(PR03L.1)
	#define	PR03L_2	(PR03L.2)
	#define	PR03L_3	(PR03L.3)
	#define	PR03L_4	(PR03L.4)
	#define	PR03L_5	(PR03L.5)
	#define	PR03L_6	(PR03L.6)
	#define	PR03L_7	(PR03L.7)
#else
	#define	PPR012		(pr03l.BIT_NUMBER.bit0)
	#define	LIN1WUPPR0	(pr03l.BIT_NUMBER.bit0)
	#define	LIN1TRMPR0	(pr03l.BIT_NUMBER.bit1)
	#define	LIN1RVCPR0	(pr03l.BIT_NUMBER.bit2)
	#define	LIN1STAPR0	(pr03l.BIT_NUMBER.bit3)
	#define	LIN1PR0		(pr03l.BIT_NUMBER.bit3)
	#define	TMPR014		(pr03l.BIT_NUMBER.bit4)
	#define	TMPR015		(pr03l.BIT_NUMBER.bit5)
	#define	TMPR016		(pr03l.BIT_NUMBER.bit6)
	#define	TMPR017		(pr03l.BIT_NUMBER.bit7)
	#define	PR03L_0		(pr03l.BIT_NUMBER.bit0)
	#define	PR03L_1		(pr03l.BIT_NUMBER.bit1)
	#define	PR03L_2		(pr03l.BIT_NUMBER.bit2)
	#define	PR03L_3		(pr03l.BIT_NUMBER.bit3)
	#define	PR03L_4		(pr03l.BIT_NUMBER.bit4)
	#define	PR03L_5		(pr03l.BIT_NUMBER.bit5)
	#define	PR03L_6		(pr03l.BIT_NUMBER.bit6)
	#define	PR03L_7		(pr03l.BIT_NUMBER.bit7)
	#define	PR03L		(pr03l.ALL)
#endif

/* PR12L */
#ifdef __RL78__
	#define	PR12L_0	(PR12L.0)
	#define	PR12L_1	(PR12L.1)
	#define	PR12L_2	(PR12L.2)
	#define	PR12L_3	(PR12L.3)
	#define	PR12L_4	(PR12L.4)
	#define	PR12L_5	(PR12L.5)
	#define	PR12L_6	(PR12L.6)
	#define	PR12L_7	(PR12L.7)
#else
	#define	TMPR105		(pr12.BIT_NUMBER_16.bit0)
	#define	TMPR106		(pr12.BIT_NUMBER_16.bit1)
	#define	TMPR107		(pr12.BIT_NUMBER_16.bit2)
	#define	PPR111		(pr12.BIT_NUMBER_16.bit3)
	#define	LIN0WUPPR1	(pr12.BIT_NUMBER_16.bit3)
	#define	KRPR1		(pr12.BIT_NUMBER_16.bit4)
	#define	CAN0ERRPR1	(pr12.BIT_NUMBER_16.bit5)
	#define	CAN0WUPPR1	(pr12.BIT_NUMBER_16.bit6)
	#define	CAN0CFRPR1	(pr12.BIT_NUMBER_16.bit7)
	#define	PR12L_0		(pr12.BIT_NUMBER_16.bit0)
	#define	PR12L_1		(pr12.BIT_NUMBER_16.bit1)
	#define	PR12L_2		(pr12.BIT_NUMBER_16.bit2)
	#define	PR12L_3		(pr12.BIT_NUMBER_16.bit3)
	#define	PR12L_4		(pr12.BIT_NUMBER_16.bit4)
	#define	PR12L_5		(pr12.BIT_NUMBER_16.bit5)
	#define	PR12L_6		(pr12.BIT_NUMBER_16.bit6)
	#define	PR12L_7		(pr12.BIT_NUMBER_16.bit7)
	#define	PR12L		(pr12.BYTE.pr12l)
#endif

/* PR12H */
#ifdef __RL78__
	#define	PR12H_0	(PR12H.0)
	#define	PR12H_1	(PR12H.1)
	#define	PR12H_2	(PR12H.2)
	#define	PR12H_3	(PR12H.3)
	#define	PR12H_4	(PR12H.4)
	#define	PR12H_5	(PR12H.5)
	#define	PR12H_6	(PR12H.6)
	#define	PR12H_7	(PR12H.7)
#else
	#define	CAN0TRMPR1	(pr12.BIT_NUMBER_16.bit8)
	#define	CANGRFRPR1	(pr12.BIT_NUMBER_16.bit9)
	#define	CANGERRPR1	(pr12.BIT_NUMBER_16.bit10)
	#define	TMPR110		(pr12.BIT_NUMBER_16.bit11)
	#define	TMPR111		(pr12.BIT_NUMBER_16.bit12)
	#define	TMPR112		(pr12.BIT_NUMBER_16.bit13)
	#define	TMPR113		(pr12.BIT_NUMBER_16.bit14)
	#define	FLPR1		(pr12.BIT_NUMBER_16.bit15)
	#define	PR12H_0		(pr12.BIT_NUMBER_16.bit8)
	#define	PR12H_1		(pr12.BIT_NUMBER_16.bit9)
	#define	PR12H_2		(pr12.BIT_NUMBER_16.bit10)
	#define	PR12H_3		(pr12.BIT_NUMBER_16.bit11)
	#define	PR12H_4		(pr12.BIT_NUMBER_16.bit12)
	#define	PR12H_5		(pr12.BIT_NUMBER_16.bit13)
	#define	PR12H_6		(pr12.BIT_NUMBER_16.bit14)
	#define	PR12H_7		(pr12.BIT_NUMBER_16.bit15)
	#define	PR12H		(pr12.BYTE.pr12h)
#endif

/* PR12 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr12l;
	SFR_UNSIGNED_CHAR	pr12h;
}SFR_BYTE_PR12;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR12;

SFR_GLOBAL	SFR_PR12	pr12;

#ifdef __RL78__
#else
	#define	PR12	(pr12.ALL)
#endif

/* PR13L */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PR13L;

SFR_GLOBAL	SFR_PR13L	pr13l;

#ifdef __RL78__
	#define	PR13L_0	(PR13L.0)
	#define	PR13L_1	(PR13L.1)
	#define	PR13L_2	(PR13L.2)
	#define	PR13L_3	(PR13L.3)
	#define	PR13L_4	(PR13L.4)
	#define	PR13L_5	(PR13L.5)
	#define	PR13L_6	(PR13L.6)
	#define	PR13L_7	(PR13L.7)
#else
	#define	PPR112		(pr13l.BIT_NUMBER.bit0)
	#define	LIN1WUPPR1	(pr13l.BIT_NUMBER.bit0)
	#define	LIN1TRMPR1	(pr13l.BIT_NUMBER.bit1)
	#define	LIN1RVCPR1	(pr13l.BIT_NUMBER.bit2)
	#define	LIN1STAPR1	(pr13l.BIT_NUMBER.bit3)
	#define	LIN1PR1		(pr13l.BIT_NUMBER.bit3)
	#define	TMPR114		(pr13l.BIT_NUMBER.bit4)
	#define	TMPR115		(pr13l.BIT_NUMBER.bit5)
	#define	TMPR116		(pr13l.BIT_NUMBER.bit6)
	#define	TMPR117		(pr13l.BIT_NUMBER.bit7)
	#define	PR13L_0		(pr13l.BIT_NUMBER.bit0)
	#define	PR13L_1		(pr13l.BIT_NUMBER.bit1)
	#define	PR13L_2		(pr13l.BIT_NUMBER.bit2)
	#define	PR13L_3		(pr13l.BIT_NUMBER.bit3)
	#define	PR13L_4		(pr13l.BIT_NUMBER.bit4)
	#define	PR13L_5		(pr13l.BIT_NUMBER.bit5)
	#define	PR13L_6		(pr13l.BIT_NUMBER.bit6)
	#define	PR13L_7		(pr13l.BIT_NUMBER.bit7)
	#define	PR13L		(pr13l.ALL)
#endif

/* IF0L */
#ifdef __RL78__
	#define	IF0L_0	(IF0L.0)
	#define	IF0L_1	(IF0L.1)
	#define	IF0L_2	(IF0L.2)
	#define	IF0L_3	(IF0L.3)
	#define	IF0L_4	(IF0L.4)
	#define	IF0L_5	(IF0L.5)
	#define	IF0L_6	(IF0L.6)
	#define	IF0L_7	(IF0L.7)
#else
	#define	WDTIIF	(if0.BIT_NUMBER_16.bit0)
	#define	LVIIF	(if0.BIT_NUMBER_16.bit1)
	#define	PIF0	(if0.BIT_NUMBER_16.bit2)
	#define	PIF1	(if0.BIT_NUMBER_16.bit3)
	#define	PIF2	(if0.BIT_NUMBER_16.bit4)
	#define	PIF3	(if0.BIT_NUMBER_16.bit5)
	#define	PIF4	(if0.BIT_NUMBER_16.bit6)
	#define	SPMIF	(if0.BIT_NUMBER_16.bit6)
	#define	PIF5	(if0.BIT_NUMBER_16.bit7)
	#define	CMPIF0	(if0.BIT_NUMBER_16.bit7)
	#define	IF0L_0	(if0.BIT_NUMBER_16.bit0)
	#define	IF0L_1	(if0.BIT_NUMBER_16.bit1)
	#define	IF0L_2	(if0.BIT_NUMBER_16.bit2)
	#define	IF0L_3	(if0.BIT_NUMBER_16.bit3)
	#define	IF0L_4	(if0.BIT_NUMBER_16.bit4)
	#define	IF0L_5	(if0.BIT_NUMBER_16.bit5)
	#define	IF0L_6	(if0.BIT_NUMBER_16.bit6)
	#define	IF0L_7	(if0.BIT_NUMBER_16.bit7)
	#define	IF0L	(if0.BYTE.if0l)
#endif

/* IF0H */
#ifdef __RL78__
	#define	IF0H_0	(IF0H.0)
	#define	IF0H_1	(IF0H.1)
	#define	IF0H_2	(IF0H.2)
	#define	IF0H_3	(IF0H.3)
	#define	IF0H_4	(IF0H.4)
	#define	IF0H_5	(IF0H.5)
	#define	IF0H_6	(IF0H.6)
	#define	IF0H_7	(IF0H.7)
#else
	#define	CLMIF		(if0.BIT_NUMBER_16.bit8)
	#define	PIF13		(if0.BIT_NUMBER_16.bit8)
	#define	STIF0		(if0.BIT_NUMBER_16.bit9)
	#define	CSIIF00		(if0.BIT_NUMBER_16.bit9)
	#define	IICIF00		(if0.BIT_NUMBER_16.bit9)
	#define	SRIF0		(if0.BIT_NUMBER_16.bit10)
	#define	CSIIF01		(if0.BIT_NUMBER_16.bit10)
	#define	IICIF01		(if0.BIT_NUMBER_16.bit10)
	#define	TRDIF0		(if0.BIT_NUMBER_16.bit11)
	#define	TRDIF1		(if0.BIT_NUMBER_16.bit12)
	#define	TRJIF0		(if0.BIT_NUMBER_16.bit13)
	#define	RAMIF		(if0.BIT_NUMBER_16.bit14)
	#define	LIN0TRMIF	(if0.BIT_NUMBER_16.bit15)
	#define	IF0H_0		(if0.BIT_NUMBER_16.bit8)
	#define	IF0H_1		(if0.BIT_NUMBER_16.bit9)
	#define	IF0H_2		(if0.BIT_NUMBER_16.bit10)
	#define	IF0H_3		(if0.BIT_NUMBER_16.bit11)
	#define	IF0H_4		(if0.BIT_NUMBER_16.bit12)
	#define	IF0H_5		(if0.BIT_NUMBER_16.bit13)
	#define	IF0H_6		(if0.BIT_NUMBER_16.bit14)
	#define	IF0H_7		(if0.BIT_NUMBER_16.bit15)
	#define	IF0H		(if0.BYTE.if0h)
#endif

/* IF0 */
typedef struct{
	SFR_UNSIGNED_CHAR	if0l;
	SFR_UNSIGNED_CHAR	if0h;
}SFR_BYTE_IF0;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_IF0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_IF0;

SFR_GLOBAL	SFR_IF0	if0;

#ifdef __RL78__
#else
	#define	IF0	(if0.ALL)
#endif

/* IF1L */
#ifdef __RL78__
	#define	IF1L_0	(IF1L.0)
	#define	IF1L_1	(IF1L.1)
	#define	IF1L_2	(IF1L.2)
	#define	IF1L_3	(IF1L.3)
	#define	IF1L_4	(IF1L.4)
	#define	IF1L_5	(IF1L.5)
	#define	IF1L_6	(IF1L.6)
	#define	IF1L_7	(IF1L.7)
#else
	#define	LIN0RVCIF	(if1.BIT_NUMBER_16.bit0)
	#define	LIN0STAIF	(if1.BIT_NUMBER_16.bit1)
	#define	LIN0IF		(if1.BIT_NUMBER_16.bit1)
	#define	IICAIF0		(if1.BIT_NUMBER_16.bit2)
	#define	PIF8		(if1.BIT_NUMBER_16.bit3)
	#define	RTCIF		(if1.BIT_NUMBER_16.bit3)
	#define	TMIF00		(if1.BIT_NUMBER_16.bit4)
	#define	TMIF01		(if1.BIT_NUMBER_16.bit5)
	#define	TMIF02		(if1.BIT_NUMBER_16.bit6)
	#define	TMIF03		(if1.BIT_NUMBER_16.bit7)
	#define	IF1L_0		(if1.BIT_NUMBER_16.bit0)
	#define	IF1L_1		(if1.BIT_NUMBER_16.bit1)
	#define	IF1L_2		(if1.BIT_NUMBER_16.bit2)
	#define	IF1L_3		(if1.BIT_NUMBER_16.bit3)
	#define	IF1L_4		(if1.BIT_NUMBER_16.bit4)
	#define	IF1L_5		(if1.BIT_NUMBER_16.bit5)
	#define	IF1L_6		(if1.BIT_NUMBER_16.bit6)
	#define	IF1L_7		(if1.BIT_NUMBER_16.bit7)
	#define	IF1L		(if1.BYTE.if1l)
#endif

/* IF1H */
#ifdef __RL78__
	#define	IF1H_0	(IF1H.0)
	#define	IF1H_1	(IF1H.1)
	#define	IF1H_2	(IF1H.2)
	#define	IF1H_3	(IF1H.3)
	#define	IF1H_4	(IF1H.4)
	#define	IF1H_5	(IF1H.5)
	#define	IF1H_6	(IF1H.6)
	#define	IF1H_7	(IF1H.7)
#else
	#define	ADIF		(if1.BIT_NUMBER_16.bit8)
	#define	PIF6		(if1.BIT_NUMBER_16.bit9)
	#define	TMIF11H		(if1.BIT_NUMBER_16.bit9)
	#define	PIF7		(if1.BIT_NUMBER_16.bit10)
	#define	TMIF13H		(if1.BIT_NUMBER_16.bit10)
	#define	PIF9		(if1.BIT_NUMBER_16.bit11)
	#define	TMIF01H		(if1.BIT_NUMBER_16.bit11)
	#define	PIF10		(if1.BIT_NUMBER_16.bit12)
	#define	TMIF03H		(if1.BIT_NUMBER_16.bit12)
	#define	STIF1		(if1.BIT_NUMBER_16.bit13)
	#define	CSIIF10		(if1.BIT_NUMBER_16.bit13)
	#define	IICIF10		(if1.BIT_NUMBER_16.bit13)
	#define	SRIF1		(if1.BIT_NUMBER_16.bit14)
	#define	CSIIF11		(if1.BIT_NUMBER_16.bit14)
	#define	IICIF11		(if1.BIT_NUMBER_16.bit14)
	#define	TMIF04		(if1.BIT_NUMBER_16.bit15)
	#define	IF1H_0		(if1.BIT_NUMBER_16.bit8)
	#define	IF1H_1		(if1.BIT_NUMBER_16.bit9)
	#define	IF1H_2		(if1.BIT_NUMBER_16.bit10)
	#define	IF1H_3		(if1.BIT_NUMBER_16.bit11)
	#define	IF1H_4		(if1.BIT_NUMBER_16.bit12)
	#define	IF1H_5		(if1.BIT_NUMBER_16.bit13)
	#define	IF1H_6		(if1.BIT_NUMBER_16.bit14)
	#define	IF1H_7		(if1.BIT_NUMBER_16.bit15)
	#define	IF1H		(if1.BYTE.if1h)
#endif

/* IF1 */
typedef struct{
	SFR_UNSIGNED_CHAR	if1l;
	SFR_UNSIGNED_CHAR	if1h;
}SFR_BYTE_IF1;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_IF1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_IF1;

SFR_GLOBAL	SFR_IF1	if1;

#ifdef __RL78__
#else
	#define	IF1	(if1.ALL)
#endif

