turatsamar/DRV8889/src/rl78_ca78k0r.h
/* MK0L */
#ifdef __RL78__
	#define	MK0L_0	(MK0L.0)
	#define	MK0L_1	(MK0L.1)
	#define	MK0L_2	(MK0L.2)
	#define	MK0L_3	(MK0L.3)
	#define	MK0L_4	(MK0L.4)
	#define	MK0L_5	(MK0L.5)
	#define	MK0L_6	(MK0L.6)
	#define	MK0L_7	(MK0L.7)
#else
	#define	WDTIMK	(mk0.BIT_NUMBER_16.bit0)
	#define	LVIMK	(mk0.BIT_NUMBER_16.bit1)
	#define	PMK0	(mk0.BIT_NUMBER_16.bit2)
	#define	PMK1	(mk0.BIT_NUMBER_16.bit3)
	#define	PMK2	(mk0.BIT_NUMBER_16.bit4)
	#define	PMK3	(mk0.BIT_NUMBER_16.bit5)
	#define	PMK4	(mk0.BIT_NUMBER_16.bit6)
	#define	SPMMK	(mk0.BIT_NUMBER_16.bit6)
	#define	PMK5	(mk0.BIT_NUMBER_16.bit7)
	#define	CMPMK0	(mk0.BIT_NUMBER_16.bit7)
	#define	MK0L_0	(mk0.BIT_NUMBER_16.bit0)
	#define	MK0L_1	(mk0.BIT_NUMBER_16.bit1)
	#define	MK0L_2	(mk0.BIT_NUMBER_16.bit2)
	#define	MK0L_3	(mk0.BIT_NUMBER_16.bit3)
	#define	MK0L_4	(mk0.BIT_NUMBER_16.bit4)
	#define	MK0L_5	(mk0.BIT_NUMBER_16.bit5)
	#define	MK0L_6	(mk0.BIT_NUMBER_16.bit6)
	#define	MK0L_7	(mk0.BIT_NUMBER_16.bit7)
	#define	MK0L	(mk0.BYTE.mk0l)
#endif

/* MK0H */
#ifdef __RL78__
	#define	MK0H_0	(MK0H.0)
	#define	MK0H_1	(MK0H.1)
	#define	MK0H_2	(MK0H.2)
	#define	MK0H_3	(MK0H.3)
	#define	MK0H_4	(MK0H.4)
	#define	MK0H_5	(MK0H.5)
	#define	MK0H_6	(MK0H.6)
	#define	MK0H_7	(MK0H.7)
#else
	#define	CLMMK		(mk0.BIT_NUMBER_16.bit8)
	#define	PMK13		(mk0.BIT_NUMBER_16.bit8)
	#define	STMK0		(mk0.BIT_NUMBER_16.bit9)
	#define	CSIMK00		(mk0.BIT_NUMBER_16.bit9)
	#define	IICMK00		(mk0.BIT_NUMBER_16.bit9)
	#define	SRMK0		(mk0.BIT_NUMBER_16.bit10)
	#define	CSIMK01		(mk0.BIT_NUMBER_16.bit10)
	#define	IICMK01		(mk0.BIT_NUMBER_16.bit10)
	#define	TRDMK0		(mk0.BIT_NUMBER_16.bit11)
	#define	TRDMK1		(mk0.BIT_NUMBER_16.bit12)
	#define	TRJMK0		(mk0.BIT_NUMBER_16.bit13)
	#define	RAMMK		(mk0.BIT_NUMBER_16.bit14)
	#define	LIN0TRMMK	(mk0.BIT_NUMBER_16.bit15)
	#define	MK0H_0		(mk0.BIT_NUMBER_16.bit8)
	#define	MK0H_1		(mk0.BIT_NUMBER_16.bit9)
	#define	MK0H_2		(mk0.BIT_NUMBER_16.bit10)
	#define	MK0H_3		(mk0.BIT_NUMBER_16.bit11)
	#define	MK0H_4		(mk0.BIT_NUMBER_16.bit12)
	#define	MK0H_5		(mk0.BIT_NUMBER_16.bit13)
	#define	MK0H_6		(mk0.BIT_NUMBER_16.bit14)
	#define	MK0H_7		(mk0.BIT_NUMBER_16.bit15)
	#define	MK0H		(mk0.BYTE.mk0h)
#endif

/* MK0 */
typedef struct{
	SFR_UNSIGNED_CHAR	mk0l;
	SFR_UNSIGNED_CHAR	mk0h;
}SFR_BYTE_MK0;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_MK0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_MK0;

SFR_GLOBAL	SFR_MK0	mk0;

#ifdef __RL78__
#else
	#define	MK0	(mk0.ALL)
#endif

/* MK1L */
#ifdef __RL78__
	#define	MK1L_0	(MK1L.0)
	#define	MK1L_1	(MK1L.1)
	#define	MK1L_2	(MK1L.2)
	#define	MK1L_3	(MK1L.3)
	#define	MK1L_4	(MK1L.4)
	#define	MK1L_5	(MK1L.5)
	#define	MK1L_6	(MK1L.6)
	#define	MK1L_7	(MK1L.7)
#else
	#define	LIN0RVCMK	(mk1.BIT_NUMBER_16.bit0)
	#define	LIN0STAMK	(mk1.BIT_NUMBER_16.bit1)
	#define	LIN0MK		(mk1.BIT_NUMBER_16.bit1)
	#define	IICAMK0		(mk1.BIT_NUMBER_16.bit2)
	#define	PMK8		(mk1.BIT_NUMBER_16.bit3)
	#define	RTCMK		(mk1.BIT_NUMBER_16.bit3)
	#define	TMMK00		(mk1.BIT_NUMBER_16.bit4)
	#define	TMMK01		(mk1.BIT_NUMBER_16.bit5)
	#define	TMMK02		(mk1.BIT_NUMBER_16.bit6)
	#define	TMMK03		(mk1.BIT_NUMBER_16.bit7)
	#define	MK1L_0		(mk1.BIT_NUMBER_16.bit0)
	#define	MK1L_1		(mk1.BIT_NUMBER_16.bit1)
	#define	MK1L_2		(mk1.BIT_NUMBER_16.bit2)
	#define	MK1L_3		(mk1.BIT_NUMBER_16.bit3)
	#define	MK1L_4		(mk1.BIT_NUMBER_16.bit4)
	#define	MK1L_5		(mk1.BIT_NUMBER_16.bit5)
	#define	MK1L_6		(mk1.BIT_NUMBER_16.bit6)
	#define	MK1L_7		(mk1.BIT_NUMBER_16.bit7)
	#define	MK1L		(mk1.BYTE.mk1l)
#endif

/* MK1H */
#ifdef __RL78__
	#define	MK1H_0	(MK1H.0)
	#define	MK1H_1	(MK1H.1)
	#define	MK1H_2	(MK1H.2)
	#define	MK1H_3	(MK1H.3)
	#define	MK1H_4	(MK1H.4)
	#define	MK1H_5	(MK1H.5)
	#define	MK1H_6	(MK1H.6)
	#define	MK1H_7	(MK1H.7)
#else
	#define	ADMK		(mk1.BIT_NUMBER_16.bit8)
	#define	PMK6		(mk1.BIT_NUMBER_16.bit9)
	#define	TMMK11H		(mk1.BIT_NUMBER_16.bit9)
	#define	PMK7		(mk1.BIT_NUMBER_16.bit10)
	#define	TMMK13H		(mk1.BIT_NUMBER_16.bit10)
	#define	PMK9		(mk1.BIT_NUMBER_16.bit11)
	#define	TMMK01H		(mk1.BIT_NUMBER_16.bit11)
	#define	PMK10		(mk1.BIT_NUMBER_16.bit12)
	#define	TMMK03H		(mk1.BIT_NUMBER_16.bit12)
	#define	STMK1		(mk1.BIT_NUMBER_16.bit13)
	#define	CSIMK10		(mk1.BIT_NUMBER_16.bit13)
	#define	IICMK10		(mk1.BIT_NUMBER_16.bit13)
	#define	SRMK1		(mk1.BIT_NUMBER_16.bit14)
	#define	CSIMK11		(mk1.BIT_NUMBER_16.bit14)
	#define	IICMK11		(mk1.BIT_NUMBER_16.bit14)
	#define	TMMK04		(mk1.BIT_NUMBER_16.bit15)
	#define	MK1H_0		(mk1.BIT_NUMBER_16.bit8)
	#define	MK1H_1		(mk1.BIT_NUMBER_16.bit9)
	#define	MK1H_2		(mk1.BIT_NUMBER_16.bit10)
	#define	MK1H_3		(mk1.BIT_NUMBER_16.bit11)
	#define	MK1H_4		(mk1.BIT_NUMBER_16.bit12)
	#define	MK1H_5		(mk1.BIT_NUMBER_16.bit13)
	#define	MK1H_6		(mk1.BIT_NUMBER_16.bit14)
	#define	MK1H_7		(mk1.BIT_NUMBER_16.bit15)
	#define	MK1H		(mk1.BYTE.mk1h)
#endif

/* MK1 */
typedef struct{
	SFR_UNSIGNED_CHAR	mk1l;
	SFR_UNSIGNED_CHAR	mk1h;
}SFR_BYTE_MK1;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_MK1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_MK1;

SFR_GLOBAL	SFR_MK1	mk1;

#ifdef __RL78__
#else
	#define	MK1	(mk1.ALL)
#endif

/* PR00L */
#ifdef __RL78__
	#define	PR00L_0	(PR00L.0)
	#define	PR00L_1	(PR00L.1)
	#define	PR00L_2	(PR00L.2)
	#define	PR00L_3	(PR00L.3)
	#define	PR00L_4	(PR00L.4)
	#define	PR00L_5	(PR00L.5)
	#define	PR00L_6	(PR00L.6)
	#define	PR00L_7	(PR00L.7)
#else
	#define	WDTIPR0			(pr00.BIT_NUMBER_16.bit0)
	#define	LVIPR0			(pr00.BIT_NUMBER_16.bit1)
	#define	PPR00			(pr00.BIT_NUMBER_16.bit2)
	#define	PPR01			(pr00.BIT_NUMBER_16.bit3)
	#define	PPR02			(pr00.BIT_NUMBER_16.bit4)
	#define	PPR03			(pr00.BIT_NUMBER_16.bit5)
	#define	PPR04			(pr00.BIT_NUMBER_16.bit6)
	#define	SPMPR0			(pr00.BIT_NUMBER_16.bit6)
	#define	PPR05			(pr00.BIT_NUMBER_16.bit7)
	#define	CMPPR00			(pr00.BIT_NUMBER_16.bit7)
	#define	PR00L_0			(pr00.BIT_NUMBER_16.bit0)
	#define	PR00L_1			(pr00.BIT_NUMBER_16.bit1)
	#define	PR00L_2			(pr00.BIT_NUMBER_16.bit2)
	#define	PR00L_3			(pr00.BIT_NUMBER_16.bit3)
	#define	PR00L_4			(pr00.BIT_NUMBER_16.bit4)
	#define	PR00L_5			(pr00.BIT_NUMBER_16.bit5)
	#define	PR00L_6			(pr00.BIT_NUMBER_16.bit6)
	#define	PR00L_7			(pr00.BIT_NUMBER_16.bit7)
	#define	PR00L			(pr00.BYTE.pr00l)
#endif

/* PR00H */
#ifdef __RL78__
	#define	PR00H_0	(PR00H.0)
	#define	PR00H_1	(PR00H.1)
	#define	PR00H_2	(PR00H.2)
	#define	PR00H_3	(PR00H.3)
	#define	PR00H_4	(PR00H.4)
	#define	PR00H_5	(PR00H.5)
	#define	PR00H_6	(PR00H.6)
	#define	PR00H_7	(PR00H.7)
#else
	#define	CLMPR0		(pr00.BIT_NUMBER_16.bit8)
	#define	PPR013		(pr00.BIT_NUMBER_16.bit8)
	#define	STPR00		(pr00.BIT_NUMBER_16.bit9)
	#define	CSIPR000	(pr00.BIT_NUMBER_16.bit9)
	#define	IICPR000	(pr00.BIT_NUMBER_16.bit9)
	#define	SRPR00		(pr00.BIT_NUMBER_16.bit210)
	#define	CSIPR001	(pr00.BIT_NUMBER_16.bit10)
	#define	IICPR001	(pr00.BIT_NUMBER_16.bit10)
	#define	TRDPR00		(pr00.BIT_NUMBER_16.bit11)
	#define	TRDPR01		(pr00.BIT_NUMBER_16.bit12)
	#define	TRJPR00		(pr00.BIT_NUMBER_16.bit13)
	#define	RAMPR0		(pr00.BIT_NUMBER_16.bit14)
	#define	LIN0TRMPR0	(pr00.BIT_NUMBER_16.bit15)
	#define	PR00H_0		(pr00.BIT_NUMBER_16.bit8)
	#define	PR00H_1		(pr00.BIT_NUMBER_16.bit9)
	#define	PR00H_2		(pr00.BIT_NUMBER_16.bit10)
	#define	PR00H_3		(pr00.BIT_NUMBER_16.bit11)
	#define	PR00H_4		(pr00.BIT_NUMBER_16.bit12)
	#define	PR00H_5		(pr00.BIT_NUMBER_16.bit13)
	#define	PR00H_6		(pr00.BIT_NUMBER_16.bit14)
	#define	PR00H_7		(pr00.BIT_NUMBER_16.bit15)
	#define	PR00H		(pr00.BYTE.pr00h)
#endif

/* PR00 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr00l;
	SFR_UNSIGNED_CHAR	pr00h;
}SFR_BYTE_PR00;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR00;

SFR_GLOBAL	SFR_PR00	pr00;

#ifdef __RL78__
#else
	#define	PR00	(pr00.ALL)
#endif

