turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PR01L */
#ifdef __RL78__
	#define	PR01L_0	(PR01L.0)
	#define	PR01L_1	(PR01L.1)
	#define	PR01L_2	(PR01L.2)
	#define	PR01L_3	(PR01L.3)
	#define	PR01L_4	(PR01L.4)
	#define	PR01L_5	(PR01L.5)
	#define	PR01L_6	(PR01L.6)
	#define	PR01L_7	(PR01L.7)
#else
	#define	LIN0RVCPR0	(pr01.BIT_NUMBER_16.bit0)
	#define	LIN0STAPR0	(pr01.BIT_NUMBER_16.bit1)
	#define	LIN0PR0		(pr01.BIT_NUMBER_16.bit1)
	#define	IICAPR00	(pr01.BIT_NUMBER_16.bit2)
	#define	PPR08		(pr01.BIT_NUMBER_16.bit3)
	#define	RTCPR0		(pr01.BIT_NUMBER_16.bit3)
	#define	TMPR000		(pr01.BIT_NUMBER_16.bit4)
	#define	TMPR001		(pr01.BIT_NUMBER_16.bit5)
	#define	TMPR002		(pr01.BIT_NUMBER_16.bit6)
	#define	TMPR003		(pr01.BIT_NUMBER_16.bit7)
	#define	PR01L_0		(pr01.BIT_NUMBER_16.bit0)
	#define	PR01L_1		(pr01.BIT_NUMBER_16.bit1)
	#define	PR01L_2		(pr01.BIT_NUMBER_16.bit2)
	#define	PR01L_3		(pr01.BIT_NUMBER_16.bit3)
	#define	PR01L_4		(pr01.BIT_NUMBER_16.bit4)
	#define	PR01L_5		(pr01.BIT_NUMBER_16.bit5)
	#define	PR01L_6		(pr01.BIT_NUMBER_16.bit6)
	#define	PR01L_7		(pr01.BIT_NUMBER_16.bit7)
	#define	PR01L		(pr01.BYTE.pr01l)
#endif

/* PR01H */
#ifdef __RL78__
	#define	PR01H_0	(PR01H.0)
	#define	PR01H_1	(PR01H.1)
	#define	PR01H_2	(PR01H.2)
	#define	PR01H_3	(PR01H.3)
	#define	PR01H_4	(PR01H.4)
	#define	PR01H_5	(PR01H.5)
	#define	PR01H_6	(PR01H.6)
	#define	PR01H_7	(PR01H.7)
#else
	#define	ADPR0		(pr01.BIT_NUMBER_16.bit8)
	#define	PPR06		(pr01.BIT_NUMBER_16.bit9)
	#define	TMPR011H	(pr01.BIT_NUMBER_16.bit9)
	#define	PPR07		(pr01.BIT_NUMBER_16.bit10)
	#define	TMPR013H	(pr01.BIT_NUMBER_16.bit10)
	#define	PPR09		(pr01.BIT_NUMBER_16.bit11)
	#define	TMPR001H	(pr01.BIT_NUMBER_16.bit11)
	#define	PPR010		(pr01.BIT_NUMBER_16.bit12)
	#define	TMPR003H	(pr01.BIT_NUMBER_16.bit12)
	#define	STPR01		(pr01.BIT_NUMBER_16.bit13)
	#define	CSIPR010	(pr01.BIT_NUMBER_16.bit13)
	#define	IICPR010	(pr01.BIT_NUMBER_16.bit13)
	#define	SRPR01		(pr01.BIT_NUMBER_16.bit14)
	#define	CSIPR011	(pr01.BIT_NUMBER_16.bit14)
	#define	IICPR011	(pr01.BIT_NUMBER_16.bit14)
	#define	TMPR004		(pr01.BIT_NUMBER_16.bit15)
	#define	PR01H_0		(pr01.BIT_NUMBER_16.bit8)
	#define	PR01H_1		(pr01.BIT_NUMBER_16.bit9)
	#define	PR01H_2		(pr01.BIT_NUMBER_16.bit10)
	#define	PR01H_3		(pr01.BIT_NUMBER_16.bit11)
	#define	PR01H_4		(pr01.BIT_NUMBER_16.bit12)
	#define	PR01H_5		(pr01.BIT_NUMBER_16.bit13)
	#define	PR01H_6		(pr01.BIT_NUMBER_16.bit14)
	#define	PR01H_7		(pr01.BIT_NUMBER_16.bit15)
	#define	PR01H		(pr01.BYTE.pr01h)
#endif

/* PR01 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr01l;
	SFR_UNSIGNED_CHAR	pr01h;
}SFR_BYTE_PR01;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR01;

SFR_GLOBAL	SFR_PR01	pr01;

#ifdef __RL78__
#else
	#define	PR01	(pr01.ALL)
#endif

/* PR10L */
#ifdef __RL78__
	#define	PR10L_0	(PR10L.0)
	#define	PR10L_1	(PR10L.1)
	#define	PR10L_2	(PR10L.2)
	#define	PR10L_3	(PR10L.3)
	#define	PR10L_4	(PR10L.4)
	#define	PR10L_5	(PR10L.5)
	#define	PR10L_6	(PR10L.6)
	#define	PR10L_7	(PR10L.7)
#else
	#define	WDTIPR1		(pr10.BIT_NUMBER_16.bit0)
	#define	LVIPR1		(pr10.BIT_NUMBER_16.bit1)
	#define	PPR10		(pr10.BIT_NUMBER_16.bit2)
	#define	PPR11		(pr10.BIT_NUMBER_16.bit3)
	#define	PPR12		(pr10.BIT_NUMBER_16.bit4)
	#define	PPR13		(pr10.BIT_NUMBER_16.bit5)
	#define	PPR14		(pr10.BIT_NUMBER_16.bit6)
	#define	SPMPR1		(pr10.BIT_NUMBER_16.bit6)
	#define	PPR15		(pr10.BIT_NUMBER_16.bit7)
	#define	CMPPR10		(pr10.BIT_NUMBER_16.bit7)
	#define	PR10L_0		(pr10.BIT_NUMBER_16.bit0)
	#define	PR10L_1		(pr10.BIT_NUMBER_16.bit1)
	#define	PR10L_2		(pr10.BIT_NUMBER_16.bit2)
	#define	PR10L_3		(pr10.BIT_NUMBER_16.bit3)
	#define	PR10L_4		(pr10.BIT_NUMBER_16.bit4)
	#define	PR10L_5		(pr10.BIT_NUMBER_16.bit5)
	#define	PR10L_6		(pr10.BIT_NUMBER_16.bit6)
	#define	PR10L_7		(pr10.BIT_NUMBER_16.bit7)
	#define	PR10L		(pr10.BYTE.pr10l)
#endif

/* PR10H */
#ifdef __RL78__
	#define	PR10H_0	(PR10H.0)
	#define	PR10H_1	(PR10H.1)
	#define	PR10H_2	(PR10H.2)
	#define	PR10H_3	(PR10H.3)
	#define	PR10H_4	(PR10H.4)
	#define	PR10H_5	(PR10H.5)
	#define	PR10H_6	(PR10H.6)
	#define	PR10H_7	(PR10H.7)
#else
	#define	CLMPR1		(pr10.BIT_NUMBER_16.bit8)
	#define	PPR113		(pr10.BIT_NUMBER_16.bit8)
	#define	STPR10		(pr10.BIT_NUMBER_16.bit9)
	#define	CSIPR100	(pr10.BIT_NUMBER_16.bit9)
	#define	IICPR100	(pr10.BIT_NUMBER_16.bit9)
	#define	SRPR10		(pr10.BIT_NUMBER_16.bit10)
	#define	CSIPR101	(pr10.BIT_NUMBER_16.bit10)
	#define	IICPR101	(pr10.BIT_NUMBER_16.bit10)
	#define	TRDPR10		(pr10.BIT_NUMBER_16.bit11)
	#define	TRDPR11		(pr10.BIT_NUMBER_16.bit12)
	#define	TRJPR10		(pr10.BIT_NUMBER_16.bit13)
	#define	RAMPR1		(pr10.BIT_NUMBER_16.bit14)
	#define	LIN0TRMPR1	(pr10.BIT_NUMBER_16.bit15)
	#define	PR10H_0		(pr10.BIT_NUMBER_16.bit8)
	#define	PR10H_1		(pr10.BIT_NUMBER_16.bit9)
	#define	PR10H_2		(pr10.BIT_NUMBER_16.bit10)
	#define	PR10H_3		(pr10.BIT_NUMBER_16.bit11)
	#define	PR10H_4		(pr10.BIT_NUMBER_16.bit12)
	#define	PR10H_5		(pr10.BIT_NUMBER_16.bit13)
	#define	PR10H_6		(pr10.BIT_NUMBER_16.bit14)
	#define	PR10H_7		(pr10.BIT_NUMBER_16.bit15)
	#define	PR10H		(pr10.BYTE.pr10h)
#endif

/* PR10 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr10l;
	SFR_UNSIGNED_CHAR	pr10h;
}SFR_BYTE_PR10;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR10;

SFR_GLOBAL	SFR_PR10	pr10;

#ifdef __RL78__
#else
	#define	PR10	(pr10.ALL)
#endif

/* PR11L */
#ifdef __RL78__
	#define	PR11L_0	(PR11L.0)
	#define	PR11L_1	(PR11L.1)
	#define	PR11L_2	(PR11L.2)
	#define	PR11L_3	(PR11L.3)
	#define	PR11L_4	(PR11L.4)
	#define	PR11L_5	(PR11L.5)
	#define	PR11L_6	(PR11L.6)
	#define	PR11L_7	(PR11L.7)
#else
	#define	LIN0RVCPR1	(pr11.BIT_NUMBER_16.bit0)
	#define	LIN0STAPR1	(pr11.BIT_NUMBER_16.bit1)
	#define	LIN0PR1		(pr11.BIT_NUMBER_16.bit1)
	#define	IICAPR10	(pr11.BIT_NUMBER_16.bit2)
	#define	PPR18		(pr11.BIT_NUMBER_16.bit3)
	#define	RTCPR1		(pr11.BIT_NUMBER_16.bit3)
	#define	TMPR100		(pr11.BIT_NUMBER_16.bit4)
	#define	TMPR101		(pr11.BIT_NUMBER_16.bit5)
	#define	TMPR102		(pr11.BIT_NUMBER_16.bit6)
	#define	TMPR103		(pr11.BIT_NUMBER_16.bit7)
	#define	PR11L_0		(pr11.BIT_NUMBER_16.bit0)
	#define	PR11L_1		(pr11.BIT_NUMBER_16.bit1)
	#define	PR11L_2		(pr11.BIT_NUMBER_16.bit2)
	#define	PR11L_3		(pr11.BIT_NUMBER_16.bit3)
	#define	PR11L_4		(pr11.BIT_NUMBER_16.bit4)
	#define	PR11L_5		(pr11.BIT_NUMBER_16.bit5)
	#define	PR11L_6		(pr11.BIT_NUMBER_16.bit6)
	#define	PR11L_7		(pr11.BIT_NUMBER_16.bit7)
	#define	PR11L		(pr11.BYTE.pr11l)
#endif

/* PR11H */
#ifdef __RL78__
	#define	PR11H_0	(PR11H.0)
	#define	PR11H_1	(PR11H.1)
	#define	PR11H_2	(PR11H.2)
	#define	PR11H_3	(PR11H.3)
	#define	PR11H_4	(PR11H.4)
	#define	PR11H_5	(PR11H.5)
	#define	PR11H_6	(PR11H.6)
	#define	PR11H_7	(PR11H.7)
#else
	#define	ADPR1		(pr11.BIT_NUMBER_16.bit8)
	#define	PPR16		(pr11.BIT_NUMBER_16.bit9)
	#define	TMPR111H	(pr11.BIT_NUMBER_16.bit9)
	#define	PPR17		(pr11.BIT_NUMBER_16.bit10)
	#define	TMPR113H	(pr11.BIT_NUMBER_16.bit10)
	#define	PPR19		(pr11.BIT_NUMBER_16.bit11)
	#define	TMPR101H	(pr11.BIT_NUMBER_16.bit11)
	#define	PPR110		(pr11.BIT_NUMBER_16.bit12)
	#define	TMPR103H	(pr11.BIT_NUMBER_16.bit12)
	#define	STPR11		(pr11.BIT_NUMBER_16.bit13)
	#define	CSIPR110	(pr11.BIT_NUMBER_16.bit13)
	#define	IICPR110	(pr11.BIT_NUMBER_16.bit13)
	#define	SRPR11		(pr11.BIT_NUMBER_16.bit14)
	#define	CSIPR111	(pr11.BIT_NUMBER_16.bit14)
	#define	IICPR111	(pr11.BIT_NUMBER_16.bit14)
	#define	TMPR104		(pr11.BIT_NUMBER_16.bit15)
	#define	PR11H_0		(pr11.BIT_NUMBER_16.bit8)
	#define	PR11H_1		(pr11.BIT_NUMBER_16.bit9)
	#define	PR11H_2		(pr11.BIT_NUMBER_16.bit10)
	#define	PR11H_3		(pr11.BIT_NUMBER_16.bit11)
	#define	PR11H_4		(pr11.BIT_NUMBER_16.bit12)
	#define	PR11H_5		(pr11.BIT_NUMBER_16.bit13)
	#define	PR11H_6		(pr11.BIT_NUMBER_16.bit14)
	#define	PR11H_7		(pr11.BIT_NUMBER_16.bit15)
	#define	PR11H		(pr11.BYTE.pr11h)
#endif

