turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PR11 */
typedef struct{
	SFR_UNSIGNED_CHAR	pr11l;
	SFR_UNSIGNED_CHAR	pr11h;
}SFR_BYTE_PR11;

typedef union{
	SFR_BIT16		BIT_NUMBER_16;
	SFR_BYTE_PR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_PR11;

SFR_GLOBAL	SFR_PR11	pr11;

#ifdef __RL78__
#else
	#define	PR11	(pr11.ALL)
#endif

/*MACRL*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT macrl;
#ifdef __RL78__
#else
	#define	MACRL	(macrl)
#endif

/*MACRH*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT macrh;
#ifdef __RL78__
#else
	#define	MACRH	(macrh)
#endif

/* PMC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PMC;

SFR_GLOBAL	SFR_PM5	pmc;

#ifdef __RL78__
	#define	PMC_0	(PMC.0)
	#define	PMC_1	(PMC.1)
	#define	PMC_2	(PMC.2)
	#define	PMC_3	(PMC.3)
	#define	PMC_4	(PMC.4)
	#define	PMC_5	(PMC.5)
	#define	PMC_6	(PMC.6)
	#define	PMC_7	(PMC.7)
#else
	#define	MAA		(pmc.BIT_NUMBER.bit0)
	#define	PMC_0	(pmc.BIT_NUMBER.bit0)
	#define	PMC_1	(pmc.BIT_NUMBER.bit1)
	#define	PMC_2	(pmc.BIT_NUMBER.bit2)
	#define	PMC_3	(pmc.BIT_NUMBER.bit3)
	#define	PMC_4	(pmc.BIT_NUMBER.bit4)
	#define	PMC_5	(pmc.BIT_NUMBER.bit5)
	#define	PMC_6	(pmc.BIT_NUMBER.bit6)
	#define	PMC_7	(pmc.BIT_NUMBER.bit7)
	#define	PMC	(pmc.ALL)
#endif

/******************************************************************************/
/*                     2nd SFRの置換規則                                      */
/******************************************************************************/

/* ADM2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADM2;

SFR_GLOBAL	SFR_ADM2	adm2;

#ifdef __RL78__
	#define	ADM2_0	(ADM2.0)
	#define	ADM2_1	(ADM2.1)
	#define	ADM2_2	(ADM2.2)
	#define	ADM2_3	(ADM2.3)
	#define	ADM2_4	(ADM2.4)
	#define	ADM2_5	(ADM2.5)
	#define	ADM2_6	(ADM2.6)
	#define	ADM2_7	(ADM2.7)
#else
	#define	ADTYP	(adm2.BIT_NUMBER.bit0)
	#define	AWC		(adm2.BIT_NUMBER.bit2)
	#define	ADRCK	(adm2.BIT_NUMBER.bit3)
	#define	ADM2_0	(adm2.BIT_NUMBER.bit0)
	#define	ADM2_1	(adm2.BIT_NUMBER.bit1)
	#define	ADM2_2	(adm2.BIT_NUMBER.bit2)
	#define	ADM2_3	(adm2.BIT_NUMBER.bit3)
	#define	ADM2_4	(adm2.BIT_NUMBER.bit4)
	#define	ADM2_5	(adm2.BIT_NUMBER.bit5)
	#define	ADM2_6	(adm2.BIT_NUMBER.bit6)
	#define	ADM2_7	(adm2.BIT_NUMBER.bit7)
	#define	ADM2	(adm2.ALL)
#endif

/* ADUL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	adul;

#ifdef __RL78__
#else
	#define	ADUL	(adul)
#endif

/* ADLL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	adll;

#ifdef __RL78__
#else
	#define	ADLL	(adll)
#endif

/* ADTES */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	adtes;

#ifdef __RL78__
#else
	#define	ADTES	(adtes)
#endif

/* PIOR0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior0;

#ifdef __RL78__
#else
	#define	PIOR0	(pior0)
#endif

/* PIOR1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior1;

#ifdef __RL78__
#else
	#define	PIOR1	(pior1)
#endif

/* PIOR2 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior2;

#ifdef __RL78__
#else
	#define	PIOR2	(pior2)
#endif

/* PIOR3 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior3;

#ifdef __RL78__
#else
	#define	PIOR3	(pior3)
#endif

/* PIOR4 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior4;

#ifdef __RL78__
#else
	#define	PIOR4	(pior4)
#endif

/* PIOR5 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior5;

#ifdef __RL78__
#else
	#define	PIOR5	(pior5)
#endif

/* PIOR6 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior6;

#ifdef __RL78__
#else
	#define	PIOR6	(pior6)
#endif

/* PIOR7 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior7;

#ifdef __RL78__
#else
	#define	PIOR7	(pior7)
#endif

/* PIOR8 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	pior8;

#ifdef __RL78__
#else
	#define	PIOR8	(pior8)
#endif

/* PITHL1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL1;

SFR_GLOBAL	SFR_PITHL1	pithl1;

#ifdef __RL78__
	#define	PITHL1_0	(PITHL1.0)
	#define	PITHL1_1	(PITHL1.1)
	#define	PITHL1_2	(PITHL1.2)
	#define	PITHL1_3	(PITHL1.3)
	#define	PITHL1_4	(PITHL1.4)
	#define	PITHL1_5	(PITHL1.5)
	#define	PITHL1_6	(PITHL1.6)
	#define	PITHL1_7	(PITHL1.7)
#else
	#define	PITHL1_0	(pithl1.BIT_NUMBER.bit0)
	#define	PITHL1_1	(pithl1.BIT_NUMBER.bit1)
	#define	PITHL1_2	(pithl1.BIT_NUMBER.bit2)
	#define	PITHL1_3	(pithl1.BIT_NUMBER.bit3)
	#define	PITHL1_4	(pithl1.BIT_NUMBER.bit4)
	#define	PITHL1_5	(pithl1.BIT_NUMBER.bit5)
	#define	PITHL1_6	(pithl1.BIT_NUMBER.bit6)
	#define	PITHL1_7	(pithl1.BIT_NUMBER.bit7)
	#define	PITHL1	(pithl1.ALL)
#endif

/* PITHL3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL3;

SFR_GLOBAL	SFR_PITHL3	pithl3;

#ifdef __RL78__
	#define	PITHL3_0	(PITHL3.0)
	#define	PITHL3_1	(PITHL3.1)
	#define	PITHL3_2	(PITHL3.2)
	#define	PITHL3_3	(PITHL3.3)
	#define	PITHL3_4	(PITHL3.4)
	#define	PITHL3_5	(PITHL3.5)
	#define	PITHL3_6	(PITHL3.6)
	#define	PITHL3_7	(PITHL3.7)
#else
	#define	PITHL3_0	(pithl3.BIT_NUMBER.bit0)
	#define	PITHL3_1	(pithl3.BIT_NUMBER.bit1)
	#define	PITHL3_2	(pithl3.BIT_NUMBER.bit2)
	#define	PITHL3_3	(pithl3.BIT_NUMBER.bit3)
	#define	PITHL3_4	(pithl3.BIT_NUMBER.bit4)
	#define	PITHL3_5	(pithl3.BIT_NUMBER.bit5)
	#define	PITHL3_6	(pithl3.BIT_NUMBER.bit6)
	#define	PITHL3_7	(pithl3.BIT_NUMBER.bit7)
	#define	PITHL3		(pithl3.ALL)
#endif

/* PITHL4 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL4;

SFR_GLOBAL	SFR_PITHL4	pithl4;

#ifdef __RL78__
	#define	PITHL4_0	(PITHL4.0)
	#define	PITHL4_1	(PITHL4.1)
	#define	PITHL4_2	(PITHL4.2)
	#define	PITHL4_3	(PITHL4.3)
	#define	PITHL4_4	(PITHL4.4)
	#define	PITHL4_5	(PITHL4.5)
	#define	PITHL4_6	(PITHL4.6)
	#define	PITHL4_7	(PITHL4.7)
#else
	#define	PITHL4_0	(pithl4.BIT_NUMBER.bit0)
	#define	PITHL4_1	(pithl4.BIT_NUMBER.bit1)
	#define	PITHL4_2	(pithl4.BIT_NUMBER.bit2)
	#define	PITHL4_3	(pithl4.BIT_NUMBER.bit3)
	#define	PITHL4_4	(pithl4.BIT_NUMBER.bit4)
	#define	PITHL4_5	(pithl4.BIT_NUMBER.bit5)
	#define	PITHL4_6	(pithl4.BIT_NUMBER.bit6)
	#define	PITHL4_7	(pithl4.BIT_NUMBER.bit7)
	#define	PITHL4		(pithl4.ALL)
#endif

/* PITHL5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL5;

SFR_GLOBAL	SFR_PITHL5	pithl5;

#ifdef __RL78__
	#define	PITHL5_0	(PITHL5.0)
	#define	PITHL5_1	(PITHL5.1)
	#define	PITHL5_2	(PITHL5.2)
	#define	PITHL5_3	(PITHL5.3)
	#define	PITHL5_4	(PITHL5.4)
	#define	PITHL5_5	(PITHL5.5)
	#define	PITHL5_6	(PITHL5.6)
	#define	PITHL5_7	(PITHL5.7)
#else
	#define	PITHL5_0	(pithl5.BIT_NUMBER.bit0)
	#define	PITHL5_1	(pithl5.BIT_NUMBER.bit1)
	#define	PITHL5_2	(pithl5.BIT_NUMBER.bit2)
	#define	PITHL5_3	(pithl5.BIT_NUMBER.bit3)
	#define	PITHL5_4	(pithl5.BIT_NUMBER.bit4)
	#define	PITHL5_5	(pithl5.BIT_NUMBER.bit5)
	#define	PITHL5_6	(pithl5.BIT_NUMBER.bit6)
	#define	PITHL5_7	(pithl5.BIT_NUMBER.bit7)
	#define	PITHL5		(pithl5.ALL)
#endif

