turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PITHL6 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL6;

SFR_GLOBAL	SFR_PITHL6	pithl6;

#ifdef __RL78__
	#define	PITHL6_0	(PITHL6.0)
	#define	PITHL6_1	(PITHL6.1)
	#define	PITHL6_2	(PITHL6.2)
	#define	PITHL6_3	(PITHL6.3)
	#define	PITHL6_4	(PITHL6.4)
	#define	PITHL6_5	(PITHL6.5)
	#define	PITHL6_6	(PITHL6.6)
	#define	PITHL6_7	(PITHL6.7)
#else
	#define	PITHL6_0	(pithl6.BIT_NUMBER.bit0)
	#define	PITHL6_1	(pithl6.BIT_NUMBER.bit1)
	#define	PITHL6_2	(pithl6.BIT_NUMBER.bit2)
	#define	PITHL6_3	(pithl6.BIT_NUMBER.bit3)
	#define	PITHL6_4	(pithl6.BIT_NUMBER.bit4)
	#define	PITHL6_5	(pithl6.BIT_NUMBER.bit5)
	#define	PITHL6_6	(pithl6.BIT_NUMBER.bit6)
	#define	PITHL6_7	(pithl6.BIT_NUMBER.bit7)
	#define	PITHL6		(pithl6.ALL)
#endif

/* PITHL7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL7;

SFR_GLOBAL	SFR_PITHL7	pithl7;

#ifdef __RL78__
	#define	PITHL7_0	(PITHL7.0)
	#define	PITHL7_1	(PITHL7.1)
	#define	PITHL7_2	(PITHL7.2)
	#define	PITHL7_3	(PITHL7.3)
	#define	PITHL7_4	(PITHL7.4)
	#define	PITHL7_5	(PITHL7.5)
	#define	PITHL7_6	(PITHL7.6)
	#define	PITHL7_7	(PITHL7.7)
#else
	#define	PITHL7_0	(pithl7.BIT_NUMBER.bit0)
	#define	PITHL7_1	(pithl7.BIT_NUMBER.bit1)
	#define	PITHL7_2	(pithl7.BIT_NUMBER.bit2)
	#define	PITHL7_3	(pithl7.BIT_NUMBER.bit3)
	#define	PITHL7_4	(pithl7.BIT_NUMBER.bit4)
	#define	PITHL7_5	(pithl7.BIT_NUMBER.bit5)
	#define	PITHL7_6	(pithl7.BIT_NUMBER.bit6)
	#define	PITHL7_7	(pithl7.BIT_NUMBER.bit7)
	#define	PITHL7		(pithl7.ALL)
#endif

/* PITHL10 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL10;

SFR_GLOBAL	SFR_PITHL10	pithl10;

#ifdef __RL78__
	#define	PITHL10_0	(PITHL10.0)
	#define	PITHL10_1	(PITHL10.1)
	#define	PITHL10_2	(PITHL10.2)
	#define	PITHL10_3	(PITHL10.3)
	#define	PITHL10_4	(PITHL10.4)
	#define	PITHL10_5	(PITHL10.5)
	#define	PITHL10_6	(PITHL10.6)
	#define	PITHL10_7	(PITHL10.7)
#else
	#define	PITHL10_0	(pithl10.BIT_NUMBER.bit0)
	#define	PITHL10_1	(pithl10.BIT_NUMBER.bit1)
	#define	PITHL10_2	(pithl10.BIT_NUMBER.bit2)
	#define	PITHL10_3	(pithl10.BIT_NUMBER.bit3)
	#define	PITHL10_4	(pithl10.BIT_NUMBER.bit4)
	#define	PITHL10_5	(pithl10.BIT_NUMBER.bit5)
	#define	PITHL10_6	(pithl10.BIT_NUMBER.bit6)
	#define	PITHL10_7	(pithl10.BIT_NUMBER.bit7)
	#define	PITHL10		(pithl10.ALL)
#endif

/* PITHL12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL12;

SFR_GLOBAL	SFR_PITHL12	pithl12;

#ifdef __RL78__
	#define	PITHL12_0	(PITHL12.0)
	#define	PITHL12_1	(PITHL12.1)
	#define	PITHL12_2	(PITHL12.2)
	#define	PITHL12_3	(PITHL12.3)
	#define	PITHL12_4	(PITHL12.4)
	#define	PITHL12_5	(PITHL12.5)
	#define	PITHL12_6	(PITHL12.6)
	#define	PITHL12_7	(PITHL12.7)
#else
	#define	PITHL12_0	(pithl12.BIT_NUMBER.bit0)
	#define	PITHL12_1	(pithl12.BIT_NUMBER.bit1)
	#define	PITHL12_2	(pithl12.BIT_NUMBER.bit2)
	#define	PITHL12_3	(pithl12.BIT_NUMBER.bit3)
	#define	PITHL12_4	(pithl12.BIT_NUMBER.bit4)
	#define	PITHL12_5	(pithl12.BIT_NUMBER.bit5)
	#define	PITHL12_6	(pithl12.BIT_NUMBER.bit6)
	#define	PITHL12_7	(pithl12.BIT_NUMBER.bit7)
	#define	PITHL12		(pithl12.ALL)
#endif

/* PITHL15 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PITHL15;

SFR_GLOBAL	SFR_PITHL15	pithl15;

#ifdef __RL78__
	#define	PITHL15_0	(PITHL15.0)
	#define	PITHL15_1	(PITHL15.1)
	#define	PITHL15_2	(PITHL15.2)
	#define	PITHL15_3	(PITHL15.3)
	#define	PITHL15_4	(PITHL15.4)
	#define	PITHL15_5	(PITHL15.5)
	#define	PITHL15_6	(PITHL15.6)
	#define	PITHL15_7	(PITHL15.7)
#else
	#define	PITHL15_0	(pithl15.BIT_NUMBER.bit0)
	#define	PITHL15_1	(pithl15.BIT_NUMBER.bit1)
	#define	PITHL15_2	(pithl15.BIT_NUMBER.bit2)
	#define	PITHL15_3	(pithl15.BIT_NUMBER.bit3)
	#define	PITHL15_4	(pithl15.BIT_NUMBER.bit4)
	#define	PITHL15_5	(pithl15.BIT_NUMBER.bit5)
	#define	PITHL15_6	(pithl15.BIT_NUMBER.bit6)
	#define	PITHL15_7	(pithl15.BIT_NUMBER.bit7)
	#define	PITHL15		(pithl15.ALL)
#endif

/* PU0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU0;

SFR_GLOBAL	SFR_PU0	pu0;

#ifdef __RL78__
	#define	PU0_0	(PU0.0)
	#define	PU0_1	(PU0.1)
	#define	PU0_2	(PU0.2)
	#define	PU0_3	(PU0.3)
	#define	PU0_4	(PU0.4)
	#define	PU0_5	(PU0.5)
	#define	PU0_6	(PU0.6)
	#define	PU0_7	(PU0.7)
#else
	#define	PU0_0	(pu0.BIT_NUMBER.bit0)
	#define	PU0_1	(pu0.BIT_NUMBER.bit1)
	#define	PU0_2	(pu0.BIT_NUMBER.bit2)
	#define	PU0_3	(pu0.BIT_NUMBER.bit3)
	#define	PU0_4	(pu0.BIT_NUMBER.bit4)
	#define	PU0_5	(pu0.BIT_NUMBER.bit5)
	#define	PU0_6	(pu0.BIT_NUMBER.bit6)
	#define	PU0_7	(pu0.BIT_NUMBER.bit7)
	#define	PU0	(pu0.ALL)
#endif

/* PU1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU1;

SFR_GLOBAL	SFR_PU1	pu1;

#ifdef __RL78__
	#define	PU1_0	(PU1.0)
	#define	PU1_1	(PU1.1)
	#define	PU1_2	(PU1.2)
	#define	PU1_3	(PU1.3)
	#define	PU1_4	(PU1.4)
	#define	PU1_5	(PU1.5)
	#define	PU1_6	(PU1.6)
	#define	PU1_7	(PU1.7)
#else
	#define	PU1_0	(pu1.BIT_NUMBER.bit0)
	#define	PU1_1	(pu1.BIT_NUMBER.bit1)
	#define	PU1_2	(pu1.BIT_NUMBER.bit2)
	#define	PU1_3	(pu1.BIT_NUMBER.bit3)
	#define	PU1_4	(pu1.BIT_NUMBER.bit4)
	#define	PU1_5	(pu1.BIT_NUMBER.bit5)
	#define	PU1_6	(pu1.BIT_NUMBER.bit6)
	#define	PU1_7	(pu1.BIT_NUMBER.bit7)
	#define	PU1	(pu1.ALL)
#endif

/* PU3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU3;

SFR_GLOBAL	SFR_PU3	pu3;

#ifdef __RL78__
	#define	PU3_0	(PU3.0)
	#define	PU3_1	(PU3.1)
	#define	PU3_2	(PU3.2)
	#define	PU3_3	(PU3.3)
	#define	PU3_4	(PU3.4)
	#define	PU3_5	(PU3.5)
	#define	PU3_6	(PU3.6)
	#define	PU3_7	(PU3.7)
#else
	#define	PU3_0	(pu3.BIT_NUMBER.bit0)
	#define	PU3_1	(pu3.BIT_NUMBER.bit1)
	#define	PU3_2	(pu3.BIT_NUMBER.bit2)
	#define	PU3_3	(pu3.BIT_NUMBER.bit3)
	#define	PU3_4	(pu3.BIT_NUMBER.bit4)
	#define	PU3_5	(pu3.BIT_NUMBER.bit5)
	#define	PU3_6	(pu3.BIT_NUMBER.bit6)
	#define	PU3_7	(pu3.BIT_NUMBER.bit7)
	#define	PU3	(pu3.ALL)
#endif

/* PU4 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU4;

SFR_GLOBAL	SFR_PU4	pu4;

#ifdef __RL78__
	#define	PU4_0	(PU4.0)
	#define	PU4_1	(PU4.1)
	#define	PU4_2	(PU4.2)
	#define	PU4_3	(PU4.3)
	#define	PU4_4	(PU4.4)
	#define	PU4_5	(PU4.5)
	#define	PU4_6	(PU4.6)
	#define	PU4_7	(PU4.7)
#else
	#define	PU4_0	(pu4.BIT_NUMBER.bit0)
	#define	PU4_1	(pu4.BIT_NUMBER.bit1)
	#define	PU4_2	(pu4.BIT_NUMBER.bit2)
	#define	PU4_3	(pu4.BIT_NUMBER.bit3)
	#define	PU4_4	(pu4.BIT_NUMBER.bit4)
	#define	PU4_5	(pu4.BIT_NUMBER.bit5)
	#define	PU4_6	(pu4.BIT_NUMBER.bit6)
	#define	PU4_7	(pu4.BIT_NUMBER.bit7)
	#define	PU4	(pu4.ALL)
#endif

