turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PU5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU5;

SFR_GLOBAL	SFR_PU5	pu5;

#ifdef __RL78__
	#define	PU5_0	(PU)
	#define	PU5_1	(PU5.1)
	#define	PU5_2	(PU5.2)
	#define	PU5_3	(PU5.3)
	#define	PU5_4	(PU5.4)
	#define	PU5_5	(PU5.5)
	#define	PU5_6	(PU5.6)
	#define	PU5_7	(PU5.7)
#else
	#define	PU5_0	(pu5.BIT_NUMBER.bit0)
	#define	PU5_1	(pu5.BIT_NUMBER.bit1)
	#define	PU5_2	(pu5.BIT_NUMBER.bit2)
	#define	PU5_3	(pu5.BIT_NUMBER.bit3)
	#define	PU5_4	(pu5.BIT_NUMBER.bit4)
	#define	PU5_5	(pu5.BIT_NUMBER.bit5)
	#define	PU5_6	(pu5.BIT_NUMBER.bit6)
	#define	PU5_7	(pu5.BIT_NUMBER.bit7)
	#define	PU5	(pu5.ALL)
#endif

/* PU6 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU6;

SFR_GLOBAL	SFR_PU6	pu6;

#ifdef __RL78__
	#define	PU6_0	(PU6.0)
	#define	PU6_1	(PU6.1)
	#define	PU6_2	(PU6.2)
	#define	PU6_3	(PU6.3)
	#define	PU6_4	(PU6.4)
	#define	PU6_5	(PU6.5)
	#define	PU6_6	(PU6.6)
	#define	PU6_7	(PU6.7)
#else
	#define	PU6_0	(pu6.BIT_NUMBER.bit0)
	#define	PU6_1	(pu6.BIT_NUMBER.bit1)
	#define	PU6_2	(pu6.BIT_NUMBER.bit2)
	#define	PU6_3	(pu6.BIT_NUMBER.bit3)
	#define	PU6_4	(pu6.BIT_NUMBER.bit4)
	#define	PU6_5	(pu6.BIT_NUMBER.bit5)
	#define	PU6_6	(pu6.BIT_NUMBER.bit6)
	#define	PU6_7	(pu6.BIT_NUMBER.bit7)
	#define	PU6	(pu6.ALL)
#endif

/* PU7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU7;

SFR_GLOBAL	SFR_PU7	pu7;

#ifdef __RL78__
	#define	PU7_0	(PU7.0)
	#define	PU7_1	(PU7.1)
	#define	PU7_2	(PU7.2)
	#define	PU7_3	(PU7.3)
	#define	PU7_4	(PU7.4)
	#define	PU7_5	(PU7.5)
	#define	PU7_6	(PU7.6)
	#define	PU7_7	(PU7.7)
#else
	#define	PU7_0	(pu7.BIT_NUMBER.bit0)
	#define	PU7_1	(pu7.BIT_NUMBER.bit1)
	#define	PU7_2	(pu7.BIT_NUMBER.bit2)
	#define	PU7_3	(pu7.BIT_NUMBER.bit3)
	#define	PU7_4	(pu7.BIT_NUMBER.bit4)
	#define	PU7_5	(pu7.BIT_NUMBER.bit5)
	#define	PU7_6	(pu7.BIT_NUMBER.bit6)
	#define	PU7_7	(pu7.BIT_NUMBER.bit7)
	#define	PU7	(pu7.ALL)
#endif

/* PU9 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU9;

SFR_GLOBAL	SFR_PU9	pu9;

#ifdef __RL78__
	#define	PU9_0	(PU9.0)
	#define	PU9_1	(PU9.1)
	#define	PU9_2	(PU9.2)
	#define	PU9_3	(PU9.3)
	#define	PU9_4	(PU9.4)
	#define	PU9_5	(PU9.5)
	#define	PU9_6	(PU9.6)
	#define	PU9_7	(PU9.7)
#else
	#define	PU9_0	(pu9.BIT_NUMBER.bit0)
	#define	PU9_1	(pu9.BIT_NUMBER.bit1)
	#define	PU9_2	(pu9.BIT_NUMBER.bit2)
	#define	PU9_3	(pu9.BIT_NUMBER.bit3)
	#define	PU9_4	(pu9.BIT_NUMBER.bit4)
	#define	PU9_5	(pu9.BIT_NUMBER.bit5)
	#define	PU9_6	(pu9.BIT_NUMBER.bit6)
	#define	PU9_7	(pu9.BIT_NUMBER.bit7)
	#define	PU9	(pu9.ALL)
#endif

/* PU10 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU10;

SFR_GLOBAL	SFR_PU10	pu10;

#ifdef __RL78__
	#define	PU10_0	(PU10.0)
	#define	PU10_1	(PU10.1)
	#define	PU10_2	(PU10.2)
	#define	PU10_3	(PU10.3)
	#define	PU10_4	(PU10.4)
	#define	PU10_5	(PU10.5)
	#define	PU10_6	(PU10.6)
	#define	PU10_7	(PU10.7)
#else
	#define	PU10_0	(pu10.BIT_NUMBER.bit0)
	#define	PU10_1	(pu10.BIT_NUMBER.bit1)
	#define	PU10_2	(pu10.BIT_NUMBER.bit2)
	#define	PU10_3	(pu10.BIT_NUMBER.bit3)
	#define	PU10_4	(pu10.BIT_NUMBER.bit4)
	#define	PU10_5	(pu10.BIT_NUMBER.bit5)
	#define	PU10_6	(pu10.BIT_NUMBER.bit6)
	#define	PU10_7	(pu10.BIT_NUMBER.bit7)
	#define	PU10	(pu10.ALL)
#endif

/* PU12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU12;

SFR_GLOBAL	SFR_PU12	pu12;

#ifdef __RL78__
	#define	PU12_0	(PU12.0)
	#define	PU12_1	(PU12.1)
	#define	PU12_2	(PU12.2)
	#define	PU12_3	(PU12.3)
	#define	PU12_4	(PU12.4)
	#define	PU12_5	(PU12.5)
	#define	PU12_6	(PU12.6)
	#define	PU12_7	(PU12.7)
#else
	#define	PU12_0	(pu12.BIT_NUMBER.bit0)
	#define	PU12_1	(pu12.BIT_NUMBER.bit1)
	#define	PU12_2	(pu12.BIT_NUMBER.bit2)
	#define	PU12_3	(pu12.BIT_NUMBER.bit3)
	#define	PU12_4	(pu12.BIT_NUMBER.bit4)
	#define	PU12_5	(pu12.BIT_NUMBER.bit5)
	#define	PU12_6	(pu12.BIT_NUMBER.bit6)
	#define	PU12_7	(pu12.BIT_NUMBER.bit7)
	#define	PU12	(pu12.ALL)
#endif

/* PU14 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU14;

SFR_GLOBAL	SFR_PU14	pu14;

#ifdef __RL78__
	#define	PU14_0	(PU14.0)
	#define	PU14_1	(PU14.1)
	#define	PU14_2	(PU14.2)
	#define	PU14_3	(PU14.3)
	#define	PU14_4	(PU14.4)
	#define	PU14_5	(PU14.5)
	#define	PU14_6	(PU14.6)
	#define	PU14_7	(PU14.7)
#else
	#define	PU14_0	(pu14.BIT_NUMBER.bit0)
	#define	PU14_1	(pu14.BIT_NUMBER.bit1)
	#define	PU14_2	(pu14.BIT_NUMBER.bit2)
	#define	PU14_3	(pu14.BIT_NUMBER.bit3)
	#define	PU14_4	(pu14.BIT_NUMBER.bit4)
	#define	PU14_5	(pu14.BIT_NUMBER.bit5)
	#define	PU14_6	(pu14.BIT_NUMBER.bit6)
	#define	PU14_7	(pu14.BIT_NUMBER.bit7)
	#define	PU14	(pu14.ALL)
#endif

/* PU15 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PU15;

SFR_GLOBAL	SFR_PU15	pu15;

#ifdef __RL78__
	#define	PU15_0	(PU15.0)
	#define	PU15_1	(PU15.1)
	#define	PU15_2	(PU15.2)
	#define	PU15_3	(PU15.3)
	#define	PU15_4	(PU15.4)
	#define	PU15_5	(PU15.5)
	#define	PU15_6	(PU15.6)
	#define	PU15_7	(PU15.7)
#else
	#define	PU15_0	(pu15.BIT_NUMBER.bit0)
	#define	PU15_1	(pu15.BIT_NUMBER.bit1)
	#define	PU15_2	(pu15.BIT_NUMBER.bit2)
	#define	PU15_3	(pu15.BIT_NUMBER.bit3)
	#define	PU15_4	(pu15.BIT_NUMBER.bit4)
	#define	PU15_5	(pu15.BIT_NUMBER.bit5)
	#define	PU15_6	(pu15.BIT_NUMBER.bit6)
	#define	PU15_7	(pu15.BIT_NUMBER.bit7)
	#define	PU15	(pu15.ALL)
#endif

/* PIM1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM1;

SFR_GLOBAL	SFR_PIM1	pim1;

#ifdef __RL78__
	#define	PIM1_0	(PIM1.0)
	#define	PIM1_1	(PIM1.1)
	#define	PIM1_2	(PIM1.2)
	#define	PIM1_3	(PIM1.3)
	#define	PIM1_4	(PIM1.4)
	#define	PIM1_5	(PIM1.5)
	#define	PIM1_6	(PIM1.6)
	#define	PIM1_7	(PIM1.7)
#else
	#define	PIM1_0	(pim1.BIT_NUMBER.bit0)
	#define	PIM1_1	(pim1.BIT_NUMBER.bit1)
	#define	PIM1_2	(pim1.BIT_NUMBER.bit2)
	#define	PIM1_3	(pim1.BIT_NUMBER.bit3)
	#define	PIM1_4	(pim1.BIT_NUMBER.bit4)
	#define	PIM1_5	(pim1.BIT_NUMBER.bit5)
	#define	PIM1_6	(pim1.BIT_NUMBER.bit6)
	#define	PIM1_7	(pim1.BIT_NUMBER.bit7)
	#define	PIM1	(pim1.ALL)
#endif

/* PIM3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM3;

SFR_GLOBAL	SFR_PIM3	pim3;

#ifdef __RL78__
	#define	PIM3_0	(PIM3.0)
	#define	PIM3_1	(PIM3.1)
	#define	PIM3_2	(PIM3.2)
	#define	PIM3_3	(PIM3.3)
	#define	PIM3_4	(PIM3.4)
	#define	PIM3_5	(PIM3.5)
	#define	PIM3_6	(PIM3.6)
	#define	PIM3_7	(PIM3.7)
#else
	#define	PIM3_0	(pim3.BIT_NUMBER.bit0)
	#define	PIM3_1	(pim3.BIT_NUMBER.bit1)
	#define	PIM3_2	(pim3.BIT_NUMBER.bit2)
	#define	PIM3_3	(pim3.BIT_NUMBER.bit3)
	#define	PIM3_4	(pim3.BIT_NUMBER.bit4)
	#define	PIM3_5	(pim3.BIT_NUMBER.bit5)
	#define	PIM3_6	(pim3.BIT_NUMBER.bit6)
	#define	PIM3_7	(pim3.BIT_NUMBER.bit7)
	#define	PIM3	(pim3.ALL)
#endif

/* PIM5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM5;

SFR_GLOBAL	SFR_PIM5	pim5;

#ifdef __RL78__
	#define	PIM5_0	(PIM5.0)
	#define	PIM5_1	(PIM5.1)
	#define	PIM5_2	(PIM5.2)
	#define	PIM5_3	(PIM5.3)
	#define	PIM5_4	(PIM5.4)
	#define	PIM5_5	(PIM5.5)
	#define	PIM5_6	(PIM5.6)
	#define	PIM5_7	(PIM5.7)
#else
	#define	PIM5_0	(pim5.BIT_NUMBER.bit0)
	#define	PIM5_1	(pim5.BIT_NUMBER.bit1)
	#define	PIM5_2	(pim5.BIT_NUMBER.bit2)
	#define	PIM5_3	(pim5.BIT_NUMBER.bit3)
	#define	PIM5_4	(pim5.BIT_NUMBER.bit4)
	#define	PIM5_5	(pim5.BIT_NUMBER.bit5)
	#define	PIM5_6	(pim5.BIT_NUMBER.bit6)
	#define	PIM5_7	(pim5.BIT_NUMBER.bit7)
	#define	PIM5	(pim5.ALL)
#endif

/* PIM6 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM6;

SFR_GLOBAL	SFR_PIM6	pim6;

#ifdef __RL78__
	#define	PIM6_0	(PIM6.0)
	#define	PIM6_1	(PIM6.1)
	#define	PIM6_2	(PIM6.2)
	#define	PIM6_3	(PIM6.3)
	#define	PIM6_4	(PIM6.4)
	#define	PIM6_5	(PIM6.5)
	#define	PIM6_6	(PIM6.6)
	#define	PIM6_7	(PIM6.7)
#else
	#define	PIM6_0	(pim6.BIT_NUMBER.bit0)
	#define	PIM6_1	(pim6.BIT_NUMBER.bit1)
	#define	PIM6_2	(pim6.BIT_NUMBER.bit2)
	#define	PIM6_3	(pim6.BIT_NUMBER.bit3)
	#define	PIM6_4	(pim6.BIT_NUMBER.bit4)
	#define	PIM6_5	(pim6.BIT_NUMBER.bit5)
	#define	PIM6_6	(pim6.BIT_NUMBER.bit6)
	#define	PIM6_7	(pim6.BIT_NUMBER.bit7)
	#define	PIM6	(pim6.ALL)
#endif

/* PIM7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM7;

SFR_GLOBAL	SFR_PIM7	pim7;

#ifdef __RL78__
	#define	PIM7_0	(PIM7.0)
	#define	PIM7_1	(PIM7.1)
	#define	PIM7_2	(PIM7.2)
	#define	PIM7_3	(PIM7.3)
	#define	PIM7_4	(PIM7.4)
	#define	PIM7_5	(PIM7.5)
	#define	PIM7_6	(PIM7.6)
	#define	PIM7_7	(PIM7.7)
#else
	#define	PIM7_0	(pim7.BIT_NUMBER.bit0)
	#define	PIM7_1	(pim7.BIT_NUMBER.bit1)
	#define	PIM7_2	(pim7.BIT_NUMBER.bit2)
	#define	PIM7_3	(pim7.BIT_NUMBER.bit3)
	#define	PIM7_4	(pim7.BIT_NUMBER.bit4)
	#define	PIM7_5	(pim7.BIT_NUMBER.bit5)
	#define	PIM7_6	(pim7.BIT_NUMBER.bit6)
	#define	PIM7_7	(pim7.BIT_NUMBER.bit7)
	#define	PIM7	(pim7.ALL)
#endif

