turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PIM12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PIM12;

SFR_GLOBAL	SFR_PIM12	pim12;

#ifdef __RL78__
	#define	PIM12_0	(PIM12.0)
	#define	PIM12_1	(PIM12.1)
	#define	PIM12_2	(PIM12.2)
	#define	PIM12_3	(PIM12.3)
	#define	PIM12_4	(PIM12.4)
	#define	PIM12_5	(PIM12.5)
	#define	PIM12_6	(PIM12.6)
	#define	PIM12_7	(PIM12.7)
#else
	#define	PIM12_0	(pim12.BIT_NUMBER.bit0)
	#define	PIM12_1	(pim12.BIT_NUMBER.bit1)
	#define	PIM12_2	(pim12.BIT_NUMBER.bit2)
	#define	PIM12_3	(pim12.BIT_NUMBER.bit3)
	#define	PIM12_4	(pim12.BIT_NUMBER.bit4)
	#define	PIM12_5	(pim12.BIT_NUMBER.bit5)
	#define	PIM12_6	(pim12.BIT_NUMBER.bit6)
	#define	PIM12_7	(pim12.BIT_NUMBER.bit7)
	#define	PIM12	(pim12.ALL)
#endif

/* POM1 */
typedef union{
	SFR_BIT8			BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_POM1;

SFR_GLOBAL	SFR_POM1	pom1;

#ifdef __RL78__
	#define	POM1_0	(POM1.0)
	#define	POM1_1	(POM1.1)
	#define	POM1_2	(POM1.2)
	#define	POM1_3	(POM1.3)
	#define	POM1_4	(POM1.4)
	#define	POM1_5	(POM1.5)
	#define	POM1_6	(POM1.6)
	#define	POM1_7	(POM1.7)
#else
	#define	POM1_0	(pom1.BIT_NUMBER.bit0)
	#define	POM1_1	(pom1.BIT_NUMBER.bit1)
	#define	POM1_2	(pom1.BIT_NUMBER.bit2)
	#define	POM1_3	(pom1.BIT_NUMBER.bit3)
	#define	POM1_4	(pom1.BIT_NUMBER.bit4)
	#define	POM1_5	(pom1.BIT_NUMBER.bit5)
	#define	POM1_6	(pom1.BIT_NUMBER.bit6)
	#define	POM1_7	(pom1.BIT_NUMBER.bit7)
	#define	POM1	(pom1.ALL)
#endif

/* POM6 */
typedef union{
	SFR_BIT8			BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_POM6;

SFR_GLOBAL	SFR_POM6	pom6;

#ifdef __RL78__
	#define	POM6_0	(POM6.0)
	#define	POM6_1	(POM6.1)
	#define	POM6_2	(POM6.2)
	#define	POM6_3	(POM6.3)
	#define	POM6_4	(POM6.4)
	#define	POM6_5	(POM6.5)
	#define	POM6_6	(POM6.6)
	#define	POM6_7	(POM6.7)
#else
	#define	POM6_0	(pom6.BIT_NUMBER.bit0)
	#define	POM6_1	(pom6.BIT_NUMBER.bit1)
	#define	POM6_2	(pom6.BIT_NUMBER.bit2)
	#define	POM6_3	(pom6.BIT_NUMBER.bit3)
	#define	POM6_4	(pom6.BIT_NUMBER.bit4)
	#define	POM6_5	(pom6.BIT_NUMBER.bit5)
	#define	POM6_6	(pom6.BIT_NUMBER.bit6)
	#define	POM6_7	(pom6.BIT_NUMBER.bit7)
	#define	POM6	(pom6.ALL)
#endif

/* POM7 */
typedef union{
	SFR_BIT8			BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_POM7;

SFR_GLOBAL	SFR_POM7	pom7;

#ifdef __RL78__
	#define	POM7_0	(POM7.0)
	#define	POM7_1	(POM7.1)
	#define	POM7_2	(POM7.2)
	#define	POM7_3	(POM7.3)
	#define	POM7_4	(POM7.4)
	#define	POM7_5	(POM7.5)
	#define	POM7_6	(POM7.6)
	#define	POM7_7	(POM7.7)
#else
	#define	POM7_0	(pom7.BIT_NUMBER.bit0)
	#define	POM7_1	(pom7.BIT_NUMBER.bit1)
	#define	POM7_2	(pom7.BIT_NUMBER.bit2)
	#define	POM7_3	(pom7.BIT_NUMBER.bit3)
	#define	POM7_4	(pom7.BIT_NUMBER.bit4)
	#define	POM7_5	(pom7.BIT_NUMBER.bit5)
	#define	POM7_6	(pom7.BIT_NUMBER.bit6)
	#define	POM7_7	(pom7.BIT_NUMBER.bit7)
	#define	POM7	(pom7.ALL)
#endif

/* POM12 */
typedef union{
	SFR_BIT8			BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_POM12;

SFR_GLOBAL	SFR_POM12	pom12;

#ifdef __RL78__
	#define	POM12_0	(POM12.0)
	#define	POM12_1	(POM12.1)
	#define	POM12_2	(POM12.2)
	#define	POM12_3	(POM12.3)
	#define	POM12_4	(POM12.4)
	#define	POM12_5	(POM12.5)
	#define	POM12_6	(POM12.6)
	#define	POM12_7	(POM12.7)
#else
	#define	POM12_0	(pom12.BIT_NUMBER.bit0)
	#define	POM12_1	(pom12.BIT_NUMBER.bit1)
	#define	POM12_2	(pom12.BIT_NUMBER.bit2)
	#define	POM12_3	(pom12.BIT_NUMBER.bit3)
	#define	POM12_4	(pom12.BIT_NUMBER.bit4)
	#define	POM12_5	(pom12.BIT_NUMBER.bit5)
	#define	POM12_6	(pom12.BIT_NUMBER.bit6)
	#define	POM12_7	(pom12.BIT_NUMBER.bit7)
	#define	POM12	(pom12.ALL)
#endif

/* PMC7 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PMC7;

SFR_GLOBAL	SFR_PMC7	pmc7;

#ifdef __RL78__
	#define	PMC7_0	(PMC7.0)
	#define	PMC7_1	(PMC7.1)
	#define	PMC7_2	(PMC7.2)
	#define	PMC7_3	(PMC7.3)
	#define	PMC7_4	(PMC7.4)
	#define	PMC7_5	(PMC7.5)
	#define	PMC7_6	(PMC7.6)
	#define	PMC7_7	(PMC7.7)
#else
	#define	PMC7_0	(pmc7.BIT_NUMBER.bit0)
	#define	PMC7_1	(pmc7.BIT_NUMBER.bit1)
	#define	PMC7_2	(pmc7.BIT_NUMBER.bit2)
	#define	PMC7_3	(pmc7.BIT_NUMBER.bit3)
	#define	PMC7_4	(pmc7.BIT_NUMBER.bit4)
	#define	PMC7_5	(pmc7.BIT_NUMBER.bit5)
	#define	PMC7_6	(pmc7.BIT_NUMBER.bit6)
	#define	PMC7_7	(pmc7.BIT_NUMBER.bit7)
	#define	PMC7	(pmc7.ALL)
#endif

/* PMC9 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PMC9;

SFR_GLOBAL	SFR_PMC9	pmc9;

#ifdef __RL78__
	#define	PMC9_0	(PMC9.0)
	#define	PMC9_1	(PMC9.1)
	#define	PMC9_2	(PMC9.2)
	#define	PMC9_3	(PMC9.3)
	#define	PMC9_4	(PMC9.4)
	#define	PMC9_5	(PMC9.5)
	#define	PMC9_6	(PMC9.6)
	#define	PMC9_7	(PMC9.7)
#else
	#define	PMC9_0	(pmc9.BIT_NUMBER.bit0)
	#define	PMC9_1	(pmc9.BIT_NUMBER.bit1)
	#define	PMC9_2	(pmc9.BIT_NUMBER.bit2)
	#define	PMC9_3	(pmc9.BIT_NUMBER.bit3)
	#define	PMC9_4	(pmc9.BIT_NUMBER.bit4)
	#define	PMC9_5	(pmc9.BIT_NUMBER.bit5)
	#define	PMC9_6	(pmc9.BIT_NUMBER.bit6)
	#define	PMC9_7	(pmc9.BIT_NUMBER.bit7)
	#define	PMC9	(pmc9.ALL)
#endif

/* PMC12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PMC12;

SFR_GLOBAL	SFR_PMC12	pmc12;

#ifdef __RL78__
	#define	PMC12_0	(PMC12.0)
	#define	PMC12_1	(PMC12.1)
	#define	PMC12_2	(PMC12.2)
	#define	PMC12_3	(PMC12.3)
	#define	PMC12_4	(PMC12.4)
	#define	PMC12_5	(PMC12.5)
	#define	PMC12_6	(PMC12.6)
	#define	PMC12_7	(PMC12.7)
#else
	#define	PMC12_0	(pmc12.BIT_NUMBER.bit0)
	#define	PMC12_1	(pmc12.BIT_NUMBER.bit1)
	#define	PMC12_2	(pmc12.BIT_NUMBER.bit2)
	#define	PMC12_3	(pmc12.BIT_NUMBER.bit3)
	#define	PMC12_4	(pmc12.BIT_NUMBER.bit4)
	#define	PMC12_5	(pmc12.BIT_NUMBER.bit5)
	#define	PMC12_6	(pmc12.BIT_NUMBER.bit6)
	#define	PMC12_7	(pmc12.BIT_NUMBER.bit7)
	#define	PMC12	(pmc12.ALL)
#endif

/* NFEN0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_NFEN0;

SFR_GLOBAL	SFR_NFEN0	nfen0;

#ifdef __RL78__
	#define	NFEN0_0	(NFEN0.0)
	#define	NFEN0_1	(NFEN0.1)
	#define	NFEN0_2	(NFEN0.2)
	#define	NFEN0_3	(NFEN0.3)
	#define	NFEN0_4	(NFEN0.4)
	#define	NFEN0_5	(NFEN0.5)
	#define	NFEN0_6	(NFEN0.6)
	#define	NFEN0_7	(NFEN0.7)
#else
	#define	NFEN0_0	(nfen0.BIT_NUMBER.bit0)
	#define	NFEN0_1	(nfen0.BIT_NUMBER.bit1)
	#define	NFEN0_2	(nfen0.BIT_NUMBER.bit2)
	#define	NFEN0_3	(nfen0.BIT_NUMBER.bit3)
	#define	NFEN0_4	(nfen0.BIT_NUMBER.bit4)
	#define	NFEN0_5	(nfen0.BIT_NUMBER.bit5)
	#define	NFEN0_6	(nfen0.BIT_NUMBER.bit6)
	#define	NFEN0_7	(nfen0.BIT_NUMBER.bit7)
	#define	NFEN0	(nfen0.ALL)
#endif

/* NFEN1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_NFEN1;

SFR_GLOBAL	SFR_NFEN1	nfen1;

#ifdef __RL78__
	#define	NFEN1_0	(NFEN1.0)
	#define	NFEN1_1	(NFEN1.1)
	#define	NFEN1_2	(NFEN1.2)
	#define	NFEN1_3	(NFEN1.3)
	#define	NFEN1_4	(NFEN1.4)
	#define	NFEN1_5	(NFEN1.5)
	#define	NFEN1_6	(NFEN1.6)
	#define	NFEN1_7	(NFEN1.7)
#else
	#define	NFEN1_0	(nfen1.BIT_NUMBER.bit0)
	#define	NFEN1_1	(nfen1.BIT_NUMBER.bit1)
	#define	NFEN1_2	(nfen1.BIT_NUMBER.bit2)
	#define	NFEN1_3	(nfen1.BIT_NUMBER.bit3)
	#define	NFEN1_4	(nfen1.BIT_NUMBER.bit4)
	#define	NFEN1_5	(nfen1.BIT_NUMBER.bit5)
	#define	NFEN1_6	(nfen1.BIT_NUMBER.bit6)
	#define	NFEN1_7	(nfen1.BIT_NUMBER.bit7)
	#define	NFEN1	(nfen1.ALL)
#endif

/* NFEN2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_NFEN2;

SFR_GLOBAL	SFR_NFEN2	nfen2;

#ifdef __RL78__
	#define	NFEN2_0	(NFEN2.0)
	#define	NFEN2_1	(NFEN2.1)
	#define	NFEN2_2	(NFEN2.2)
	#define	NFEN2_3	(NFEN2.3)
	#define	NFEN2_4	(NFEN2.4)
	#define	NFEN2_5	(NFEN2.5)
	#define	NFEN2_6	(NFEN2.6)
	#define	NFEN2_7	(NFEN2.7)
#else
	#define	NFEN2_0	(nfen2.BIT_NUMBER.bit0)
	#define	NFEN2_1	(nfen2.BIT_NUMBER.bit1)
	#define	NFEN2_2	(nfen2.BIT_NUMBER.bit2)
	#define	NFEN2_3	(nfen2.BIT_NUMBER.bit3)
	#define	NFEN2_4	(nfen2.BIT_NUMBER.bit4)
	#define	NFEN2_5	(nfen2.BIT_NUMBER.bit5)
	#define	NFEN2_6	(nfen2.BIT_NUMBER.bit6)
	#define	NFEN2_7	(nfen2.BIT_NUMBER.bit7)
	#define	NFEN2	(nfen2.ALL)
#endif

/* ISC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ISC;

SFR_GLOBAL	SFR_ISC	isc;

#ifdef __RL78__
	#define	ISC_0	(ISC.0)
	#define	ISC_1	(ISC.1)
	#define	ISC_2	(ISC.2)
	#define	ISC_3	(ISC.3)
	#define	ISC_4	(ISC.4)
	#define	ISC_5	(ISC.5)
	#define	ISC_6	(ISC.6)
	#define	ISC_7	(ISC.7)
#else
	#define	ISC_0	(isc.BIT_NUMBER.bit0)
	#define	ISC_1	(isc.BIT_NUMBER.bit1)
	#define	ISC_2	(isc.BIT_NUMBER.bit2)
	#define	ISC_3	(isc.BIT_NUMBER.bit3)
	#define	ISC_4	(isc.BIT_NUMBER.bit4)
	#define	ISC_5	(isc.BIT_NUMBER.bit5)
	#define	ISC_6	(isc.BIT_NUMBER.bit6)
	#define	ISC_7	(isc.BIT_NUMBER.bit7)
	#define	ISC	(isc.ALL)
#endif

/* TIS0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tis0;

#ifdef __RL78__
#else
	#define	TIS0	(tis0)
#endif

/* TIS1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tis1;

#ifdef __RL78__
#else
	#define	TIS1	(tis1)
#endif

/* ADPC */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	adpc;

#ifdef __RL78__
#else
	#define	ADPC	(adpc)
#endif

