turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PMS */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PMS;

SFR_GLOBAL	SFR_PMS	pms;

#ifdef __RL78__
	#define	PMS_0	(PMS.0)
	#define	PMS_1	(PMS.1)
	#define	PMS_2	(PMS.2)
	#define	PMS_3	(PMS.3)
	#define	PMS_4	(PMS.4)
	#define	PMS_5	(PMS.5)
	#define	PMS_6	(PMS.6)
	#define	PMS_7	(PMS.7)
#else
	#define	PMS_0	(pms.BIT_NUMBER.bit0)
	#define	PMS_1	(pms.BIT_NUMBER.bit1)
	#define	PMS_2	(pms.BIT_NUMBER.bit2)
	#define	PMS_3	(pms.BIT_NUMBER.bit3)
	#define	PMS_4	(pms.BIT_NUMBER.bit4)
	#define	PMS_5	(pms.BIT_NUMBER.bit5)
	#define	PMS_6	(pms.BIT_NUMBER.bit6)
	#define	PMS_7	(pms.BIT_NUMBER.bit7)
	#define	PMS	(pms.ALL)
#endif

/* IAWCTL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	iawctl;

#ifdef __RL78__
#else
	#define	IAWCTL	(iawctl)
#endif

/* INTFLG0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	intflg0;

#ifdef __RL78__
#else
	#define	INTFLG0	(intflg0)
#endif

/* TIS2 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tis2;

#ifdef __RL78__
#else
	#define	TIS2	(tis2)
#endif

/* LCHSEL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lchsel;

#ifdef __RL78__
#else
	#define	LCHSEL	(lchsel)
#endif

/* INTMSK */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	intmsk;

#ifdef __RL78__
#else
	#define	INTMSK	(intmsk)
#endif

/* DFLCTL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DFLCTL;

SFR_GLOBAL	SFR_DFLCTL	delctl;

#ifdef __RL78__
	#define	DFLCTL_0	(DFLCTL.0)
	#define	DFLCTL_1	(DFLCTL.1)
	#define	DFLCTL_2	(DFLCTL.2)
	#define	DFLCTL_3	(DFLCTL.3)
	#define	DFLCTL_4	(DFLCTL.4)
	#define	DFLCTL_5	(DFLCTL.5)
	#define	DFLCTL_6	(DFLCTL.6)
	#define	DFLCTL_7	(DFLCTL.7)
#else
	#define	DFLEN		(delctl.BIT_NUMBER.bit0)
	#define	DFLCTL_0	(delctl.BIT_NUMBER.bit0)
	#define	DFLCTL_1	(delctl.BIT_NUMBER.bit1)
	#define	DFLCTL_2	(delctl.BIT_NUMBER.bit2)
	#define	DFLCTL_3	(delctl.BIT_NUMBER.bit3)
	#define	DFLCTL_4	(delctl.BIT_NUMBER.bit4)
	#define	DFLCTL_5	(delctl.BIT_NUMBER.bit5)
	#define	DFLCTL_6	(delctl.BIT_NUMBER.bit6)
	#define	DFLCTL_7	(delctl.BIT_NUMBER.bit7)
	#define	DFLCTL	(delctl.ALL)
#endif

/* HIOTRM */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	hiotrm;

#ifdef __RL78__
#else
	#define	HIOTRM	(hiotrm)
#endif

/* HOCODIV */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	hocodiv;

#ifdef __RL78__
#else
	#define	HOCODIV	(hocodiv)
#endif

/* SPMCTRL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	spmctrl;

#ifdef __RL78__
#else
	#define	SPMCTRL	(spmctrl)
#endif

/* SPOFR */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT spofr;
#ifdef __RL78__
#else
	#define	SPOFR	(spofr)
#endif

/* SPUFR */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT spufr;
#ifdef __RL78__
#else
	#define	SPUFR	(spufr)
#endif

/* PER0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PER0;

SFR_GLOBAL	SFR_PER0	per0;

#ifdef __RL78__
	#define	PER0_0	(PER0.0)
	#define	PER0_1	(PER0.1)
	#define	PER0_2	(PER0.2)
	#define	PER0_3	(PER0.3)
	#define	PER0_4	(PER0.4)
	#define	PER0_5	(PER0.5)
	#define	PER0_6	(PER0.6)
	#define	PER0_7	(PER0.7)
#else
	#define	TAU0EN	(per0.BIT_NUMBER.bit0)
	#define	TAU1EN	(per0.BIT_NUMBER.bit1)
	#define	SAU0EN	(per0.BIT_NUMBER.bit2)
	#define	SAU1EN	(per0.BIT_NUMBER.bit3)
	#define	IICA0EN	(per0.BIT_NUMBER.bit4)
	#define	ADCEN	(per0.BIT_NUMBER.bit5)
	#define	RTCEN	(per0.BIT_NUMBER.bit7)
	#define	PER0_0	(per0.BIT_NUMBER.bit0)
	#define	PER0_1	(per0.BIT_NUMBER.bit1)
	#define	PER0_2	(per0.BIT_NUMBER.bit2)
	#define	PER0_3	(per0.BIT_NUMBER.bit3)
	#define	PER0_4	(per0.BIT_NUMBER.bit4)
	#define	PER0_5	(per0.BIT_NUMBER.bit5)
	#define	PER0_6	(per0.BIT_NUMBER.bit6)
	#define	PER0_7	(per0.BIT_NUMBER.bit7)
	#define	PER0	(per0.ALL)
#endif

/* OSMC */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	osmc;

#ifdef __RL78__
#else
	#define	OSMC	(osmc)
#endif

/* BCDADJ */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	bcdadj;

#ifdef __RL78__
#else
	#define	BCDADJ	(bcdadj)
#endif


/* SSR00L */
#ifdef __RL78__
#else
	#define	SSR00L	(ssr00.BYTE.ssr00l)
#endif

/* SSR00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	ssr00l;
	SFR_UNSIGNED_SHORT_INT	ssr00h;
}SFR_BYTE_SSR00;

typedef union{
	SFR_BYTE_SSR00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSR00;

SFR_GLOBAL	SFR_SSR00	ssr00;

#ifdef __RL78__
#else
	#define	SSR00	(ssr00.ALL)
#endif


/* SSR01L */
#ifdef __RL78__
#else
	#define	SSR01L	(ssr01.BYTE.ssr01l)
#endif

/* SSR01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	ssr01l;
	SFR_UNSIGNED_SHORT_INT	ssr01h;
}SFR_BYTE_SSR01;

typedef union{
	SFR_BYTE_SSR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSR01;

SFR_GLOBAL	SFR_SSR01	ssr01;

#ifdef __RL78__
#else
	#define	SSR01	(ssr01.ALL)
#endif

/* SIR00L */
#ifdef __RL78__
#else
	#define	SIR00L	(sir00.BYTE.sir00l)
#endif

/* SIR00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sir00l;
	SFR_UNSIGNED_SHORT_INT	sir00h;
}SFR_BYTE_SIR00;

typedef union{
	SFR_BYTE_SIR00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SIR00;

SFR_GLOBAL	SFR_SIR00	sir00;

#ifdef __RL78__
#else
	#define	SIR00	(sir00.ALL)
#endif

/* SIR01L */
#ifdef __RL78__
#else
	#define	SIR01L	(sir01.BYTE.sir01l)
#endif

/* SIR01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sir01l;
	SFR_UNSIGNED_SHORT_INT	sir01h;
}SFR_BYTE_SIR01;

typedef union{
	SFR_BYTE_SIR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SIR01;

SFR_GLOBAL	SFR_SIR01	sir01;

#ifdef __RL78__
#else
	#define	SIR01	(sir01.ALL)
#endif

/* SMR00 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT smr00;
#ifdef __RL78__
#else
	#define	SMR00	(smr00)
#endif

/* SMR01 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT smr01;
#ifdef __RL78__
#else
	#define	SMR01	(smr01)
#endif

/* SCR00 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT scr00;
#ifdef __RL78__
#else
	#define	SCR00	(scr00)
#endif

/* SMR01 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT scr01;
#ifdef __RL78__
#else
	#define	SCR01	(scr01)
#endif

/* SE0L */
#ifdef __RL78__
	#define	SE0L_0	(SE0L.0)
	#define	SE0L_1	(SE0L.1)
	#define	SE0L_2	(SE0L.2)
	#define	SE0L_3	(SE0L.3)
	#define	SE0L_4	(SE0L.4)
	#define	SE0L_5	(SE0L.5)
	#define	SE0L_6	(SE0L.6)
	#define	SE0L_7	(SE0L.7)
#else
	#define	SE0L_0			(se0.BIT_NUMBER.bit0)
	#define	SE0L_1			(se0.BIT_NUMBER.bit1)
	#define	SE0L_2			(se0.BIT_NUMBER.bit2)
	#define	SE0L_3			(se0.BIT_NUMBER.bit3)
	#define	SE0L_4			(se0.BIT_NUMBER.bit4)
	#define	SE0L_5			(se0.BIT_NUMBER.bit5)
	#define	SE0L_6			(se0.BIT_NUMBER.bit6)
	#define	SE0L_7			(se0.BIT_NUMBER.bit7)
	#define	SE0L			(se0.BYTE.se0l)
#endif

/* SE0 */
typedef struct{
	SFR_UNSIGNED_CHAR	se0l;
	SFR_UNSIGNED_CHAR	se0h;
}SFR_BYTE_SE0;

typedef union{
	SFR_BYTE_SE0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SE0;

SFR_GLOBAL	SFR_SE0	se0;

#ifdef __RL78__
#else
	#define	SE0	(se0.ALL)
#endif

/* SS0L */
#ifdef __RL78__
	#define	SS0L_0	(SS0L.0)
	#define	SS0L_1	(SS0L.1)
	#define	SS0L_2	(SS0L.2)
	#define	SS0L_3	(SS0L.3)
	#define	SS0L_4	(SS0L.4)
	#define	SS0L_5	(SS0L.5)
	#define	SS0L_6	(SS0L.6)
	#define	SS0L_7	(SS0L.7)
#else
	#define	SS0L_0			(ss0.BIT_NUMBER.bit0)
	#define	SS0L_1			(ss0.BIT_NUMBER.bit1)
	#define	SS0L_2			(ss0.BIT_NUMBER.bit2)
	#define	SS0L_3			(ss0.BIT_NUMBER.bit3)
	#define	SS0L_4			(ss0.BIT_NUMBER.bit4)
	#define	SS0L_5			(ss0.BIT_NUMBER.bit5)
	#define	SS0L_6			(ss0.BIT_NUMBER.bit6)
	#define	SS0L_7			(ss0.BIT_NUMBER.bit7)
	#define	SS0L			(ss0.BYTE.ss0l)
#endif

