turatsamar/DRV8889/src/rl78_ca78k0r.h
/* SS0 */
typedef struct{
	SFR_UNSIGNED_CHAR	ss0l;
	SFR_UNSIGNED_CHAR	ss0h;
}SFR_BYTE_SS0;

typedef union{
	SFR_BYTE_SS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SS0;

SFR_GLOBAL	SFR_SS0	ss0;

#ifdef __RL78__
#else
	#define	SS0	(ss0.ALL)
#endif

/* ST0L */
#ifdef __RL78__
	#define	ST0L_0	(ST0L.0)
	#define	ST0L_1	(ST0L.1)
	#define	ST0L_2	(ST0L.2)
	#define	ST0L_3	(ST0L.3)
	#define	ST0L_4	(ST0L.4)
	#define	ST0L_5	(ST0L.5)
	#define	ST0L_6	(ST0L.6)
	#define	ST0L_7	(ST0L.7)
#else
	#define	ST0L_0			(st0.BIT_NUMBER.bit0)
	#define	ST0L_1			(st0.BIT_NUMBER.bit1)
	#define	ST0L_2			(st0.BIT_NUMBER.bit2)
	#define	ST0L_3			(st0.BIT_NUMBER.bit3)
	#define	ST0L_4			(st0.BIT_NUMBER.bit4)
	#define	ST0L_5			(st0.BIT_NUMBER.bit5)
	#define	ST0L_6			(st0.BIT_NUMBER.bit6)
	#define	ST0L_7			(st0.BIT_NUMBER.bit7)
	#define	ST0L			(st0.BYTE.st0l)
#endif

/* ST0 */
typedef struct{
	SFR_UNSIGNED_CHAR	st0l;
	SFR_UNSIGNED_CHAR	st0h;
}SFR_BYTE_ST0;

typedef union{
	SFR_BYTE_ST0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_ST0;

SFR_GLOBAL	SFR_ST0	st0;

#ifdef __RL78__
#else
	#define	ST0	(st0.ALL)
#endif

/* SPS0L */
#ifdef __RL78__
#else
	#define	SPS0L	(sdr00.BYTE.sps0l)
#endif

/* SPS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sps0l;
	SFR_UNSIGNED_SHORT_INT	sps0h;
}SFR_BYTE_SPS0;

typedef union{
	SFR_BYTE_SPS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SPS0;

SFR_GLOBAL	SFR_SPS0	sps0;

#ifdef __RL78__
#else
	#define	SPS0	(sps0.ALL)
#endif

/* SO0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT so0;
#ifdef __RL78__
#else
	#define	SO0	(so0)
#endif

/* SOE0L */
#ifdef __RL78__
	#define	SOE0L_0	(SOE0L.0)
	#define	SOE0L_1	(SOE0L.1)
	#define	SOE0L_2	(SOE0L.2)
	#define	SOE0L_3	(SOE0L.3)
	#define	SOE0L_4	(SOE0L.4)
	#define	SOE0L_5	(SOE0L.5)
	#define	SOE0L_6	(SOE0L.6)
	#define	SOE0L_7	(SOE0L.7)
#else
	#define	SOE0L_0			(soe0.BIT_NUMBER.bit0)
	#define	SOE0L_1			(soe0.BIT_NUMBER.bit1)
	#define	SOE0L_2			(soe0.BIT_NUMBER.bit2)
	#define	SOE0L_3			(soe0.BIT_NUMBER.bit3)
	#define	SOE0L_4			(soe0.BIT_NUMBER.bit4)
	#define	SOE0L_5			(soe0.BIT_NUMBER.bit5)
	#define	SOE0L_6			(soe0.BIT_NUMBER.bit6)
	#define	SOE0L_7			(soe0.BIT_NUMBER.bit7)
	#define	SOE0L			(soe0.BYTE.soe0l)
#endif

/* SOE0 */
typedef struct{
	SFR_UNSIGNED_CHAR	soe0l;
	SFR_UNSIGNED_CHAR	soe0h;
}SFR_BYTE_SOE0;

typedef union{
	SFR_BYTE_SOE0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SOE0;

SFR_GLOBAL	SFR_SOE0	soe0;

#ifdef __RL78__
#else
	#define	SOE0	(soe0.ALL)
#endif

/* SOL0L */
#ifdef __RL78__
#else
	#define	SOL0L	(sol0.BYTE.sol0l)
#endif

/* SOL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sol0l;
	SFR_UNSIGNED_SHORT_INT	sol0h;
}SFR_BYTE_SOL0;

typedef union{
	SFR_BYTE_SOL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SOL0;

SFR_GLOBAL	SFR_SOL0	sol0;

#ifdef __RL78__
#else
	#define	SOL0	(sol0.ALL)
#endif

/* SSE0L */
#ifdef __RL78__
#else
	#define	SSE0L	(sse0.BYTE.sse0l)
#endif

/* SSE0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sse0l;
	SFR_UNSIGNED_SHORT_INT	sse0h;
}SFR_BYTE_SSE0;

typedef union{
	SFR_BYTE_SSE0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSE0;

SFR_GLOBAL	SFR_SSE0	sse0;

#ifdef __RL78__
#else
	#define	SSE0	(sse0.ALL)
#endif

/* SSR10L */
#ifdef __RL78__
#else
	#define	SSR10L	(ssr10.BYTE.ssr10l)
#endif

/* SSR10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	ssr10l;
	SFR_UNSIGNED_SHORT_INT	ssr10h;
}SFR_BYTE_SSR10;

typedef union{
	SFR_BYTE_SSR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSR10;

SFR_GLOBAL	SFR_SSR10	ssr10;

#ifdef __RL78__
#else
	#define	SSR10	(ssr10.ALL)
#endif

/* SSR11L */
#ifdef __RL78__
#else
	#define	SSR11L	(ssr11.BYTE.ssr11l)
#endif

/* SSR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	ssr11l;
	SFR_UNSIGNED_SHORT_INT	ssr11h;
}SFR_BYTE_SSR11;

typedef union{
	SFR_BYTE_SSR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSR11;

SFR_GLOBAL	SFR_SSR11	ssr11;

#ifdef __RL78__
#else
	#define	SSR11	(ssr11.ALL)
#endif

/* SIR10L */
#ifdef __RL78__
#else
	#define	SIR10L	(sir10.BYTE.sir10l)
#endif

/* SIR10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sir10l;
	SFR_UNSIGNED_SHORT_INT	sir10h;
}SFR_BYTE_SIR10;

typedef union{
	SFR_BYTE_SIR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SIR10;

SFR_GLOBAL	SFR_SIR10	sir10;

#ifdef __RL78__
#else
	#define	SIR10	(sir10.ALL)
#endif

/* SIR11L */
#ifdef __RL78__
#else
	#define	SIR11L	(sir11.BYTE.sir11l)
#endif

/* SIR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sir11l;
	SFR_UNSIGNED_SHORT_INT	sir11h;
}SFR_BYTE_SIR11;

typedef union{
	SFR_BYTE_SIR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SIR11;

SFR_GLOBAL	SFR_SIR11	sir11;

#ifdef __RL78__
#else
	#define	SIR11	(sir11.ALL)
#endif

/*SMR10*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT smr10;
#ifdef __RL78__
#else
	#define	SMR10	(smr10)
#endif

/*SMR11*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT smr11;
#ifdef __RL78__
#else
	#define	SMR11	(smr11)
#endif

/*SCR10*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT scr10;
#ifdef __RL78__
#else
	#define	SCR10	(scr10)
#endif

/*SCR11*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT scr11;
#ifdef __RL78__
#else
	#define	SCR11	(scr11)
#endif

/* SE1L */
#ifdef __RL78__
	#define	SE1L_0	(SE1L.0)
	#define	SE1L_1	(SE1L.1)
	#define	SE1L_2	(SE1L.2)
	#define	SE1L_3	(SE1L.3)
	#define	SE1L_4	(SE1L.4)
	#define	SE1L_5	(SE1L.5)
	#define	SE1L_6	(SE1L.6)
	#define	SE1L_7	(SE1L.7)
#else
	#define	SE1L_0			(se1.BIT_NUMBER.bit0)
	#define	SE1L_1			(se1.BIT_NUMBER.bit1)
	#define	SE1L_2			(se1.BIT_NUMBER.bit2)
	#define	SE1L_3			(se1.BIT_NUMBER.bit3)
	#define	SE1L_4			(se1.BIT_NUMBER.bit4)
	#define	SE1L_5			(se1.BIT_NUMBER.bit5)
	#define	SE1L_6			(se1.BIT_NUMBER.bit6)
	#define	SE1L_7			(se1.BIT_NUMBER.bit7)
	#define	SE1L			(se1.BYTE.se1l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	se1l;
	SFR_UNSIGNED_CHAR	se1h;
}SFR_BYTE_SE1;

typedef union{
	SFR_BYTE_SE1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SE1;

SFR_GLOBAL	SFR_SE1	se1;

#ifdef __RL78__
#else
	#define	SE1	(se1.ALL)
#endif

/* SS1L */
#ifdef __RL78__
	#define	SS1L_0	(SS1L.0)
	#define	SS1L_1	(SS1L.1)
	#define	SS1L_2	(SS1L.2)
	#define	SS1L_3	(SS1L.3)
	#define	SS1L_4	(SS1L.4)
	#define	SS1L_5	(SS1L.5)
	#define	SS1L_6	(SS1L.6)
	#define	SS1L_7	(SS1L.7)
#else
	#define	SS1L_0			(ss1.BIT_NUMBER.bit0)
	#define	SS1L_1			(ss1.BIT_NUMBER.bit1)
	#define	SS1L_2			(ss1.BIT_NUMBER.bit2)
	#define	SS1L_3			(ss1.BIT_NUMBER.bit3)
	#define	SS1L_4			(ss1.BIT_NUMBER.bit4)
	#define	SS1L_5			(ss1.BIT_NUMBER.bit5)
	#define	SS1L_6			(ss1.BIT_NUMBER.bit6)
	#define	SS1L_7			(ss1.BIT_NUMBER.bit7)
	#define	SS1L			(ss1.BYTE.ss1l)
#endif

