turatsamar/DRV8889/src/rl78_ca78k0r.h
typedef struct{
	SFR_UNSIGNED_CHAR	ss1l;
	SFR_UNSIGNED_CHAR	ss1h;
}SFR_BYTE_SS1;

typedef union{
	SFR_BYTE_SS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SS1;

SFR_GLOBAL	SFR_SS1	ss1;

#ifdef __RL78__
#else
	#define	SS1	(ss1.ALL)
#endif

/* ST1L */
#ifdef __RL78__
	#define	ST1L_0	(ST1L.0)
	#define	ST1L_1	(ST1L.1)
	#define	ST1L_2	(ST1L.2)
	#define	ST1L_3	(ST1L.3)
	#define	ST1L_4	(ST1L.4)
	#define	ST1L_5	(ST1L.5)
	#define	ST1L_6	(ST1L.6)
	#define	ST1L_7	(ST1L.7)
#else
	#define	ST1L_0			(st1.BIT_NUMBER.bit0)
	#define	ST1L_1			(st1.BIT_NUMBER.bit1)
	#define	ST1L_2			(st1.BIT_NUMBER.bit2)
	#define	ST1L_3			(st1.BIT_NUMBER.bit3)
	#define	ST1L_4			(st1.BIT_NUMBER.bit4)
	#define	ST1L_5			(st1.BIT_NUMBER.bit5)
	#define	ST1L_6			(st1.BIT_NUMBER.bit6)
	#define	ST1L_7			(st1.BIT_NUMBER.bit7)
	#define	ST1L			(st1.BYTE.st1l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	st1l;
	SFR_UNSIGNED_CHAR	st1h;
}SFR_BYTE_ST1;

typedef union{
	SFR_BYTE_ST1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_ST1;

SFR_GLOBAL	SFR_ST1	st1;

#ifdef __RL78__
#else
	#define	ST1	(st1.ALL)
#endif

/* SPS1L */
#ifdef __RL78__
#else
	#define	SPS1L	(sps1.BYTE.sps1l)
#endif

/* SPS1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sps1l;
	SFR_UNSIGNED_SHORT_INT	sps1h;
}SFR_BYTE_SPS1;

typedef union{
	SFR_BYTE_SPS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SPS1;

SFR_GLOBAL	SFR_SPS1	sps1;

#ifdef __RL78__
#else
	#define	SPS1	(sps1.ALL)
#endif

/* SO1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT so1;
#ifdef __RL78__
#else
	#define	SO1	(so1)
#endif

/* SOE1L */
#ifdef __RL78__
	#define	SOE1L_0	(SOE1L.0)
	#define	SOE1L_1	(SOE1L.1)
	#define	SOE1L_2	(SOE1L.2)
	#define	SOE1L_3	(SOE1L.3)
	#define	SOE1L_4	(SOE1L.4)
	#define	SOE1L_5	(SOE1L.5)
	#define	SOE1L_6	(SOE1L.6)
	#define	SOE1L_7	(SOE1L.7)
#else
	#define	SOE1L_0			(soe1.BIT_NUMBER.bit0)
	#define	SOE1L_1			(soe1.BIT_NUMBER.bit1)
	#define	SOE1L_2			(soe1.BIT_NUMBER.bit2)
	#define	SOE1L_3			(soe1.BIT_NUMBER.bit3)
	#define	SOE1L_4			(soe1.BIT_NUMBER.bit4)
	#define	SOE1L_5			(soe1.BIT_NUMBER.bit5)
	#define	SOE1L_6			(soe1.BIT_NUMBER.bit6)
	#define	SOE1L_7			(soe1.BIT_NUMBER.bit7)
	#define	SOE1L			(soe1.BYTE.soe1l)
#endif

/* SOE1 */
typedef struct{
	SFR_UNSIGNED_CHAR	soe1l;
	SFR_UNSIGNED_CHAR	soe1h;
}SFR_BYTE_SOE1;

typedef union{
	SFR_BYTE_SOE1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SOE1;

SFR_GLOBAL	SFR_SOE1	soe1;

#ifdef __RL78__
#else
	#define	SOE1	(soe1.ALL)
#endif

/* SOL1L */
#ifdef __RL78__
#else
	#define	SOL1L	(sol1.BYTE.sol1l)
#endif

/* SOL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sol1l;
	SFR_UNSIGNED_SHORT_INT	sol1h;
}SFR_BYTE_SOL1;

typedef union{
	SFR_BYTE_SOL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SOL1;

SFR_GLOBAL	SFR_SOL1	sol1;

#ifdef __RL78__
#else
	#define	SOL1	(sol1.ALL)
#endif

/* SSE1L */
#ifdef __RL78__
#else
	#define	SSE1L	(sse1.BYTE.sse1l)
#endif

/* SSE1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	sse1l;
	SFR_UNSIGNED_SHORT_INT	sse1h;
}SFR_BYTE_SSE1;

typedef union{
	SFR_BYTE_SSE1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_SSE1;

SFR_GLOBAL	SFR_SSE1	sse1;

#ifdef __RL78__
#else
	#define	SSE1	(sse1.ALL)
#endif

/* TCR00 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr00;
#ifdef __RL78__
#else
	#define	TCR00	(tcr00)
#endif

/* TCR01 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr01;
#ifdef __RL78__
#else
	#define	TCR01	(tcr01)
#endif

/* TCR02 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr02;
#ifdef __RL78__
#else
	#define	TCR02	(tcr02)
#endif

/* TCR03 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr03;
#ifdef __RL78__
#else
	#define	TCR03	(tcr03)
#endif

/* TCR04 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr04;
#ifdef __RL78__
#else
	#define	TCR04	(tcr04)
#endif

/* TCR05 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr05;
#ifdef __RL78__
#else
	#define	TCR05	(tcr05)
#endif

/* TCR06 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr06;
#ifdef __RL78__
#else
	#define	TCR06	(tcr06)
#endif

/* TCR07 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr07;
#ifdef __RL78__
#else
	#define	TCR07	(tcr07)
#endif

/* TMR00 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr00;
#ifdef __RL78__
#else
	#define	TMR00	(tmr00)
#endif

/* TMR01 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr01;
#ifdef __RL78__
#else
	#define	TMR01	(tmr01)
#endif

/* TMR02 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr02;
#ifdef __RL78__
#else
	#define	TMR02	(tmr02)
#endif

/* TMR03 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr03;
#ifdef __RL78__
#else
	#define	TMR03	(tmr03)
#endif

/* TMR04 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr04;
#ifdef __RL78__
#else
	#define	TMR04	(tmr04)
#endif

/* TMR05 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr05;
#ifdef __RL78__
#else
	#define	TMR05	(tmr05)
#endif

/* TMR06 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr06;
#ifdef __RL78__
#else
	#define	TMR06	(tmr06)
#endif

/* TMR07 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr07;
#ifdef __RL78__
#else
	#define	TMR07	(tmr07)
#endif

/* TSR00L */
#ifdef __RL78__
#else
	#define	TSR00L	(tsr00.BYTE.tsr00l)
#endif

/* TSR00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr00l;
	SFR_UNSIGNED_SHORT_INT	tsr00h;
}SFR_BYTE_TSR00;

typedef union{
	SFR_BYTE_TSR00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR00;

SFR_GLOBAL	SFR_TSR00	tsr00;

#ifdef __RL78__
#else
	#define	TSR00	(tsr00.ALL)
#endif

/* TSR01L */
#ifdef __RL78__
#else
	#define	TSR01L	(tsr01.BYTE.tsr01l)
#endif

/* TSR01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr01l;
	SFR_UNSIGNED_SHORT_INT	tsr01h;
}SFR_BYTE_TSR01;

typedef union{
	SFR_BYTE_TSR01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR01;

SFR_GLOBAL	SFR_TSR01	tsr01;

#ifdef __RL78__
#else
	#define	TSR01	(tsr01.ALL)
#endif

/* TSR02L */
#ifdef __RL78__
#else
	#define	TSR02L	(tsr02.BYTE.tsr02l)
#endif

/* TSR02 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr02l;
	SFR_UNSIGNED_SHORT_INT	tsr02h;
}SFR_BYTE_TSR02;

typedef union{
	SFR_BYTE_TSR02	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR02;

SFR_GLOBAL	SFR_TSR02	tsr02;

#ifdef __RL78__
#else
	#define	TSR02	(tsr02.ALL)
#endif

/* TSR03L */
#ifdef __RL78__
#else
	#define	TSR03L	(tsr03.BYTE.tsr03l)
#endif

/* TSR03 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr03l;
	SFR_UNSIGNED_SHORT_INT	tsr03h;
}SFR_BYTE_TSR03;

typedef union{
	SFR_BYTE_TSR03	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR03;

