turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_TSR03	tsr03;

#ifdef __RL78__
#else
	#define	TSR03	(tsr03.ALL)
#endif

/* TSR04L */
#ifdef __RL78__
#else
	#define	TSR04L	(tsr04.BYTE.tsr04l)
#endif

/* TSR04 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr04l;
	SFR_UNSIGNED_SHORT_INT	tsr04h;
}SFR_BYTE_TSR04;

typedef union{
	SFR_BYTE_TSR04	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR04;

SFR_GLOBAL	SFR_TSR04	tsr04;

#ifdef __RL78__
#else
	#define	TSR04	(tsr04.ALL)
#endif

/* TSR05L */
#ifdef __RL78__
#else
	#define	TSR05L	(tsr05.BYTE.tsr05l)
#endif

/* TSR05 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr05l;
	SFR_UNSIGNED_SHORT_INT	tsr05h;
}SFR_BYTE_TSR05;

typedef union{
	SFR_BYTE_TSR05	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR05;

SFR_GLOBAL	SFR_TSR05	tsr05;

#ifdef __RL78__
#else
	#define	TSR05	(tsr05.ALL)
#endif

/* TSR06L */
#ifdef __RL78__
#else
	#define	TSR06L	(tsr06.BYTE.tsr06l)
#endif

/* TSR06 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr06l;
	SFR_UNSIGNED_SHORT_INT	tsr06h;
}SFR_BYTE_TSR06;

typedef union{
	SFR_BYTE_TSR06	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR06;

SFR_GLOBAL	SFR_TSR06	tsr06;

#ifdef __RL78__
#else
	#define	TSR06	(tsr06.ALL)
#endif

/* TSR07L */
#ifdef __RL78__
#else
	#define	TSR07L	(tsr07.BYTE.tsr07l)
#endif

/* TSR07 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr07l;
	SFR_UNSIGNED_SHORT_INT	tsr07h;
}SFR_BYTE_TSR07;

typedef union{
	SFR_BYTE_TSR07	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR07;

SFR_GLOBAL	SFR_TSR07	tsr07;

#ifdef __RL78__
#else
	#define	TSR07	(tsr07.ALL)
#endif

/* TE0L */
#ifdef __RL78__
	#define	TE0L_0	(TE0L.0)
	#define	TE0L_1	(TE0L.1)
	#define	TE0L_2	(TE0L.2)
	#define	TE0L_3	(TE0L.3)
	#define	TE0L_4	(TE0L.4)
	#define	TE0L_5	(TE0L.5)
	#define	TE0L_6	(TE0L.6)
	#define	TE0L_7	(TE0L.7)
#else
	#define	TE0L_0	(te0.BIT_NUMBER.bit0)
	#define	TE0L_1	(te0.BIT_NUMBER.bit1)
	#define	TE0L_2	(te0.BIT_NUMBER.bit2)
	#define	TE0L_3	(te0.BIT_NUMBER.bit3)
	#define	TE0L_4	(te0.BIT_NUMBER.bit4)
	#define	TE0L_5	(te0.BIT_NUMBER.bit5)
	#define	TE0L_6	(te0.BIT_NUMBER.bit6)
	#define	TE0L_7	(te0.BIT_NUMBER.bit7)
	#define	TE0L	(te0.BYTE.te0l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	te0l;
	SFR_UNSIGNED_CHAR	te0h;
}SFR_BYTE_TE0;

typedef union{
	SFR_BYTE_TE0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TE0;

SFR_GLOBAL	SFR_TE0	te0;

#ifdef __RL78__
#else
	#define	TE0	(te0.ALL)
#endif

/* TS0L */
#ifdef __RL78__
	#define	TS0L_0	(TS0L.0)
	#define	TS0L_1	(TS0L.1)
	#define	TS0L_2	(TS0L.2)
	#define	TS0L_3	(TS0L.3)
	#define	TS0L_4	(TS0L.4)
	#define	TS0L_5	(TS0L.5)
	#define	TS0L_6	(TS0L.6)
	#define	TS0L_7	(TS0L.7)
#else
	#define	TS0L_0	(ts0.BIT_NUMBER.bit0)
	#define	TS0L_1	(ts0.BIT_NUMBER.bit1)
	#define	TS0L_2	(ts0.BIT_NUMBER.bit2)
	#define	TS0L_3	(ts0.BIT_NUMBER.bit3)
	#define	TS0L_4	(ts0.BIT_NUMBER.bit4)
	#define	TS0L_5	(ts0.BIT_NUMBER.bit5)
	#define	TS0L_6	(ts0.BIT_NUMBER.bit6)
	#define	TS0L_7	(ts0.BIT_NUMBER.bit7)
	#define	TS0L	(ts0.BYTE.ts0l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	ts0l;
	SFR_UNSIGNED_CHAR	ts0h;
}SFR_BYTE_TS0;

typedef union{
	SFR_BYTE_TS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TS0;

SFR_GLOBAL	SFR_TS0	ts0;

#ifdef __RL78__
#else
	#define	TS0	(ts0.ALL)
#endif

/* TT0L */
#ifdef __RL78__
	#define	TT0L_0	(TT0L.0)
	#define	TT0L_1	(TT0L.1)
	#define	TT0L_2	(TT0L.2)
	#define	TT0L_3	(TT0L.3)
	#define	TT0L_4	(TT0L.4)
	#define	TT0L_5	(TT0L.5)
	#define	TT0L_6	(TT0L.6)
	#define	TT0L_7	(TT0L.7)
#else
	#define	TT0L_0	(tt0.BIT_NUMBER.bit0)
	#define	TT0L_1	(tt0.BIT_NUMBER.bit1)
	#define	TT0L_2	(tt0.BIT_NUMBER.bit2)
	#define	TT0L_3	(tt0.BIT_NUMBER.bit3)
	#define	TT0L_4	(tt0.BIT_NUMBER.bit4)
	#define	TT0L_5	(tt0.BIT_NUMBER.bit5)
	#define	TT0L_6	(tt0.BIT_NUMBER.bit6)
	#define	TT0L_7	(tt0.BIT_NUMBER.bit7)
	#define	TT0L	(tt0.BYTE.tt0l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	tt0l;
	SFR_UNSIGNED_CHAR	tt0h;
}SFR_BYTE_TT0;

typedef union{
	SFR_BYTE_TT0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TT0;

SFR_GLOBAL	SFR_TT0	tt0;

#ifdef __RL78__
#else
	#define	TT0	(tt0.ALL)
#endif

/* TPS0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tps0;
#ifdef __RL78__
#else
	#define	TPS0	(tps0)
#endif

/* TO0L */
#ifdef __RL78__
#else
	#define	TO0L	(to0.BYTE.to0l)
#endif

/* TO0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	to0l;
	SFR_UNSIGNED_SHORT_INT	to0h;
}SFR_BYTE_TO0;

typedef union{
	SFR_BYTE_TO0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TO0;

SFR_GLOBAL	SFR_TO0	to0;

#ifdef __RL78__
#else
	#define	TO0	(to0.ALL)
#endif

/* TOE0L */
#ifdef __RL78__
	#define	TOE0L_0	(TOE0L.0)
	#define	TOE0L_1	(TOE0L.1)
	#define	TOE0L_2	(TOE0L.2)
	#define	TOE0L_3	(TOE0L.3)
	#define	TOE0L_4	(TOE0L.4)
	#define	TOE0L_5	(TOE0L.5)
	#define	TOE0L_6	(TOE0L.6)
	#define	TOE0L_7	(TOE0L.7)
#else
	#define	TOE0L_0	(toe0.BIT_NUMBER.bit0)
	#define	TOE0L_1	(toe0.BIT_NUMBER.bit1)
	#define	TOE0L_2	(toe0.BIT_NUMBER.bit2)
	#define	TOE0L_3	(toe0.BIT_NUMBER.bit3)
	#define	TOE0L_4	(toe0.BIT_NUMBER.bit4)
	#define	TOE0L_5	(toe0.BIT_NUMBER.bit5)
	#define	TOE0L_6	(toe0.BIT_NUMBER.bit6)
	#define	TOE0L_7	(toe0.BIT_NUMBER.bit7)
	#define	TOE0L	(toe0.BYTE.toe0l)
#endif

typedef struct{
	SFR_UNSIGNED_CHAR	toe0l;
	SFR_UNSIGNED_CHAR	toe0h;
}SFR_BYTE_TOE0;

typedef union{
	SFR_BYTE_TOE0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOE0;

SFR_GLOBAL	SFR_TOE0	toe0;

#ifdef __RL78__
#else
	#define	TOE0	(toe0.ALL)
#endif

/* TOL0L */
#ifdef __RL78__
#else
	#define	TOL0L	(tol0.BYTE.tol0l)
#endif

typedef struct{
	SFR_UNSIGNED_SHORT_INT	tol0l;
	SFR_UNSIGNED_SHORT_INT	tol0h;
}SFR_BYTE_TOL0;

/* TOL0 */
typedef union{
	SFR_BYTE_TOL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOL0;

SFR_GLOBAL	SFR_TOL0	tol0;

#ifdef __RL78__
#else
	#define	TOL0	(tol0.ALL)
#endif

/* TOM0L */
#ifdef __RL78__
#else
	#define	TOM0L	(tom0.BYTE.tom0l)
#endif

/* TOM0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tom0l;
	SFR_UNSIGNED_SHORT_INT	tom0h;
}SFR_BYTE_TOM0;

typedef union{
	SFR_BYTE_TOM0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOM0;

SFR_GLOBAL	SFR_TOM0	tom0;

#ifdef __RL78__
#else
	#define	TOM0	(tom0.ALL)
#endif

/* TCR10 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr10;
#ifdef __RL78__
#else
	#define	TCR10	(tcr10)
#endif

