turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TCR11 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr11;
#ifdef __RL78__
#else
	#define	TCR11	(tcr11)
#endif

/* TCR12 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr12;
#ifdef __RL78__
#else
	#define	TCR12	(tcr12)
#endif

/* TCR13 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr13;
#ifdef __RL78__
#else
	#define	TCR13	(tcr13)
#endif

/* TCR14 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr14;
#ifdef __RL78__
#else
	#define	TCR14	(tcr14)
#endif

/* TCR15 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr15;
#ifdef __RL78__
#else
	#define	TCR15	(tcr15)
#endif

/* TCR16 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr16;
#ifdef __RL78__
#else
	#define	TCR16	(tcr16)
#endif

/* TCR17 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tcr17;
#ifdef __RL78__
#else
	#define	TCR17	(tcr17)
#endif

/* TMR10 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr10;
#ifdef __RL78__
#else
	#define	TMR10	(tmr10)
#endif

/* TMR11 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr11;
#ifdef __RL78__
#else
	#define	TMR11	(tmr11)
#endif

/* TMR12 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr12;
#ifdef __RL78__
#else
	#define	TMR12	(tmr12)
#endif

/* TMR13 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr13;
#ifdef __RL78__
#else
	#define	TMR13	(tmr13)
#endif

/* TMR14 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr14;
#ifdef __RL78__
#else
	#define	TMR14	(tmr14)
#endif

/* TMR15 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr15;
#ifdef __RL78__
#else
	#define	TMR15	(tmr15)
#endif

/* TMR16 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr16;
#ifdef __RL78__
#else
	#define	TMR16	(tmr16)
#endif

/* TMR17 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tmr17;
#ifdef __RL78__
#else
	#define	TMR17	(tmr17)
#endif

/* TSR10L */
#ifdef __RL78__
#else
	#define	TSR10L	(tsr10.BYTE.tsr10l)
#endif

/* TSR10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr10l;
	SFR_UNSIGNED_SHORT_INT	tsr10h;
}SFR_BYTE_TSR10;

typedef union{
	SFR_BYTE_TSR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR10;

SFR_GLOBAL	SFR_TSR10	tsr10;

#ifdef __RL78__
#else
	#define	TSR10	(tsr10.ALL)
#endif

/* TSR11L */
#ifdef __RL78__
#else
	#define	TSR11L	(tsr11.BYTE.tsr11l)
#endif

/* TSR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr11l;
	SFR_UNSIGNED_SHORT_INT	tsr11h;
}SFR_BYTE_TSR11;

typedef union{
	SFR_BYTE_TSR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR11;

SFR_GLOBAL	SFR_TSR11	tsr11;

#ifdef __RL78__
#else
	#define	TSR11	(tsr11.ALL)
#endif

/* TSR12L */
#ifdef __RL78__
#else
	#define	TSR12L	(tsr12.BYTE.tsr12l)
#endif

/* TSR12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr12l;
	SFR_UNSIGNED_SHORT_INT	tsr12h;
}SFR_BYTE_TSR12;

typedef union{
	SFR_BYTE_TSR12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR12;

SFR_GLOBAL	SFR_TSR12	tsr12;

#ifdef __RL78__
#else
	#define	TSR12	(tsr12.ALL)
#endif

/* TSR13L */
#ifdef __RL78__
#else
	#define	TSR13L	(tsr13.BYTE.tsr13l)
#endif

/* TSR13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr13l;
	SFR_UNSIGNED_SHORT_INT	tsr13h;
}SFR_BYTE_TSR13;

typedef union{
	SFR_BYTE_TSR13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR13;

SFR_GLOBAL	SFR_TSR13	tsr13;

#ifdef __RL78__
#else
	#define	TSR13	(tsr13.ALL)
#endif

/* TSR14L */
#ifdef __RL78__
#else
	#define	TSR14L	(tsr14.BYTE.tsr14l)
#endif

/* TSR14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr14l;
	SFR_UNSIGNED_SHORT_INT	tsr14h;
}SFR_BYTE_TSR14;

typedef union{
	SFR_BYTE_TSR14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR14;

SFR_GLOBAL	SFR_TSR14	tsr14;

#ifdef __RL78__
#else
	#define	TSR14	(tsr14.ALL)
#endif

/* TSR15L */
#ifdef __RL78__
#else
	#define	TSR15L	(tsr15.BYTE.tsr15l)
#endif

/* TSR15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr15l;
	SFR_UNSIGNED_SHORT_INT	tsr15h;
}SFR_BYTE_TSR15;

typedef union{
	SFR_BYTE_TSR15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR15;

SFR_GLOBAL	SFR_TSR15	tsr15;

#ifdef __RL78__
#else
	#define	TSR15	(tsr15.ALL)
#endif

/* TSR16L */
#ifdef __RL78__
#else
	#define	TSR16L	(tsr16.BYTE.tsr16l)
#endif

/* TSR16 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr16l;
	SFR_UNSIGNED_SHORT_INT	tsr16h;
}SFR_BYTE_TSR16;

typedef union{
	SFR_BYTE_TSR16	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR16;

SFR_GLOBAL	SFR_TSR16	tsr16;

#ifdef __RL78__
#else
	#define	TSR16	(tsr16.ALL)
#endif

/* TSR17L */
#ifdef __RL78__
#else
	#define	TSR17L	(tsr17.BYTE.tsr17l)
#endif

/* TSR17 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tsr17l;
	SFR_UNSIGNED_SHORT_INT	tsr17h;
}SFR_BYTE_TSR17;

typedef union{
	SFR_BYTE_TSR17	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TSR17;

SFR_GLOBAL	SFR_TSR17	tsr17;

#ifdef __RL78__
#else
	#define	TSR17	(tsr17.ALL)
#endif

/* TE1L */
#ifdef __RL78__
	#define	TE1L_0	(TE1L.0)
	#define	TE1L_1	(TE1L.1)
	#define	TE1L_2	(TE1L.2)
	#define	TE1L_3	(TE1L.3)
	#define	TE1L_4	(TE1L.4)
	#define	TE1L_5	(TE1L.5)
	#define	TE1L_6	(TE1L.6)
	#define	TE1L_7	(TE1L.7)
#else
	#define	TE1L_0	(te1.BIT_NUMBER.bit0)
	#define	TE1L_1	(te1.BIT_NUMBER.bit1)
	#define	TE1L_2	(te1.BIT_NUMBER.bit2)
	#define	TE1L_3	(te1.BIT_NUMBER.bit3)
	#define	TE1L_4	(te1.BIT_NUMBER.bit4)
	#define	TE1L_5	(te1.BIT_NUMBER.bit5)
	#define	TE1L_6	(te1.BIT_NUMBER.bit6)
	#define	TE1L_7	(te1.BIT_NUMBER.bit7)
	#define	TE1L	(te1.BYTE.te1l)
#endif

/* TE1 */
typedef struct{
	SFR_UNSIGNED_CHAR	te1l;
	SFR_UNSIGNED_CHAR	te1h;
}SFR_BYTE_TE1;

typedef union{
	SFR_BYTE_TE1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TE1;

SFR_GLOBAL	SFR_TE1	te1;

#ifdef __RL78__
#else
	#define	TE1	(te1.ALL)
#endif

/* TS1L */
#ifdef __RL78__
	#define	TS1L_0	(TS1L.0)
	#define	TS1L_1	(TS1L.1)
	#define	TS1L_2	(TS1L.2)
	#define	TS1L_3	(TS1L.3)
	#define	TS1L_4	(TS1L.4)
	#define	TS1L_5	(TS1L.5)
	#define	TS1L_6	(TS1L.6)
	#define	TS1L_7	(TS1L.7)
#else
	#define	TS1L_0	(ts1.BIT_NUMBER.bit0)
	#define	TS1L_1	(ts1.BIT_NUMBER.bit1)
	#define	TS1L_2	(ts1.BIT_NUMBER.bit2)
	#define	TS1L_3	(ts1.BIT_NUMBER.bit3)
	#define	TS1L_4	(ts1.BIT_NUMBER.bit4)
	#define	TS1L_5	(ts1.BIT_NUMBER.bit5)
	#define	TS1L_6	(ts1.BIT_NUMBER.bit6)
	#define	TS1L_7	(ts1.BIT_NUMBER.bit7)
	#define	TS1L	(ts1.BYTE.ts1l)
#endif

/* TS1 */
typedef struct{
	SFR_UNSIGNED_CHAR	ts1l;
	SFR_UNSIGNED_CHAR	ts1h;
}SFR_BYTE_TS1;

typedef union{
	SFR_BYTE_TS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TS1;

SFR_GLOBAL	SFR_TS1	ts1;

#ifdef __RL78__
#else
	#define	TS1	(ts1.ALL)
#endif

/* TT1L */
#ifdef __RL78__
	#define	TT1L_0	(TT1L.0)
	#define	TT1L_1	(TT1L.1)
	#define	TT1L_2	(TT1L.2)
	#define	TT1L_3	(TT1L.3)
	#define	TT1L_4	(TT1L.4)
	#define	TT1L_5	(TT1L.5)
	#define	TT1L_6	(TT1L.6)
	#define	TT1L_7	(TT1L.7)
#else
	#define	TT1L_0			(tt1.BIT_NUMBER.bit0)
	#define	TT1L_1			(tt1.BIT_NUMBER.bit1)
	#define	TT1L_2			(tt1.BIT_NUMBER.bit2)
	#define	TT1L_3			(tt1.BIT_NUMBER.bit3)
	#define	TT1L_4			(tt1.BIT_NUMBER.bit4)
	#define	TT1L_5			(tt1.BIT_NUMBER.bit5)
	#define	TT1L_6			(tt1.BIT_NUMBER.bit6)
	#define	TT1L_7			(tt1.BIT_NUMBER.bit7)
	#define	TT1L			(tt1.BYTE.tt1l)
#endif

/* TT1 */
typedef struct{
	SFR_UNSIGNED_CHAR	tt1l;
	SFR_UNSIGNED_CHAR	tt1h;
}SFR_BYTE_TT1;

typedef union{
	SFR_BYTE_TT1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TT1;

SFR_GLOBAL	SFR_TT1	tt1;

#ifdef __RL78__
#else
	#define	TT1	(tt1.ALL)
#endif

/* TPS1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT tps1;
#ifdef __RL78__
#else
	#define	TPS1	(tps1)
#endif

/* TO1L */
#ifdef __RL78__
#else
	#define	TO1L	(to1.BYTE.to1l)
#endif

/* TO1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	to1l;
	SFR_UNSIGNED_SHORT_INT	to1h;
}SFR_BYTE_TO1;

typedef union{
	SFR_BYTE_TO1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TO1;

SFR_GLOBAL	SFR_TO1	to1;

#ifdef __RL78__
#else
	#define	TO1	(to1.ALL)
#endif

/* TOE1L */
#ifdef __RL78__
	#define	TOE1L_0	(TOE1L.0)
	#define	TOE1L_1	(TOE1L.1)
	#define	TOE1L_2	(TOE1L.2)
	#define	TOE1L_3	(TOE1L.3)
	#define	TOE1L_4	(TOE1L.4)
	#define	TOE1L_5	(TOE1L.5)
	#define	TOE1L_6	(TOE1L.6)
	#define	TOE1L_7	(TOE1L.7)
#else
	#define	TOE1L_0	(toe1.BIT_NUMBER.bit0)
	#define	TOE1L_1	(toe1.BIT_NUMBER.bit1)
	#define	TOE1L_2	(toe1.BIT_NUMBER.bit2)
	#define	TOE1L_3	(toe1.BIT_NUMBER.bit3)
	#define	TOE1L_4	(toe1.BIT_NUMBER.bit4)
	#define	TOE1L_5	(toe1.BIT_NUMBER.bit5)
	#define	TOE1L_6	(toe1.BIT_NUMBER.bit6)
	#define	TOE1L_7	(toe1.BIT_NUMBER.bit7)
	#define	TOE1L	(toe1.BYTE.toe1l)
#endif

