turatsamar/DRV8889/src/rl78_ca78k0r.h
typedef struct{
	SFR_UNSIGNED_CHAR	toe1l;
	SFR_UNSIGNED_CHAR	toe1h;
}SFR_BYTE_TOE1;

typedef union{
	SFR_BYTE_TOE1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOE1;

SFR_GLOBAL	SFR_TOE1	toe1;

#ifdef __RL78__
#else
	#define	TOE1	(toe1.ALL)
#endif

/* TOL1L */
#ifdef __RL78__
#else
	#define	TOL1L	(tol1.BYTE.tol1l)
#endif

/* TOL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tol1l;
	SFR_UNSIGNED_SHORT_INT	tol1h;
}SFR_BYTE_TOL1;

typedef union{
	SFR_BYTE_TOL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOL1;

SFR_GLOBAL	SFR_TOL1	tol1;

#ifdef __RL78__
#else
	#define	TOL1	(tol1.ALL)
#endif

/* TOM1L */
#ifdef __RL78__
#else
	#define	TOM1L	(tom1.BYTE.tom1l)
#endif

/* TOM1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tom1l;
	SFR_UNSIGNED_SHORT_INT	tom1h;
}SFR_BYTE_TOM1;

typedef union{
	SFR_BYTE_TOM1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TOM1;

SFR_GLOBAL	SFR_TOM1	tom1;

#ifdef __RL78__
#else
	#define	TOM1	(tom1.ALL)
#endif

/* ERADR */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT eradr;
#ifdef __RL78__
#else
	#define	ERADR	(eradr)
#endif

/* ECCIER */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	eccier;

#ifdef __RL78__
#else
	#define	ECCIER	(eccier)
#endif

/* ECCER */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	eccer;

#ifdef __RL78__
#else
	#define	ECCER	(eccer)
#endif

/* ECCTPR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ecctpr;

#ifdef __RL78__
#else
	#define	ECCTPR	(ecctpr)
#endif

/* ECCTMDR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ecctmdr;

#ifdef __RL78__
#else
	#define	ECCTMDR	(ecctmdr)
#endif

/* ECCDWRVR */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT eccdwrvr;
#ifdef __RL78__
#else
	#define	ECCDWRVR	(eccdwrvr)
#endif

/* PSRSEL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PSRSEL;

SFR_GLOBAL	SFR_PSRSEL	psrsel;

#ifdef __RL78__
	#define	PSRSEL_0	(PSRSEL.0)
	#define	PSRSEL_1	(PSRSEL.1)
	#define	PSRSEL_2	(PSRSEL.2)
	#define	PSRSEL_3	(PSRSEL.3)
	#define	PSRSEL_4	(PSRSEL.4)
	#define	PSRSEL_5	(PSRSEL.5)
	#define	PSRSEL_6	(PSRSEL.6)
	#define	PSRSEL_7	(PSRSEL.7)
#else
	#define	PSRSEL_0	(psrsel.BIT_NUMBER.bit0)
	#define	PSRSEL_1	(psrsel.BIT_NUMBER.bit1)
	#define	PSRSEL_2	(psrsel.BIT_NUMBER.bit2)
	#define	PSRSEL_3	(psrsel.BIT_NUMBER.bit3)
	#define	PSRSEL_4	(psrsel.BIT_NUMBER.bit4)
	#define	PSRSEL_5	(psrsel.BIT_NUMBER.bit5)
	#define	PSRSEL_6	(psrsel.BIT_NUMBER.bit6)
	#define	PSRSEL_7	(psrsel.BIT_NUMBER.bit7)
	#define	PSRSEL		(psrsel.ALL)
#endif

/* PSNZCNT0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PSNZCNT0;

SFR_GLOBAL	SFR_PSNZCNT0	psnzcnt0;

#ifdef __RL78__
	#define	PSNZCNT0_0	(PSNZCNT0.0)
	#define	PSNZCNT0_1	(PSNZCNT0.1)
	#define	PSNZCNT0_2	(PSNZCNT0.2)
	#define	PSNZCNT0_3	(PSNZCNT0.3)
	#define	PSNZCNT0_4	(PSNZCNT0.4)
	#define	PSNZCNT0_5	(PSNZCNT0.5)
	#define	PSNZCNT0_6	(PSNZCNT0.6)
	#define	PSNZCNT0_7	(PSNZCNT0.7)
#else
	#define	PSNZCNT0_0	(psnzcnt0.BIT_NUMBER.bit0)
	#define	PSNZCNT0_1	(psnzcnt0.BIT_NUMBER.bit1)
	#define	PSNZCNT0_2	(psnzcnt0.BIT_NUMBER.bit2)
	#define	PSNZCNT0_3	(psnzcnt0.BIT_NUMBER.bit3)
	#define	PSNZCNT0_4	(psnzcnt0.BIT_NUMBER.bit4)
	#define	PSNZCNT0_5	(psnzcnt0.BIT_NUMBER.bit5)
	#define	PSNZCNT0_6	(psnzcnt0.BIT_NUMBER.bit6)
	#define	PSNZCNT0_7	(psnzcnt0.BIT_NUMBER.bit7)
	#define	PSNZCNT0	(psnzcnt0.ALL)
#endif

/* PSNZCNT1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PSNZCNT1;

SFR_GLOBAL	SFR_PSNZCNT1	psnzcnt1;

#ifdef __RL78__
	#define	PSNZCNT1_0	(PSNZCNT1.0)
	#define	PSNZCNT1_1	(PSNZCNT1.1)
	#define	PSNZCNT1_2	(PSNZCNT1.2)
	#define	PSNZCNT1_3	(PSNZCNT1.3)
	#define	PSNZCNT1_4	(PSNZCNT1.4)
	#define	PSNZCNT1_5	(PSNZCNT1.5)
	#define	PSNZCNT1_6	(PSNZCNT1.6)
	#define	PSNZCNT1_7	(PSNZCNT1.7)
#else
	#define	PSNZCNT1_0	(psnzcnt1.BIT_NUMBER.bit0)
	#define	PSNZCNT1_1	(psnzcnt1.BIT_NUMBER.bit1)
	#define	PSNZCNT1_2	(psnzcnt1.BIT_NUMBER.bit2)
	#define	PSNZCNT1_3	(psnzcnt1.BIT_NUMBER.bit3)
	#define	PSNZCNT1_4	(psnzcnt1.BIT_NUMBER.bit4)
	#define	PSNZCNT1_5	(psnzcnt1.BIT_NUMBER.bit5)
	#define	PSNZCNT1_6	(psnzcnt1.BIT_NUMBER.bit6)
	#define	PSNZCNT1_7	(psnzcnt1.BIT_NUMBER.bit7)
	#define	PSNZCNT1	(psnzcnt1.ALL)
#endif

/* PSNZCNT2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PSNZCNT2;

SFR_GLOBAL	SFR_PSNZCNT2	psnzcnt2;

#ifdef __RL78__
	#define	PSNZCNT2_0	(PSNZCNT2.0)
	#define	PSNZCNT2_1	(PSNZCNT2.1)
	#define	PSNZCNT2_2	(PSNZCNT2.2)
	#define	PSNZCNT2_3	(PSNZCNT2.3)
	#define	PSNZCNT2_4	(PSNZCNT2.4)
	#define	PSNZCNT2_5	(PSNZCNT2.5)
	#define	PSNZCNT2_6	(PSNZCNT2.6)
	#define	PSNZCNT2_7	(PSNZCNT2.7)
#else
	#define	PSNZCNT2_0	(psnzcnt2.BIT_NUMBER.bit0)
	#define	PSNZCNT2_1	(psnzcnt2.BIT_NUMBER.bit1)
	#define	PSNZCNT2_2	(psnzcnt2.BIT_NUMBER.bit2)
	#define	PSNZCNT2_3	(psnzcnt2.BIT_NUMBER.bit3)
	#define	PSNZCNT2_4	(psnzcnt2.BIT_NUMBER.bit4)
	#define	PSNZCNT2_5	(psnzcnt2.BIT_NUMBER.bit5)
	#define	PSNZCNT2_6	(psnzcnt2.BIT_NUMBER.bit6)
	#define	PSNZCNT2_7	(psnzcnt2.BIT_NUMBER.bit7)
	#define	PSNZCNT2	(psnzcnt2.ALL)
#endif

/* PSNZCNT3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PSNZCNT3;

SFR_GLOBAL	SFR_PSNZCNT3	psnzcnt3;

#ifdef __RL78__
	#define	PSNZCNT3_0	(PSNZCNT3.0)
	#define	PSNZCNT3_1	(PSNZCNT3.1)
	#define	PSNZCNT3_2	(PSNZCNT3.2)
	#define	PSNZCNT3_3	(PSNZCNT3.3)
	#define	PSNZCNT3_4	(PSNZCNT3.4)
	#define	PSNZCNT3_5	(PSNZCNT3.5)
	#define	PSNZCNT3_6	(PSNZCNT3.6)
	#define	PSNZCNT3_7	(PSNZCNT3.7)
#else
	#define	PSNZCNT3_0	(psnzcnt3.BIT_NUMBER.bit0)
	#define	PSNZCNT3_1	(psnzcnt3.BIT_NUMBER.bit1)
	#define	PSNZCNT3_2	(psnzcnt3.BIT_NUMBER.bit2)
	#define	PSNZCNT3_3	(psnzcnt3.BIT_NUMBER.bit3)
	#define	PSNZCNT3_4	(psnzcnt3.BIT_NUMBER.bit4)
	#define	PSNZCNT3_5	(psnzcnt3.BIT_NUMBER.bit5)
	#define	PSNZCNT3_6	(psnzcnt3.BIT_NUMBER.bit6)
	#define	PSNZCNT3_7	(psnzcnt3.BIT_NUMBER.bit7)
	#define	PSNZCNT3	(psnzcnt3.ALL)
#endif

/* DAM2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DAM2;

SFR_GLOBAL	SFR_DAM2	dam2;

#ifdef __RL78__
	#define	DAM2_0	(DAM2.0)
	#define	DAM2_1	(DAM2.1)
	#define	DAM2_2	(DAM2.2)
	#define	DAM2_3	(DAM2.3)
	#define	DAM2_4	(DAM2.4)
	#define	DAM2_5	(DAM2.5)
	#define	DAM2_6	(DAM2.6)
	#define	DAM2_7	(DAM2.7)
#else
	#define	ANO0EN	(dam2.BIT_NUMBER.bit0)
	#define	DAM2_0	(dam2.BIT_NUMBER.bit0)
	#define	DAM2_1	(dam2.BIT_NUMBER.bit1)
	#define	DAM2_2	(dam2.BIT_NUMBER.bit2)
	#define	DAM2_3	(dam2.BIT_NUMBER.bit3)
	#define	DAM2_4	(dam2.BIT_NUMBER.bit4)
	#define	DAM2_5	(dam2.BIT_NUMBER.bit5)
	#define	DAM2_6	(dam2.BIT_NUMBER.bit6)
	#define	DAM2_7	(dam2.BIT_NUMBER.bit7)
	#define	DAM2	(dam2.ALL)
#endif

