turatsamar/DRV8889/src/rl78_ca78k0r.h
/* PWMDLY0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT pwmdly0;
#ifdef __RL78__
#else
	#define	PWMDLY0	(pwmdly0)
#endif

/* PWMDLY1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT pwmdly1;
#ifdef __RL78__
#else
	#define	PWMDLY1	(pwmdly1)
#endif

/* PWMDLY2 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT pwmdly2;
#ifdef __RL78__
#else
	#define	PWMDLY2	(pwmdly2)
#endif

/* IICCTL00 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_IICCTL00;

SFR_GLOBAL	SFR_IICCTL00	iicctl00;

#ifdef __RL78__
	#define	IICCTL00_0	(IICCTL00.0)
	#define	IICCTL00_1	(IICCTL00.1)
	#define	IICCTL00_2	(IICCTL00.2)
	#define	IICCTL00_3	(IICCTL00.3)
	#define	IICCTL00_4	(IICCTL00.4)
	#define	IICCTL00_5	(IICCTL00.5)
	#define	IICCTL00_6	(IICCTL00.6)
	#define	IICCTL00_7	(IICCTL00.7)
#else
	#define	SPT0		(iicctl00.BIT_NUMBER.bit0)
	#define	STT0		(iicctl00.BIT_NUMBER.bit1)
	#define	ACKE0		(iicctl00.BIT_NUMBER.bit2)
	#define	WTIM0		(iicctl00.BIT_NUMBER.bit3)
	#define	SPIE0		(iicctl00.BIT_NUMBER.bit4)
	#define	WREL0		(iicctl00.BIT_NUMBER.bit5)
	#define	LREL0		(iicctl00.BIT_NUMBER.bit6)
	#define	IICE0		(iicctl00.BIT_NUMBER.bit7)
	#define	IICCTL00_0	(iicctl00.BIT_NUMBER.bit0)
	#define	IICCTL00_1	(iicctl00.BIT_NUMBER.bit1)
	#define	IICCTL00_2	(iicctl00.BIT_NUMBER.bit2)
	#define	IICCTL00_3	(iicctl00.BIT_NUMBER.bit3)
	#define	IICCTL00_4	(iicctl00.BIT_NUMBER.bit4)
	#define	IICCTL00_5	(iicctl00.BIT_NUMBER.bit5)
	#define	IICCTL00_6	(iicctl00.BIT_NUMBER.bit6)
	#define	IICCTL00_7	(iicctl00.BIT_NUMBER.bit7)
	#define	IICCTL00	(iicctl00.ALL)
#endif

/* IICCTL01 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_IICCTL01;

SFR_GLOBAL	SFR_IICCTL01	iicctl01;

#ifdef __RL78__
	#define	IICCTL01_0	(IICCTL01.0)
	#define	IICCTL01_1	(IICCTL01.1)
	#define	IICCTL01_2	(IICCTL01.2)
	#define	IICCTL01_3	(IICCTL01.3)
	#define	IICCTL01_4	(IICCTL01.4)
	#define	IICCTL01_5	(IICCTL01.5)
	#define	IICCTL01_6	(IICCTL01.6)
	#define	IICCTL01_7	(IICCTL01.7)
#else
	#define	PRS0	(iicctl01.BIT_NUMBER.bit0)
	#define	DFC0	(iicctl01.BIT_NUMBER.bit2)
	#define	SMC0	(iicctl01.BIT_NUMBER.bit3)
	#define	DAD0	(iicctl01.BIT_NUMBER.bit4)
	#define	CLD0	(iicctl01.BIT_NUMBER.bit5)
	#define	WUP0	(iicctl01.BIT_NUMBER.bit7)
	#define	IICCTL01_0	(iicctl01.BIT_NUMBER.bit0)
	#define	IICCTL01_1	(iicctl01.BIT_NUMBER.bit1)
	#define	IICCTL01_2	(iicctl01.BIT_NUMBER.bit2)
	#define	IICCTL01_3	(iicctl01.BIT_NUMBER.bit3)
	#define	IICCTL01_4	(iicctl01.BIT_NUMBER.bit4)
	#define	IICCTL01_5	(iicctl01.BIT_NUMBER.bit5)
	#define	IICCTL01_6	(iicctl01.BIT_NUMBER.bit6)
	#define	IICCTL01_7	(iicctl01.BIT_NUMBER.bit7)
	#define	IICCTL01	(iicctl01.ALL)
#endif

/* IICWL0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	iicwl0;

#ifdef __RL78__
#else
	#define	IICWL0	(iicwl0)
#endif

/* IICWH0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	iicwh0;

#ifdef __RL78__
#else
	#define	IICWH0	(iicwh0)
#endif

/* SVA0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	sva0;

#ifdef __RL78__
#else
	#define	SVA0	(sva0)
#endif

/* TRJCR0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	trjcr0;

#ifdef __RL78__
#else
	#define	TRJCR0	(trjcr0)
#endif

/* TRJIOC0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRJIOC0;

SFR_GLOBAL	SFR_TRJIOC0	trjioc0;

#ifdef __RL78__
	#define	TRJIOC0_0	(TRJIOC0.0)
	#define	TRJIOC0_1	(TRJIOC0.1)
	#define	TRJIOC0_2	(TRJIOC0.2)
	#define	TRJIOC0_3	(TRJIOC0.3)
	#define	TRJIOC0_4	(TRJIOC0.4)
	#define	TRJIOC0_5	(TRJIOC0.5)
	#define	TRJIOC0_6	(TRJIOC0.6)
	#define	TRJIOC0_7	(TRJIOC0.7)
#else
	#define	TRJIOC0_0	(trjioc0.BIT_NUMBER.bit0)
	#define	TRJIOC0_1	(trjioc0.BIT_NUMBER.bit1)
	#define	TRJIOC0_2	(trjioc0.BIT_NUMBER.bit2)
	#define	TRJIOC0_3	(trjioc0.BIT_NUMBER.bit3)
	#define	TRJIOC0_4	(trjioc0.BIT_NUMBER.bit4)
	#define	TRJIOC0_5	(trjioc0.BIT_NUMBER.bit5)
	#define	TRJIOC0_6	(trjioc0.BIT_NUMBER.bit6)
	#define	TRJIOC0_7	(trjioc0.BIT_NUMBER.bit7)
	#define	TRJIOC0		(trjioc0.ALL)
#endif

/* TRJMR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRJMR0;

SFR_GLOBAL	SFR_TRJMR0	trjmr0;

#ifdef __RL78__
	#define	TRJMR0_0	(TRJMR0.0)
	#define	TRJMR0_1	(TRJMR0.1)
	#define	TRJMR0_2	(TRJMR0.2)
	#define	TRJMR0_3	(TRJMR0.3)
	#define	TRJMR0_4	(TRJMR0.4)
	#define	TRJMR0_5	(TRJMR0.5)
	#define	TRJMR0_6	(TRJMR0.6)
	#define	TRJMR0_7	(TRJMR0.7)
#else
	#define	TRJMR0_0	(trjmr0.BIT_NUMBER.bit0)
	#define	TRJMR0_1	(trjmr0.BIT_NUMBER.bit1)
	#define	TRJMR0_2	(trjmr0.BIT_NUMBER.bit2)
	#define	TRJMR0_3	(trjmr0.BIT_NUMBER.bit3)
	#define	TRJMR0_4	(trjmr0.BIT_NUMBER.bit4)
	#define	TRJMR0_5	(trjmr0.BIT_NUMBER.bit5)
	#define	TRJMR0_6	(trjmr0.BIT_NUMBER.bit6)
	#define	TRJMR0_7	(trjmr0.BIT_NUMBER.bit7)
	#define	TRJMR0		(trjmr0.ALL)
#endif

/* TRJSR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRJSR0;

SFR_GLOBAL	SFR_TRJSR0	trjsr0;

#ifdef __RL78__
	#define	TRJSR0_0	(TRJSR0.0)
	#define	TRJSR0_1	(TRJSR0.1)
	#define	TRJSR0_2	(TRJSR0.2)
	#define	TRJSR0_3	(TRJSR0.3)
	#define	TRJSR0_4	(TRJSR0.4)
	#define	TRJSR0_5	(TRJSR0.5)
	#define	TRJSR0_6	(TRJSR0.6)
	#define	TRJSR0_7	(TRJSR0.7)
#else
	#define	TRJSR0_0	(trjsr0.BIT_NUMBER.bit0)
	#define	TRJSR0_1	(trjsr0.BIT_NUMBER.bit1)
	#define	TRJSR0_2	(trjsr0.BIT_NUMBER.bit2)
	#define	TRJSR0_3	(trjsr0.BIT_NUMBER.bit3)
	#define	TRJSR0_4	(trjsr0.BIT_NUMBER.bit4)
	#define	TRJSR0_5	(trjsr0.BIT_NUMBER.bit5)
	#define	TRJSR0_6	(trjsr0.BIT_NUMBER.bit6)
	#define	TRJSR0_7	(trjsr0.BIT_NUMBER.bit7)
	#define	TRJSR0		(trjsr0.ALL)
#endif

/* TRDELC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDELC;

SFR_GLOBAL	SFR_TRDELC	trdelc;

#ifdef __RL78__
	#define	TRDELC_0	(TRDELC.0)
	#define	TRDELC_1	(TRDELC.1)
	#define	TRDELC_2	(TRDELC.2)
	#define	TRDELC_3	(TRDELC.3)
	#define	TRDELC_4	(TRDELC.4)
	#define	TRDELC_5	(TRDELC.5)
	#define	TRDELC_6	(TRDELC.6)
	#define	TRDELC_7	(TRDELC.7)
#else
	#define	TRDELC_0	(trdelc.BIT_NUMBER.bit0)
	#define	TRDELC_1	(trdelc.BIT_NUMBER.bit1)
	#define	TRDELC_2	(trdelc.BIT_NUMBER.bit2)
	#define	TRDELC_3	(trdelc.BIT_NUMBER.bit3)
	#define	TRDELC_4	(trdelc.BIT_NUMBER.bit4)
	#define	TRDELC_5	(trdelc.BIT_NUMBER.bit5)
	#define	TRDELC_6	(trdelc.BIT_NUMBER.bit6)
	#define	TRDELC_7	(trdelc.BIT_NUMBER.bit7)
	#define	TRDELC		(trdelc.ALL)
#endif

