turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TRDSTR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	trdstr;

#ifdef __RL78__
#else
	#define	TRDSTR	(trdstr)
#endif

/* TRDMR */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDMR;

SFR_GLOBAL	SFR_TRDMR	trdmr;

#ifdef __RL78__
	#define	TRDMR_0	(TRDMR.0)
	#define	TRDMR_1	(TRDMR.1)
	#define	TRDMR_2	(TRDMR.2)
	#define	TRDMR_3	(TRDMR.3)
	#define	TRDMR_4	(TRDMR.4)
	#define	TRDMR_5	(TRDMR.5)
	#define	TRDMR_6	(TRDMR.6)
	#define	TRDMR_7	(TRDMR.7)
#else
	#define	TRDSYNC	(trdmr.BIT_NUMBER.bit0)
	#define	TRDBFC0	(trdmr.BIT_NUMBER.bit4)
	#define	TRDBFD0	(trdmr.BIT_NUMBER.bit5)
	#define	TRDBFC1	(trdmr.BIT_NUMBER.bit6)
	#define	TRDBFD1	(trdmr.BIT_NUMBER.bit7)
	#define	TRDMR_0	(trdmr.BIT_NUMBER.bit0)
	#define	TRDMR_1	(trdmr.BIT_NUMBER.bit1)
	#define	TRDMR_2	(trdmr.BIT_NUMBER.bit2)
	#define	TRDMR_3	(trdmr.BIT_NUMBER.bit3)
	#define	TRDMR_4	(trdmr.BIT_NUMBER.bit4)
	#define	TRDMR_5	(trdmr.BIT_NUMBER.bit5)
	#define	TRDMR_6	(trdmr.BIT_NUMBER.bit6)
	#define	TRDMR_7	(trdmr.BIT_NUMBER.bit7)
	#define	TRDMR	(trdmr.ALL)
#endif

/* TRDPMR */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDPMR;

SFR_GLOBAL	SFR_TRDPMR	trdpmr;

#ifdef __RL78__
	#define	TRDPMR_0	(TRDPMR.0)
	#define	TRDPMR_1	(TRDPMR.1)
	#define	TRDPMR_2	(TRDPMR.2)
	#define	TRDPMR_3	(TRDPMR.3)
	#define	TRDPMR_4	(TRDPMR.4)
	#define	TRDPMR_5	(TRDPMR.5)
	#define	TRDPMR_6	(TRDPMR.6)
	#define	TRDPMR_7	(TRDPMR.7)
#else
	#define	TRDPWMB0	(trdpmr.BIT_NUMBER.bit0)
	#define	TRDPWMC0	(trdpmr.BIT_NUMBER.bit1)
	#define	TRDPWMD0	(trdpmr.BIT_NUMBER.bit2)
	#define	TRDPWMB1	(trdpmr.BIT_NUMBER.bit4)
	#define	TRDPWMC1	(trdpmr.BIT_NUMBER.bit5)
	#define	TRDPWMD1	(trdpmr.BIT_NUMBER.bit6)
	#define	TRDPMR_0	(trdpmr.BIT_NUMBER.bit0)
	#define	TRDPMR_1	(trdpmr.BIT_NUMBER.bit1)
	#define	TRDPMR_2	(trdpmr.BIT_NUMBER.bit2)
	#define	TRDPMR_3	(trdpmr.BIT_NUMBER.bit3)
	#define	TRDPMR_4	(trdpmr.BIT_NUMBER.bit4)
	#define	TRDPMR_5	(trdpmr.BIT_NUMBER.bit5)
	#define	TRDPMR_6	(trdpmr.BIT_NUMBER.bit6)
	#define	TRDPMR_7	(trdpmr.BIT_NUMBER.bit7)
	#define	TRDPMR		(trdpmr.ALL)
#endif

/* TRDFCR */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDFCR;

SFR_GLOBAL	SFR_TRDFCR	trdfcr;

#ifdef __RL78__
	#define	TRDFCR_0	(TRDFCR.0)
	#define	TRDFCR_1	(TRDFCR.1)
	#define	TRDFCR_2	(TRDFCR.2)
	#define	TRDFCR_3	(TRDFCR.3)
	#define	TRDFCR_4	(TRDFCR.4)
	#define	TRDFCR_5	(TRDFCR.5)
	#define	TRDFCR_6	(TRDFCR.6)
	#define	TRDFCR_7	(TRDFCR.7)
#else
	#define	TRDFCR_0	(trdfcr.BIT_NUMBER.bit0)
	#define	TRDFCR_1	(trdfcr.BIT_NUMBER.bit1)
	#define	TRDFCR_2	(trdfcr.BIT_NUMBER.bit2)
	#define	TRDFCR_3	(trdfcr.BIT_NUMBER.bit3)
	#define	TRDFCR_4	(trdfcr.BIT_NUMBER.bit4)
	#define	TRDFCR_5	(trdfcr.BIT_NUMBER.bit5)
	#define	TRDFCR_6	(trdfcr.BIT_NUMBER.bit6)
	#define	TRDFCR_7	(trdfcr.BIT_NUMBER.bit7)
	#define	TRDFCR		(trdfcr.ALL)
#endif

/* TRDOER1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDOER1;

SFR_GLOBAL	SFR_TRDOER1	trdoer1;

#ifdef __RL78__
	#define	TRDOER1_0	(TRDOER1.0)
	#define	TRDOER1_1	(TRDOER1.1)
	#define	TRDOER1_2	(TRDOER1.2)
	#define	TRDOER1_3	(TRDOER1.3)
	#define	TRDOER1_4	(TRDOER1.4)
	#define	TRDOER1_5	(TRDOER1.5)
	#define	TRDOER1_6	(TRDOER1.6)
	#define	TRDOER1_7	(TRDOER1.7)
#else
	#define	TRDOER1_0	(trdoer1.BIT_NUMBER.bit0)
	#define	TRDOER1_1	(trdoer1.BIT_NUMBER.bit1)
	#define	TRDOER1_2	(trdoer1.BIT_NUMBER.bit2)
	#define	TRDOER1_3	(trdoer1.BIT_NUMBER.bit3)
	#define	TRDOER1_4	(trdoer1.BIT_NUMBER.bit4)
	#define	TRDOER1_5	(trdoer1.BIT_NUMBER.bit5)
	#define	TRDOER1_6	(trdoer1.BIT_NUMBER.bit6)
	#define	TRDOER1_7	(trdoer1.BIT_NUMBER.bit7)
	#define	TRDOER1		(trdoer1.ALL)
#endif

/* TRDOER2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDOER2;

SFR_GLOBAL	SFR_TRDOER2	trdoer2;

#ifdef __RL78__
	#define	TRDOER2_0	(TRDOER2.0)
	#define	TRDOER2_1	(TRDOER2.1)
	#define	TRDOER2_2	(TRDOER2.2)
	#define	TRDOER2_3	(TRDOER2.3)
	#define	TRDOER2_4	(TRDOER2.4)
	#define	TRDOER2_5	(TRDOER2.5)
	#define	TRDOER2_6	(TRDOER2.6)
	#define	TRDOER2_7	(TRDOER2.7)
#else
	#define	TRDSHUTS	(trdoer2.BIT_NUMBER.bit0)
	#define	TRDPTO		(trdoer2.BIT_NUMBER.bit7)
	#define	TRDOER2_0	(trdoer2.BIT_NUMBER.bit0)
	#define	TRDOER2_1	(trdoer2.BIT_NUMBER.bit1)
	#define	TRDOER2_2	(trdoer2.BIT_NUMBER.bit2)
	#define	TRDOER2_3	(trdoer2.BIT_NUMBER.bit3)
	#define	TRDOER2_4	(trdoer2.BIT_NUMBER.bit4)
	#define	TRDOER2_5	(trdoer2.BIT_NUMBER.bit5)
	#define	TRDOER2_6	(trdoer2.BIT_NUMBER.bit6)
	#define	TRDOER2_7	(trdoer2.BIT_NUMBER.bit7)
	#define	TRDOER2		(trdoer2.ALL)
#endif

/* TRDOCR */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDOCR;

SFR_GLOBAL	SFR_TRDOCR	trdocr;

#ifdef __RL78__
	#define	TRDOCR_0	(TRDOCR.0)
	#define	TRDOCR_1	(TRDOCR.1)
	#define	TRDOCR_2	(TRDOCR.2)
	#define	TRDOCR_3	(TRDOCR.3)
	#define	TRDOCR_4	(TRDOCR.4)
	#define	TRDOCR_5	(TRDOCR.5)
	#define	TRDOCR_6	(TRDOCR.6)
	#define	TRDOCR_7	(TRDOCR.7)
#else
	#define	TRDOCR_0	(trdocr.BIT_NUMBER.bit0)
	#define	TRDOCR_1	(trdocr.BIT_NUMBER.bit1)
	#define	TRDOCR_2	(trdocr.BIT_NUMBER.bit2)
	#define	TRDOCR_3	(trdocr.BIT_NUMBER.bit3)
	#define	TRDOCR_4	(trdocr.BIT_NUMBER.bit4)
	#define	TRDOCR_5	(trdocr.BIT_NUMBER.bit5)
	#define	TRDOCR_6	(trdocr.BIT_NUMBER.bit6)
	#define	TRDOCR_7	(trdocr.BIT_NUMBER.bit7)
	#define	TRDOCR		(trdocr.ALL)
#endif

/* TRDDF0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDDF0;

SFR_GLOBAL	SFR_TRDDF0	trddf0;

#ifdef __RL78__
	#define	TRDDF0_0	(TRDDF0.0)
	#define	TRDDF0_1	(TRDDF0.1)
	#define	TRDDF0_2	(TRDDF0.2)
	#define	TRDDF0_3	(TRDDF0.3)
	#define	TRDDF0_4	(TRDDF0.4)
	#define	TRDDF0_5	(TRDDF0.5)
	#define	TRDDF0_6	(TRDDF0.6)
	#define	TRDDF0_7	(TRDDF0.7)
#else
	#define	TRDDF0_0	(trddf0.BIT_NUMBER.bit0)
	#define	TRDDF0_1	(trddf0.BIT_NUMBER.bit1)
	#define	TRDDF0_2	(trddf0.BIT_NUMBER.bit2)
	#define	TRDDF0_3	(trddf0.BIT_NUMBER.bit3)
	#define	TRDDF0_4	(trddf0.BIT_NUMBER.bit4)
	#define	TRDDF0_5	(trddf0.BIT_NUMBER.bit5)
	#define	TRDDF0_6	(trddf0.BIT_NUMBER.bit6)
	#define	TRDDF0_7	(trddf0.BIT_NUMBER.bit7)
	#define	TRDDF0		(trddf0.ALL)
#endif

