turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TRDDF1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDDF1;

SFR_GLOBAL	SFR_TRDDF1	trddf1;

#ifdef __RL78__
	#define	TRDDF1_0	(TRDDF1.0)
	#define	TRDDF1_1	(TRDDF1.1)
	#define	TRDDF1_2	(TRDDF1.2)
	#define	TRDDF1_3	(TRDDF1.3)
	#define	TRDDF1_4	(TRDDF1.4)
	#define	TRDDF1_5	(TRDDF1.5)
	#define	TRDDF1_6	(TRDDF1.6)
	#define	TRDDF1_7	(TRDDF1.7)
#else
	#define	TRDDF1_0	(trddf1.BIT_NUMBER.bit0)
	#define	TRDDF1_1	(trddf1.BIT_NUMBER.bit1)
	#define	TRDDF1_2	(trddf1.BIT_NUMBER.bit2)
	#define	TRDDF1_3	(trddf1.BIT_NUMBER.bit3)
	#define	TRDDF1_4	(trddf1.BIT_NUMBER.bit4)
	#define	TRDDF1_5	(trddf1.BIT_NUMBER.bit5)
	#define	TRDDF1_6	(trddf1.BIT_NUMBER.bit6)
	#define	TRDDF1_7	(trddf1.BIT_NUMBER.bit7)
	#define	TRDDF1		(trddf1.ALL)
#endif

/* TRDCR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDCR0;

SFR_GLOBAL	SFR_TRDCR0	trdcr0;

#ifdef __RL78__
	#define	TRDCR0_0	(TRDCR0.0)
	#define	TRDCR0_1	(TRDCR0.1)
	#define	TRDCR0_2	(TRDCR0.2)
	#define	TRDCR0_3	(TRDCR0.3)
	#define	TRDCR0_4	(TRDCR0.4)
	#define	TRDCR0_5	(TRDCR0.5)
	#define	TRDCR0_6	(TRDCR0.6)
	#define	TRDCR0_7	(TRDCR0.7)
#else
	#define	TRDCR0_0	(trdcr0.BIT_NUMBER.bit0)
	#define	TRDCR0_1	(trdcr0.BIT_NUMBER.bit1)
	#define	TRDCR0_2	(trdcr0.BIT_NUMBER.bit2)
	#define	TRDCR0_3	(trdcr0.BIT_NUMBER.bit3)
	#define	TRDCR0_4	(trdcr0.BIT_NUMBER.bit4)
	#define	TRDCR0_5	(trdcr0.BIT_NUMBER.bit5)
	#define	TRDCR0_6	(trdcr0.BIT_NUMBER.bit6)
	#define	TRDCR0_7	(trdcr0.BIT_NUMBER.bit7)
	#define	TRDCR0	(trdcr0.ALL)
#endif

/* TRDIORA0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIORA0;

SFR_GLOBAL	SFR_TRDIORA0	trdiora0;

#ifdef __RL78__
	#define	TRDIORA0_0	(TRDIORA0.0)
	#define	TRDIORA0_1	(TRDIORA0.1)
	#define	TRDIORA0_2	(TRDIORA0.2)
	#define	TRDIORA0_3	(TRDIORA0.3)
	#define	TRDIORA0_4	(TRDIORA0.4)
	#define	TRDIORA0_5	(TRDIORA0.5)
	#define	TRDIORA0_6	(TRDIORA0.6)
	#define	TRDIORA0_7	(TRDIORA0.7)
#else
	#define	TRDIORA0_0	(trdiora0.BIT_NUMBER.bit0)
	#define	TRDIORA0_1	(trdiora0.BIT_NUMBER.bit1)
	#define	TRDIORA0_2	(trdiora0.BIT_NUMBER.bit2)
	#define	TRDIORA0_3	(trdiora0.BIT_NUMBER.bit3)
	#define	TRDIORA0_4	(trdiora0.BIT_NUMBER.bit4)
	#define	TRDIORA0_5	(trdiora0.BIT_NUMBER.bit5)
	#define	TRDIORA0_6	(trdiora0.BIT_NUMBER.bit6)
	#define	TRDIORA0_7	(trdiora0.BIT_NUMBER.bit7)
	#define	TRDIORA0	(trdiora0.ALL)
#endif

/* TRDIORC0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIORC0;

SFR_GLOBAL	SFR_TRDIORC0	trdiorc0;

#ifdef __RL78__
	#define	TRDIORC0_0	(TRDIORC0.0)
	#define	TRDIORC0_1	(TRDIORC0.1)
	#define	TRDIORC0_2	(TRDIORC0.2)
	#define	TRDIORC0_3	(TRDIORC0.3)
	#define	TRDIORC0_4	(TRDIORC0.4)
	#define	TRDIORC0_5	(TRDIORC0.5)
	#define	TRDIORC0_6	(TRDIORC0.6)
	#define	TRDIORC0_7	(TRDIORC0.7)
#else
	#define	TRDIORC0_0	(trdiora0.BIT_NUMBER.bit0)
	#define	TRDIORC0_1	(trdiorc0.BIT_NUMBER.bit1)
	#define	TRDIORC0_2	(trdiorc0.BIT_NUMBER.bit2)
	#define	TRDIORC0_3	(trdiorc0.BIT_NUMBER.bit3)
	#define	TRDIORC0_4	(trdiorc0.BIT_NUMBER.bit4)
	#define	TRDIORC0_5	(trdiorc0.BIT_NUMBER.bit5)
	#define	TRDIORC0_6	(trdiorc0.BIT_NUMBER.bit6)
	#define	TRDIORC0_7	(trdiorc0.BIT_NUMBER.bit7)
	#define	TRDIORC0	(trdiorc0.ALL)
#endif

/* TRDSR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDSR0;

SFR_GLOBAL	SFR_TRDSR0	trdsr0;

#ifdef __RL78__
	#define	TRDSR0_0	(TRDSR0.0)
	#define	TRDSR0_1	(TRDSR0.1)
	#define	TRDSR0_2	(TRDSR0.2)
	#define	TRDSR0_3	(TRDSR0.3)
	#define	TRDSR0_4	(TRDSR0.4)
	#define	TRDSR0_5	(TRDSR0.5)
	#define	TRDSR0_6	(TRDSR0.6)
	#define	TRDSR0_7	(TRDSR0.7)
#else
	#define	TRDSR0_0	(trdsr0.BIT_NUMBER.bit0)
	#define	TRDSR0_1	(trdsr0.BIT_NUMBER.bit1)
	#define	TRDSR0_2	(trdsr0.BIT_NUMBER.bit2)
	#define	TRDSR0_3	(trdsr0.BIT_NUMBER.bit3)
	#define	TRDSR0_4	(trdsr0.BIT_NUMBER.bit4)
	#define	TRDSR0_5	(trdsr0.BIT_NUMBER.bit5)
	#define	TRDSR0_6	(trdsr0.BIT_NUMBER.bit6)
	#define	TRDSR0_7	(trdsr0.BIT_NUMBER.bit7)
	#define	TRDSR0		(trdsr0.ALL)
#endif

/* TRDIER0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIER0;

SFR_GLOBAL	SFR_TRDIER0	trdier0;

#ifdef __RL78__
	#define	TRDIER0_0	(TRDIER0.0)
	#define	TRDIER0_1	(TRDIER0.1)
	#define	TRDIER0_2	(TRDIER0.2)
	#define	TRDIER0_3	(TRDIER0.3)
	#define	TRDIER0_4	(TRDIER0.4)
	#define	TRDIER0_5	(TRDIER0.5)
	#define	TRDIER0_6	(TRDIER0.6)
	#define	TRDIER0_7	(TRDIER0.7)
#else
	#define	TRDIER0_0	(trdier0.BIT_NUMBER.bit0)
	#define	TRDIER0_1	(trdier0.BIT_NUMBER.bit1)
	#define	TRDIER0_2	(trdier0.BIT_NUMBER.bit2)
	#define	TRDIER0_3	(trdier0.BIT_NUMBER.bit3)
	#define	TRDIER0_4	(trdier0.BIT_NUMBER.bit4)
	#define	TRDIER0_5	(trdier0.BIT_NUMBER.bit5)
	#define	TRDIER0_6	(trdier0.BIT_NUMBER.bit6)
	#define	TRDIER0_7	(trdier0.BIT_NUMBER.bit7)
	#define	TRDIER0		(trdier0.ALL)
#endif

/* TRDPOCR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDPOCR0;

SFR_GLOBAL	SFR_TRDPOCR0	trdpocr0;

#ifdef __RL78__
	#define	TRDPOCR0_0	(TRDPOCR0.0)
	#define	TRDPOCR0_1	(TRDPOCR0.1)
	#define	TRDPOCR0_2	(TRDPOCR0.2)
	#define	TRDPOCR0_3	(TRDPOCR0.3)
	#define	TRDPOCR0_4	(TRDPOCR0.4)
	#define	TRDPOCR0_5	(TRDPOCR0.5)
	#define	TRDPOCR0_6	(TRDPOCR0.6)
	#define	TRDPOCR0_7	(TRDPOCR0.7)
#else
	#define	TRDPOCR0_0	(trdpocr0.BIT_NUMBER.bit0)
	#define	TRDPOCR0_1	(trdpocr0.BIT_NUMBER.bit1)
	#define	TRDPOCR0_2	(trdpocr0.BIT_NUMBER.bit2)
	#define	TRDPOCR0_3	(trdpocr0.BIT_NUMBER.bit3)
	#define	TRDPOCR0_4	(trdpocr0.BIT_NUMBER.bit4)
	#define	TRDPOCR0_5	(trdpocr0.BIT_NUMBER.bit5)
	#define	TRDPOCR0_6	(trdpocr0.BIT_NUMBER.bit6)
	#define	TRDPOCR0_7	(trdpocr0.BIT_NUMBER.bit7)
	#define	TRDPOCR0	(trdpocr0.ALL)
#endif

/* TRD0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trd0;
#ifdef __RL78__
#else
	#define	TRD0	(trd0)
#endif

/* TRDGRA0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgra0;
#ifdef __RL78__
#else
	#define	TRDGRA0	(trdgra0)
#endif

/* TRDGRB0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrb0;
#ifdef __RL78__
#else
	#define	TRDGRB0	(trdgrb0)
#endif

/* TRDCR1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDCR1;

SFR_GLOBAL	SFR_TRDCR1	trdcr1;

#ifdef __RL78__
	#define	TRDCR1_0	(TRDCR1.0)
	#define	TRDCR1_1	(TRDCR1.1)
	#define	TRDCR1_2	(TRDCR1.2)
	#define	TRDCR1_3	(TRDCR1.3)
	#define	TRDCR1_4	(TRDCR1.4)
	#define	TRDCR1_5	(TRDCR1.5)
	#define	TRDCR1_6	(TRDCR1.6)
	#define	TRDCR1_7	(TRDCR1.7)
#else
	#define	TRDCR1_0	(trdcr1.BIT_NUMBER.bit0)
	#define	TRDCR1_1	(trdcr1.BIT_NUMBER.bit1)
	#define	TRDCR1_2	(trdcr1.BIT_NUMBER.bit2)
	#define	TRDCR1_3	(trdcr1.BIT_NUMBER.bit3)
	#define	TRDCR1_4	(trdcr1.BIT_NUMBER.bit4)
	#define	TRDCR1_5	(trdcr1.BIT_NUMBER.bit5)
	#define	TRDCR1_6	(trdcr1.BIT_NUMBER.bit6)
	#define	TRDCR1_7	(trdcr1.BIT_NUMBER.bit7)
	#define	TRDCR1		(trdcr1.ALL)
#endif

