turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TRDIORA1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIORA1;

SFR_GLOBAL	SFR_TRDIORA1	trdiora1;

#ifdef __RL78__
	#define	TRDIORA1_0	(TRDIORA1.0)
	#define	TRDIORA1_1	(TRDIORA1.1)
	#define	TRDIORA1_2	(TRDIORA1.2)
	#define	TRDIORA1_3	(TRDIORA1.3)
	#define	TRDIORA1_4	(TRDIORA1.4)
	#define	TRDIORA1_5	(TRDIORA1.5)
	#define	TRDIORA1_6	(TRDIORA1.6)
	#define	TRDIORA1_7	(TRDIORA1.7)
#else
	#define	TRDIORA1_0	(trdiora1.BIT_NUMBER.bit0)
	#define	TRDIORA1_1	(trdiora1.BIT_NUMBER.bit1)
	#define	TRDIORA1_2	(trdiora1.BIT_NUMBER.bit2)
	#define	TRDIORA1_3	(trdiora1.BIT_NUMBER.bit3)
	#define	TRDIORA1_4	(trdiora1.BIT_NUMBER.bit4)
	#define	TRDIORA1_5	(trdiora1.BIT_NUMBER.bit5)
	#define	TRDIORA1_6	(trdiora1.BIT_NUMBER.bit6)
	#define	TRDIORA1_7	(trdiora1.BIT_NUMBER.bit7)
	#define	TRDIORA1	(trdiora1.ALL)
#endif

/* TRDIORC1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIORC1;

SFR_GLOBAL	SFR_TRDIORC1	trdiorc1;

#ifdef __RL78__
	#define	TRDIORC1_0	(TRDIORC1.0)
	#define	TRDIORC1_1	(TRDIORC1.1)
	#define	TRDIORC1_2	(TRDIORC1.2)
	#define	TRDIORC1_3	(TRDIORC1.3)
	#define	TRDIORC1_4	(TRDIORC1.4)
	#define	TRDIORC1_5	(TRDIORC1.5)
	#define	TRDIORC1_6	(TRDIORC1.6)
	#define	TRDIORC1_7	(TRDIORC1.7)
#else
	#define	TRDIORC1_0	(trdiora1.BIT_NUMBER.bit0)
	#define	TRDIORC1_1	(trdiorc1.BIT_NUMBER.bit1)
	#define	TRDIORC1_2	(trdiorc1.BIT_NUMBER.bit2)
	#define	TRDIORC1_3	(trdiorc1.BIT_NUMBER.bit3)
	#define	TRDIORC1_4	(trdiorc1.BIT_NUMBER.bit4)
	#define	TRDIORC1_5	(trdiorc1.BIT_NUMBER.bit5)
	#define	TRDIORC1_6	(trdiorc1.BIT_NUMBER.bit6)
	#define	TRDIORC1_7	(trdiorc1.BIT_NUMBER.bit7)
	#define	TRDIORC1	(trdiorc1.ALL)
#endif

/* TRDSR1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDSR1;

SFR_GLOBAL	SFR_TRDSR1	trdsr1;

#ifdef __RL78__
	#define	TRDSR1_0	(TRDSR1.0)
	#define	TRDSR1_1	(TRDSR1.1)
	#define	TRDSR1_2	(TRDSR1.2)
	#define	TRDSR1_3	(TRDSR1.3)
	#define	TRDSR1_4	(TRDSR1.4)
	#define	TRDSR1_5	(TRDSR1.5)
	#define	TRDSR1_6	(TRDSR1.6)
	#define	TRDSR1_7	(TRDSR1.7)
#else
	#define	TRDSR1_0	(trdsr1.BIT_NUMBER.bit0)
	#define	TRDSR1_1	(trdsr1.BIT_NUMBER.bit1)
	#define	TRDSR1_2	(trdsr1.BIT_NUMBER.bit2)
	#define	TRDSR1_3	(trdsr1.BIT_NUMBER.bit3)
	#define	TRDSR1_4	(trdsr1.BIT_NUMBER.bit4)
	#define	TRDSR1_5	(trdsr1.BIT_NUMBER.bit5)
	#define	TRDSR1_6	(trdsr1.BIT_NUMBER.bit6)
	#define	TRDSR1_7	(trdsr1.BIT_NUMBER.bit7)
	#define	TRDSR1		(trdsr1.ALL)
#endif

/* TRDIER1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDIER1;

SFR_GLOBAL	SFR_TRDIER1	trdier1;

#ifdef __RL78__
	#define	TRDIER1_0	(TRDIER1.0)
	#define	TRDIER1_1	(TRDIER1.1)
	#define	TRDIER1_2	(TRDIER1.2)
	#define	TRDIER1_3	(TRDIER1.3)
	#define	TRDIER1_4	(TRDIER1.4)
	#define	TRDIER1_5	(TRDIER1.5)
	#define	TRDIER1_6	(TRDIER1.6)
	#define	TRDIER1_7	(TRDIER1.7)
#else
	#define	TRDIER1_0	(trdier1.BIT_NUMBER.bit0)
	#define	TRDIER1_1	(trdier1.BIT_NUMBER.bit1)
	#define	TRDIER1_2	(trdier1.BIT_NUMBER.bit2)
	#define	TRDIER1_3	(trdier1.BIT_NUMBER.bit3)
	#define	TRDIER1_4	(trdier1.BIT_NUMBER.bit4)
	#define	TRDIER1_5	(trdier1.BIT_NUMBER.bit5)
	#define	TRDIER1_6	(trdier1.BIT_NUMBER.bit6)
	#define	TRDIER1_7	(trdier1.BIT_NUMBER.bit7)
	#define	TRDIER1		(trdier1.ALL)
#endif

/* TRDPOCR1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_TRDPOCR1;

SFR_GLOBAL	SFR_TRDPOCR1	trdpocr1;

#ifdef __RL78__
	#define	TRDPOCR1_0	(TRDPOCR1.0)
	#define	TRDPOCR1_1	(TRDPOCR1.1)
	#define	TRDPOCR1_2	(TRDPOCR1.2)
	#define	TRDPOCR1_3	(TRDPOCR1.3)
	#define	TRDPOCR1_4	(TRDPOCR1.4)
	#define	TRDPOCR1_5	(TRDPOCR1.5)
	#define	TRDPOCR1_6	(TRDPOCR1.6)
	#define	TRDPOCR1_7	(TRDPOCR1.7)
#else
	#define	TRDPOCR1_0	(trdpocr1.BIT_NUMBER.bit0)
	#define	TRDPOCR1_1	(trdpocr1.BIT_NUMBER.bit1)
	#define	TRDPOCR1_2	(trdpocr1.BIT_NUMBER.bit2)
	#define	TRDPOCR1_3	(trdpocr1.BIT_NUMBER.bit3)
	#define	TRDPOCR1_4	(trdpocr1.BIT_NUMBER.bit4)
	#define	TRDPOCR1_5	(trdpocr1.BIT_NUMBER.bit5)
	#define	TRDPOCR1_6	(trdpocr1.BIT_NUMBER.bit6)
	#define	TRDPOCR1_7	(trdpocr1.BIT_NUMBER.bit7)
	#define	TRDPOCR1	(trdpocr1.ALL)
#endif

/* TRD1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trd1;
#ifdef __RL78__
#else
	#define	TRD1	(trd1)
#endif

/* TRDGRA1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgra1;
#ifdef __RL78__
#else
	#define	TRDGRA1	(trdgra1)
#endif

/* TRDGRB1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trdgrb1;
#ifdef __RL78__
#else
	#define	TRDGRB1	(trdgrb1)
#endif

/* CMPCTL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CMPCTL;

SFR_GLOBAL	SFR_CMPCTL	cmpctl;

#ifdef __RL78__
	#define	CMPCTL_0	(CMPCTL.0)
	#define	CMPCTL_1	(CMPCTL.1)
	#define	CMPCTL_2	(CMPCTL.2)
	#define	CMPCTL_3	(CMPCTL.3)
	#define	CMPCTL_4	(CMPCTL.4)
	#define	CMPCTL_5	(CMPCTL.5)
	#define	CMPCTL_6	(CMPCTL.6)
	#define	CMPCTL_7	(CMPCTL.7)
#else
	#define	COE			(cmpctl.BIT_NUMBER.bit1)
	#define	HCMPON		(cmpctl.BIT_NUMBER.bit7)
	#define	CMPCTL_0	(cmpctl.BIT_NUMBER.bit0)
	#define	CMPCTL_1	(cmpctl.BIT_NUMBER.bit1)
	#define	CMPCTL_2	(cmpctl.BIT_NUMBER.bit2)
	#define	CMPCTL_3	(cmpctl.BIT_NUMBER.bit3)
	#define	CMPCTL_4	(cmpctl.BIT_NUMBER.bit4)
	#define	CMPCTL_5	(cmpctl.BIT_NUMBER.bit5)
	#define	CMPCTL_6	(cmpctl.BIT_NUMBER.bit6)
	#define	CMPCTL_7	(cmpctl.BIT_NUMBER.bit7)
	#define	CMPCTL		(cmpctl.ALL)
#endif

/* CMPSEL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CMPSEL;

SFR_GLOBAL	SFR_CMPSEL	cmpsel;

#ifdef __RL78__
	#define	CMPSEL_0	(CMPSEL.0)
	#define	CMPSEL_1	(CMPSEL.1)
	#define	CMPSEL_2	(CMPSEL.2)
	#define	CMPSEL_3	(CMPSEL.3)
	#define	CMPSEL_4	(CMPSEL.4)
	#define	CMPSEL_5	(CMPSEL.5)
	#define	CMPSEL_6	(CMPSEL.6)
	#define	CMPSEL_7	(CMPSEL.7)
#else
	#define	CPOE		(cmpsel.BIT_NUMBER.bit6)
	#define	CMPSEL_0	(cmpsel.BIT_NUMBER.bit0)
	#define	CMPSEL_1	(cmpsel.BIT_NUMBER.bit1)
	#define	CMPSEL_2	(cmpsel.BIT_NUMBER.bit2)
	#define	CMPSEL_3	(cmpsel.BIT_NUMBER.bit3)
	#define	CMPSEL_4	(cmpsel.BIT_NUMBER.bit4)
	#define	CMPSEL_5	(cmpsel.BIT_NUMBER.bit5)
	#define	CMPSEL_6	(cmpsel.BIT_NUMBER.bit6)
	#define	CMPSEL_7	(cmpsel.BIT_NUMBER.bit7)
	#define	CMPSEL		(cmpsel.ALL)
#endif

/* CMPMON */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CMPMON;

SFR_GLOBAL	SFR_CMPMON	cmpmon;

#ifdef __RL78__
	#define	CMPMON_0	(CMPMON.0)
	#define	CMPMON_1	(CMPMON.1)
	#define	CMPMON_2	(CMPMON.2)
	#define	CMPMON_3	(CMPMON.3)
	#define	CMPMON_4	(CMPMON.4)
	#define	CMPMON_5	(CMPMON.5)
	#define	CMPMON_6	(CMPMON.6)
	#define	CMPMON_7	(CMPMON.7)
#else
	#define	CMPMON_0	(cmpmon.BIT_NUMBER.bit0)
	#define	CMPMON_1	(cmpmon.BIT_NUMBER.bit1)
	#define	CMPMON_2	(cmpmon.BIT_NUMBER.bit2)
	#define	CMPMON_3	(cmpmon.BIT_NUMBER.bit3)
	#define	CMPMON_4	(cmpmon.BIT_NUMBER.bit4)
	#define	CMPMON_5	(cmpmon.BIT_NUMBER.bit5)
	#define	CMPMON_6	(cmpmon.BIT_NUMBER.bit6)
	#define	CMPMON_7	(cmpmon.BIT_NUMBER.bit7)
	#define	CMPMON		(cmpmon.ALL)
#endif

/* PER1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PER1;

