turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_PER1	per1;

#ifdef __RL78__
	#define	PER1_0	(PER1.0)
	#define	PER1_1	(PER1.1)
	#define	PER1_2	(PER1.2)
	#define	PER1_3	(PER1.3)
	#define	PER1_4	(PER1.4)
	#define	PER1_5	(PER1.5)
	#define	PER1_6	(PER1.6)
	#define	PER1_7	(PER1.7)
#else
	#define	TRJ0EN	(per1.BIT_NUMBER.bit0)
	#define	DTCEN	(per1.BIT_NUMBER.bit3)
	#define	TRD0EN	(per1.BIT_NUMBER.bit4)
	#define	CMPEN	(per1.BIT_NUMBER.bit5)
	#define	DACEN	(per1.BIT_NUMBER.bit7)
	#define	PER1_0	(per1.BIT_NUMBER.bit0)
	#define	PER1_1	(per1.BIT_NUMBER.bit1)
	#define	PER1_2	(per1.BIT_NUMBER.bit2)
	#define	PER1_3	(per1.BIT_NUMBER.bit3)
	#define	PER1_4	(per1.BIT_NUMBER.bit4)
	#define	PER1_5	(per1.BIT_NUMBER.bit5)
	#define	PER1_6	(per1.BIT_NUMBER.bit6)
	#define	PER1_7	(per1.BIT_NUMBER.bit7)
	#define	PER1	(per1.ALL)
#endif

/* PER2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PER2;

SFR_GLOBAL	SFR_PER2	per2;

#ifdef __RL78__
	#define	PER2_0	(PER2.0)
	#define	PER2_1	(PER2.1)
	#define	PER2_2	(PER2.2)
	#define	PER2_3	(PER2.3)
	#define	PER2_4	(PER2.4)
	#define	PER2_5	(PER2.5)
	#define	PER2_6	(PER2.6)
	#define	PER2_7	(PER2.7)
#else
	#define	CAN0EN	(per2.BIT_NUMBER.bit0)
	#define	LIN0EN	(per2.BIT_NUMBER.bit2)
	#define	LIN1EN	(per2.BIT_NUMBER.bit3)
	#define	PER2_0	(per2.BIT_NUMBER.bit0)
	#define	PER2_1	(per2.BIT_NUMBER.bit1)
	#define	PER2_2	(per2.BIT_NUMBER.bit2)
	#define	PER2_3	(per2.BIT_NUMBER.bit3)
	#define	PER2_4	(per2.BIT_NUMBER.bit4)
	#define	PER2_5	(per2.BIT_NUMBER.bit5)
	#define	PER2_6	(per2.BIT_NUMBER.bit6)
	#define	PER2_7	(per2.BIT_NUMBER.bit7)
	#define	PER2	(per2.ALL)
#endif

/* CANCKSEL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CANCKSEL;

SFR_GLOBAL	SFR_CANCKSEL	cancksel;

#ifdef __RL78__
	#define	CANCKSEL_0	(CANCKSEL.0)
	#define	CANCKSEL_1	(CANCKSEL.1)
	#define	CANCKSEL_2	(CANCKSEL.2)
	#define	CANCKSEL_3	(CANCKSEL.3)
	#define	CANCKSEL_4	(CANCKSEL.4)
	#define	CANCKSEL_5	(CANCKSEL.5)
	#define	CANCKSEL_6	(CANCKSEL.6)
	#define	CANCKSEL_7	(CANCKSEL.7)
#else
	#define	CAN0MCKE	(cancksel.BIT_NUMBER.bit0)
	#define	CANCKSEL_0	(cancksel.BIT_NUMBER.bit0)
	#define	CANCKSEL_1	(cancksel.BIT_NUMBER.bit1)
	#define	CANCKSEL_2	(cancksel.BIT_NUMBER.bit2)
	#define	CANCKSEL_3	(cancksel.BIT_NUMBER.bit3)
	#define	CANCKSEL_4	(cancksel.BIT_NUMBER.bit4)
	#define	CANCKSEL_5	(cancksel.BIT_NUMBER.bit5)
	#define	CANCKSEL_6	(cancksel.BIT_NUMBER.bit6)
	#define	CANCKSEL_7	(cancksel.BIT_NUMBER.bit7)
	#define	CANCKSEL	(cancksel.ALL)
#endif

/* LINCKSEL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_LINCKSEL;

SFR_GLOBAL	SFR_LINCKSEL	lincksel;

#ifdef __RL78__
	#define	LINCKSEL_0	(LINCKSEL.0)
	#define	LINCKSEL_1	(LINCKSEL.1)
	#define	LINCKSEL_2	(LINCKSEL.2)
	#define	LINCKSEL_3	(LINCKSEL.3)
	#define	LINCKSEL_4	(LINCKSEL.4)
	#define	LINCKSEL_5	(LINCKSEL.5)
	#define	LINCKSEL_6	(LINCKSEL.6)
	#define	LINCKSEL_7	(LINCKSEL.7)
#else
	#define	LIN0MCK		(lincksel.BIT_NUMBER.bit0)
	#define	LIN1MCK		(lincksel.BIT_NUMBER.bit1)
	#define	LIN0MCKE	(lincksel.BIT_NUMBER.bit4)
	#define	LIN1MCKE	(lincksel.BIT_NUMBER.bit5)
	#define	LINCKSEL_0	(lincksel.BIT_NUMBER.bit0)
	#define	LINCKSEL_1	(lincksel.BIT_NUMBER.bit1)
	#define	LINCKSEL_2	(lincksel.BIT_NUMBER.bit2)
	#define	LINCKSEL_3	(lincksel.BIT_NUMBER.bit3)
	#define	LINCKSEL_4	(lincksel.BIT_NUMBER.bit4)
	#define	LINCKSEL_5	(lincksel.BIT_NUMBER.bit5)
	#define	LINCKSEL_6	(lincksel.BIT_NUMBER.bit6)
	#define	LINCKSEL_7	(lincksel.BIT_NUMBER.bit7)
	#define	LINCKSEL	(lincksel.ALL)
#endif

/* CKSEL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CKSEL;

SFR_GLOBAL	SFR_CKSEL	cksel;

#ifdef __RL78__
	#define	CKSEL_0		(CKSEL.0)
	#define	CKSEL_1		(CKSEL.1)
	#define	CKSEL_2		(CKSEL.2)
	#define	CKSEL_3		(CKSEL.3)
	#define	CKSEL_4		(CKSEL.4)
	#define	CKSEL_5		(CKSEL.5)
	#define	CKSEL_6		(CKSEL.6)
	#define	CKSEL_7		(CKSEL.7)
#else
	#define	SELLOSC		(cksel.BIT_NUMBER.bit0)
	#define	TRD_CKSEL	(cksel.BIT_NUMBER.bit2)
	#define	CKSEL_0		(cksel.BIT_NUMBER.bit0)
	#define	CKSEL_1		(cksel.BIT_NUMBER.bit1)
	#define	CKSEL_2		(cksel.BIT_NUMBER.bit2)
	#define	CKSEL_3		(cksel.BIT_NUMBER.bit3)
	#define	CKSEL_4		(cksel.BIT_NUMBER.bit4)
	#define	CKSEL_5		(cksel.BIT_NUMBER.bit5)
	#define	CKSEL_6		(cksel.BIT_NUMBER.bit6)
	#define	CKSEL_7		(cksel.BIT_NUMBER.bit7)
	#define	CKSEL		(cksel.ALL)
#endif

/* PLLCTL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PLLCTL;

SFR_GLOBAL	SFR_PLLCTL	pllctl;

#ifdef __RL78__
	#define	PLLCTL_0	(PLLCTL.0)
	#define	PLLCTL_1	(PLLCTL.1)
	#define	PLLCTL_2	(PLLCTL.2)
	#define	PLLCTL_3	(PLLCTL.3)
	#define	PLLCTL_4	(PLLCTL.4)
	#define	PLLCTL_5	(PLLCTL.5)
	#define	PLLCTL_6	(PLLCTL.6)
	#define	PLLCTL_7	(PLLCTL.7)
#else
	#define	PLLON		(pllctl.BIT_NUMBER.bit0)
	#define	PLLMUL		(pllctl.BIT_NUMBER.bit1)
	#define	SELPLL		(pllctl.BIT_NUMBER.bit2)
	#define	PLLDIV0		(pllctl.BIT_NUMBER.bit4)
	#define	PLLDIV1		(pllctl.BIT_NUMBER.bit5)
	#define	LCKSEL0		(pllctl.BIT_NUMBER.bit6)
	#define	LCKSEL1		(pllctl.BIT_NUMBER.bit7)
	#define	PLLCTL_0	(pllctl.BIT_NUMBER.bit0)
	#define	PLLCTL_1	(pllctl.BIT_NUMBER.bit1)
	#define	PLLCTL_2	(pllctl.BIT_NUMBER.bit2)
	#define	PLLCTL_3	(pllctl.BIT_NUMBER.bit3)
	#define	PLLCTL_4	(pllctl.BIT_NUMBER.bit4)
	#define	PLLCTL_5	(pllctl.BIT_NUMBER.bit5)
	#define	PLLCTL_6	(pllctl.BIT_NUMBER.bit6)
	#define	PLLCTL_7	(pllctl.BIT_NUMBER.bit7)
	#define	PLLCTL		(pllctl.ALL)
#endif

/* PLLSTS */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_PLLSTS;

SFR_GLOBAL	SFR_PLLSTS	pllsts;

#ifdef __RL78__
	#define	PLLSTS_0	(PLLSTS.0)
	#define	PLLSTS_1	(PLLSTS.1)
	#define	PLLSTS_2	(PLLSTS.2)
	#define	PLLSTS_3	(PLLSTS.3)
	#define	PLLSTS_4	(PLLSTS.4)
	#define	PLLSTS_5	(PLLSTS.5)
	#define	PLLSTS_6	(PLLSTS.6)
	#define	PLLSTS_7	(PLLSTS.7)
#else
	#define	SELPLLS		(pllsts.BIT_NUMBER.bit3)
	#define	LOCK		(pllsts.BIT_NUMBER.bit7)
	#define	PLLSTS_0	(pllsts.BIT_NUMBER.bit0)
	#define	PLLSTS_1	(pllsts.BIT_NUMBER.bit1)
	#define	PLLSTS_2	(pllsts.BIT_NUMBER.bit2)
	#define	PLLSTS_3	(pllsts.BIT_NUMBER.bit3)
	#define	PLLSTS_4	(pllsts.BIT_NUMBER.bit4)
	#define	PLLSTS_5	(pllsts.BIT_NUMBER.bit5)
	#define	PLLSTS_6	(pllsts.BIT_NUMBER.bit6)
	#define	PLLSTS_7	(pllsts.BIT_NUMBER.bit7)
	#define	PLLSTS		(pllsts.ALL)
#endif

