turatsamar/DRV8889/src/rl78_ca78k0r.h
/* MDIV */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	mdiv;

#ifdef __RL78__
#else
	#define	MDIV	(mdiv)
#endif

/* RTCCL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_RTCCL;

SFR_GLOBAL	SFR_RTCCL	rtccl;

#ifdef __RL78__
	#define	RTCCL_0	(RTCCL.0)
	#define	RTCCL_1	(RTCCL.1)
	#define	RTCCL_2	(RTCCL.2)
	#define	RTCCL_3	(RTCCL.3)
	#define	RTCCL_4	(RTCCL.4)
	#define	RTCCL_5	(RTCCL.5)
	#define	RTCCL_6	(RTCCL.6)
	#define	RTCCL_7	(RTCCL.7)
#else
	#define	RTCCL_0	(rtccl.BIT_NUMBER.bit0)
	#define	RTCCL_1	(rtccl.BIT_NUMBER.bit1)
	#define	RTCCL_2	(rtccl.BIT_NUMBER.bit2)
	#define	RTCCL_3	(rtccl.BIT_NUMBER.bit3)
	#define	RTCCL_4	(rtccl.BIT_NUMBER.bit4)
	#define	RTCCL_5	(rtccl.BIT_NUMBER.bit5)
	#define	RTCCL_6	(rtccl.BIT_NUMBER.bit6)
	#define	RTCCL_7	(rtccl.BIT_NUMBER.bit7)
	#define	RTCCL	(rtccl.ALL)
#endif

/* POCRES */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_POCRES;

SFR_GLOBAL	SFR_POCRES	pocres;

#ifdef __RL78__
	#define	POCRES_0	(POCRES.0)
	#define	POCRES_1	(POCRES.1)
	#define	POCRES_2	(POCRES.2)
	#define	POCRES_3	(POCRES.3)
	#define	POCRES_4	(POCRES.4)
	#define	POCRES_5	(POCRES.5)
	#define	POCRES_6	(POCRES.6)
	#define	POCRES_7	(POCRES.7)
#else
	#define	POCRES0		(pocres.BIT_NUMBER.bit0)
	#define	CLKRF		(pocres.BIT_NUMBER.bit4)
	#define	POCRES_0	(pocres.BIT_NUMBER.bit0)
	#define	POCRES_1	(pocres.BIT_NUMBER.bit1)
	#define	POCRES_2	(pocres.BIT_NUMBER.bit2)
	#define	POCRES_3	(pocres.BIT_NUMBER.bit3)
	#define	POCRES_4	(pocres.BIT_NUMBER.bit4)
	#define	POCRES_5	(pocres.BIT_NUMBER.bit5)
	#define	POCRES_6	(pocres.BIT_NUMBER.bit6)
	#define	POCRES_7	(pocres.BIT_NUMBER.bit7)
	#define	POCRES		(pocres.ALL)
#endif

/* STPSTC */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_STPSTC;

SFR_GLOBAL	SFR_STPSTC	stpstc;

#ifdef __RL78__
	#define	STPSTC_0	(STPSTC.0)
	#define	STPSTC_1	(STPSTC.1)
	#define	STPSTC_2	(STPSTC.2)
	#define	STPSTC_3	(STPSTC.3)
	#define	STPSTC_4	(STPSTC.4)
	#define	STPSTC_5	(STPSTC.5)
	#define	STPSTC_6	(STPSTC.6)
	#define	STPSTC_7	(STPSTC.7)
#else
	#define	STPSEL		(stpstc.BIT_NUMBER.bit0)
	#define	STPLV		(stpstc.BIT_NUMBER.bit4)
	#define	STPOEN		(stpstc.BIT_NUMBER.bit7)
	#define	STPSTC_0	(stpstc.BIT_NUMBER.bit0)
	#define	STPSTC_1	(stpstc.BIT_NUMBER.bit1)
	#define	STPSTC_2	(stpstc.BIT_NUMBER.bit2)
	#define	STPSTC_3	(stpstc.BIT_NUMBER.bit3)
	#define	STPSTC_4	(stpstc.BIT_NUMBER.bit4)
	#define	STPSTC_5	(stpstc.BIT_NUMBER.bit5)
	#define	STPSTC_6	(stpstc.BIT_NUMBER.bit6)
	#define	STPSTC_7	(stpstc.BIT_NUMBER.bit7)
	#define	STPSTC		(stpstc.ALL)
#endif

/* HDTCCR0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTCCR0;

SFR_GLOBAL	SFR_HDTCCR0	hdtccr0;

#ifdef __RL78__
	#define	HDTCCR0_0	(HDTCCR0.0)
	#define	HDTCCR0_1	(HDTCCR0.1)
	#define	HDTCCR0_2	(HDTCCR0.2)
	#define	HDTCCR0_3	(HDTCCR0.3)
	#define	HDTCCR0_4	(HDTCCR0.4)
	#define	HDTCCR0_5	(HDTCCR0.5)
	#define	HDTCCR0_6	(HDTCCR0.6)
	#define	HDTCCR0_7	(HDTCCR0.7)
#else
	#define	HMODE0		(hdtccr0.BIT_NUMBER.bit0)
	#define	HRPTSEL0	(hdtccr0.BIT_NUMBER.bit1)
	#define	HSAMOD0		(hdtccr0.BIT_NUMBER.bit2)
	#define	HDAMOD0		(hdtccr0.BIT_NUMBER.bit3)
	#define	HCHNE0		(hdtccr0.BIT_NUMBER.bit4)
	#define	HRPTINT0	(hdtccr0.BIT_NUMBER.bit5)
	#define	HSZ0		(hdtccr0.BIT_NUMBER.bit6)
	#define	HDTCCR0_0	(hdtccr0.BIT_NUMBER.bit0)
	#define	HDTCCR0_1	(hdtccr0.BIT_NUMBER.bit1)
	#define	HDTCCR0_2	(hdtccr0.BIT_NUMBER.bit2)
	#define	HDTCCR0_3	(hdtccr0.BIT_NUMBER.bit3)
	#define	HDTCCR0_4	(hdtccr0.BIT_NUMBER.bit4)
	#define	HDTCCR0_5	(hdtccr0.BIT_NUMBER.bit5)
	#define	HDTCCR0_6	(hdtccr0.BIT_NUMBER.bit6)
	#define	HDTCCR0_7	(hdtccr0.BIT_NUMBER.bit7)
	#define	HDTCCR0		(hdtccr0.ALL)
#endif

/* HDTCCT0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTCCT0;

SFR_GLOBAL	SFR_HDTCCT0	hdtcct0;

#ifdef __RL78__
	#define	HDTCCT0_0	(HDTCCT0.0)
	#define	HDTCCT0_1	(HDTCCT0.1)
	#define	HDTCCT0_2	(HDTCCT0.2)
	#define	HDTCCT0_3	(HDTCCT0.3)
	#define	HDTCCT0_4	(HDTCCT0.4)
	#define	HDTCCT0_5	(HDTCCT0.5)
	#define	HDTCCT0_6	(HDTCCT0.6)
	#define	HDTCCT0_7	(HDTCCT0.7)
#else
	#define	HDTCCT0_0	(hdtcct0.BIT_NUMBER.bit0)
	#define	HDTCCT0_1	(hdtcct0.BIT_NUMBER.bit1)
	#define	HDTCCT0_2	(hdtcct0.BIT_NUMBER.bit2)
	#define	HDTCCT0_3	(hdtcct0.BIT_NUMBER.bit3)
	#define	HDTCCT0_4	(hdtcct0.BIT_NUMBER.bit4)
	#define	HDTCCT0_5	(hdtcct0.BIT_NUMBER.bit5)
	#define	HDTCCT0_6	(hdtcct0.BIT_NUMBER.bit6)
	#define	HDTCCT0_7	(hdtcct0.BIT_NUMBER.bit7)
	#define	HDTCCT0		(hdtcct0.ALL)
#endif

/* HDTRLD0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTRLD0;

SFR_GLOBAL	SFR_HDTRLD0	hdtrld0;

#ifdef __RL78__
	#define	HDTRLD0_0	(HDTRLD0.0)
	#define	HDTRLD0_1	(HDTRLD0.1)
	#define	HDTRLD0_2	(HDTRLD0.2)
	#define	HDTRLD0_3	(HDTRLD0.3)
	#define	HDTRLD0_4	(HDTRLD0.4)
	#define	HDTRLD0_5	(HDTRLD0.5)
	#define	HDTRLD0_6	(HDTRLD0.6)
	#define	HDTRLD0_7	(HDTRLD0.7)
#else
	#define	HDTRLD0_0	(hdtrld0.BIT_NUMBER.bit0)
	#define	HDTRLD0_1	(hdtrld0.BIT_NUMBER.bit1)
	#define	HDTRLD0_2	(hdtrld0.BIT_NUMBER.bit2)
	#define	HDTRLD0_3	(hdtrld0.BIT_NUMBER.bit3)
	#define	HDTRLD0_4	(hdtrld0.BIT_NUMBER.bit4)
	#define	HDTRLD0_5	(hdtrld0.BIT_NUMBER.bit5)
	#define	HDTRLD0_6	(hdtrld0.BIT_NUMBER.bit6)
	#define	HDTRLD0_7	(hdtrld0.BIT_NUMBER.bit7)
	#define	HDTRLD0		(hdtrld0.ALL)
#endif

/* HDTSAR0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT hdtsar0;
#ifdef __RL78__
#else
	#define	HDTSAR0	(hdtsar0)
#endif

/* HDTDAR0 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT hdtdar0;
#ifdef __RL78__
#else
	#define	HDTDAR0	(hdtdar0)
#endif

/* HDTCCR1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTCCR1;

SFR_GLOBAL	SFR_HDTCCR1	hdtccr1;

#ifdef __RL78__
	#define	HDTCCR1_0	(HDTCCR1.0)
	#define	HDTCCR1_1	(HDTCCR1.1)
	#define	HDTCCR1_2	(HDTCCR1.2)
	#define	HDTCCR1_3	(HDTCCR1.3)
	#define	HDTCCR1_4	(HDTCCR1.4)
	#define	HDTCCR1_5	(HDTCCR1.5)
	#define	HDTCCR1_6	(HDTCCR1.6)
	#define	HDTCCR1_7	(HDTCCR1.7)
#else
	#define	HMODE1		(hdtccr1.BIT_NUMBER.bit0)
	#define	HRPTSEL1	(hdtccr1.BIT_NUMBER.bit1)
	#define	HSAMOD1		(hdtccr1.BIT_NUMBER.bit2)
	#define	HDAMOD1		(hdtccr1.BIT_NUMBER.bit3)
	#define	HCHNE1		(hdtccr1.BIT_NUMBER.bit4)
	#define	HRPTINT1	(hdtccr1.BIT_NUMBER.bit5)
	#define	HSZ1		(hdtccr1.BIT_NUMBER.bit6)
	#define	HDTCCR1_0	(hdtccr1.BIT_NUMBER.bit0)
	#define	HDTCCR1_1	(hdtccr1.BIT_NUMBER.bit1)
	#define	HDTCCR1_2	(hdtccr1.BIT_NUMBER.bit2)
	#define	HDTCCR1_3	(hdtccr1.BIT_NUMBER.bit3)
	#define	HDTCCR1_4	(hdtccr1.BIT_NUMBER.bit4)
	#define	HDTCCR1_5	(hdtccr1.BIT_NUMBER.bit5)
	#define	HDTCCR1_6	(hdtccr1.BIT_NUMBER.bit6)
	#define	HDTCCR1_7	(hdtccr1.BIT_NUMBER.bit7)
	#define	HDTCCR1		(hdtccr1.ALL)
#endif

/* HDTCCT1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTCCT1;

SFR_GLOBAL	SFR_HDTCCT1	hdtcct1;

#ifdef __RL78__
	#define	HDTCCT1_0	(HDTCCT1.0)
	#define	HDTCCT1_1	(HDTCCT1.1)
	#define	HDTCCT1_2	(HDTCCT1.2)
	#define	HDTCCT1_3	(HDTCCT1.3)
	#define	HDTCCT1_4	(HDTCCT1.4)
	#define	HDTCCT1_5	(HDTCCT1.5)
	#define	HDTCCT1_6	(HDTCCT1.6)
	#define	HDTCCT1_7	(HDTCCT1.7)
#else
	#define	HDTCCT1_0	(hdtcct1.BIT_NUMBER.bit0)
	#define	HDTCCT1_1	(hdtcct1.BIT_NUMBER.bit1)
	#define	HDTCCT1_2	(hdtcct1.BIT_NUMBER.bit2)
	#define	HDTCCT1_3	(hdtcct1.BIT_NUMBER.bit3)
	#define	HDTCCT1_4	(hdtcct1.BIT_NUMBER.bit4)
	#define	HDTCCT1_5	(hdtcct1.BIT_NUMBER.bit5)
	#define	HDTCCT1_6	(hdtcct1.BIT_NUMBER.bit6)
	#define	HDTCCT1_7	(hdtcct1.BIT_NUMBER.bit7)
	#define	HDTCCT1		(hdtcct1.ALL)
#endif

/* HDTRLD1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_HDTRLD1;

SFR_GLOBAL	SFR_HDTRLD1	hdtrld1;

#ifdef __RL78__
	#define	HDTRLD1_0	(HDTRLD1.0)
	#define	HDTRLD1_1	(HDTRLD1.1)
	#define	HDTRLD1_2	(HDTRLD1.2)
	#define	HDTRLD1_3	(HDTRLD1.3)
	#define	HDTRLD1_4	(HDTRLD1.4)
	#define	HDTRLD1_5	(HDTRLD1.5)
	#define	HDTRLD1_6	(HDTRLD1.6)
	#define	HDTRLD1_7	(HDTRLD1.7)
#else
	#define	HDTRLD1_0	(hdtrld1.BIT_NUMBER.bit0)
	#define	HDTRLD1_1	(hdtrld1.BIT_NUMBER.bit1)
	#define	HDTRLD1_2	(hdtrld1.BIT_NUMBER.bit2)
	#define	HDTRLD1_3	(hdtrld1.BIT_NUMBER.bit3)
	#define	HDTRLD1_4	(hdtrld1.BIT_NUMBER.bit4)
	#define	HDTRLD1_5	(hdtrld1.BIT_NUMBER.bit5)
	#define	HDTRLD1_6	(hdtrld1.BIT_NUMBER.bit6)
	#define	HDTRLD1_7	(hdtrld1.BIT_NUMBER.bit7)
	#define	HDTRLD1		(hdtrld1.ALL)
#endif

/* HDTSAR1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT hdtsar1;
#ifdef __RL78__
#else
	#define	HDTSAR1	(hdtsar1)
#endif

/* HDTDAR1 */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT hdtdar1;
#ifdef __RL78__
#else
	#define	HDTDAR1	(hdtdar1)
#endif

