turatsamar/DRV8889/src/rl78_ca78k0r.h
/* DTCBAR */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	dtcbar;

#ifdef __RL78__
#else
	#define	DTCBAR	(dtcbar)
#endif

/* SELHS0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_SELHS0;

SFR_GLOBAL	SFR_SELHS0	selhs0;

#ifdef __RL78__
	#define	SELHS0_0	(SELHS0.0)
	#define	SELHS0_1	(SELHS0.1)
	#define	SELHS0_2	(SELHS0.2)
	#define	SELHS0_3	(SELHS0.3)
	#define	SELHS0_4	(SELHS0.4)
	#define	SELHS0_5	(SELHS0.5)
	#define	SELHS0_6	(SELHS0.6)
	#define	SELHS0_7	(SELHS0.7)
#else
	#define	SELHS0_0	(selhs0.BIT_NUMBER.bit0)
	#define	SELHS0_1	(selhs0.BIT_NUMBER.bit1)
	#define	SELHS0_2	(selhs0.BIT_NUMBER.bit2)
	#define	SELHS0_3	(selhs0.BIT_NUMBER.bit3)
	#define	SELHS0_4	(selhs0.BIT_NUMBER.bit4)
	#define	SELHS0_5	(selhs0.BIT_NUMBER.bit5)
	#define	SELHS0_6	(selhs0.BIT_NUMBER.bit6)
	#define	SELHS0_7	(selhs0.BIT_NUMBER.bit7)
	#define	SELHS0		(selhs0.ALL)
#endif

/* SELHS1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_SELHS1;

SFR_GLOBAL	SFR_SELHS1	selhs1;

#ifdef __RL78__
	#define	SELHS1_0	(SELHS1.0)
	#define	SELHS1_1	(SELHS1.1)
	#define	SELHS1_2	(SELHS1.2)
	#define	SELHS1_3	(SELHS1.3)
	#define	SELHS1_4	(SELHS1.4)
	#define	SELHS1_5	(SELHS1.5)
	#define	SELHS1_6	(SELHS1.6)
	#define	SELHS1_7	(SELHS1.7)
#else
	#define	SELHS1_0	(selhs1.BIT_NUMBER.bit0)
	#define	SELHS1_1	(selhs1.BIT_NUMBER.bit1)
	#define	SELHS1_2	(selhs1.BIT_NUMBER.bit2)
	#define	SELHS1_3	(selhs1.BIT_NUMBER.bit3)
	#define	SELHS1_4	(selhs1.BIT_NUMBER.bit4)
	#define	SELHS1_5	(selhs1.BIT_NUMBER.bit5)
	#define	SELHS1_6	(selhs1.BIT_NUMBER.bit6)
	#define	SELHS1_7	(selhs1.BIT_NUMBER.bit7)
	#define	SELHS1		(selhs1.ALL)
#endif

/* DTCEN0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN0;

SFR_GLOBAL	SFR_DTCEN0	dtcen0;

#ifdef __RL78__
	#define	DTCEN0_0	(DTCEN0.0)
	#define	DTCEN0_1	(DTCEN0.1)
	#define	DTCEN0_2	(DTCEN0.2)
	#define	DTCEN0_3	(DTCEN0.3)
	#define	DTCEN0_4	(DTCEN0.4)
	#define	DTCEN0_5	(DTCEN0.5)
	#define	DTCEN0_6	(DTCEN0.6)
	#define	DTCEN0_7	(DTCEN0.7)
#else
	#define	DTCEN00		(dtcen0.BIT_NUMBER.bit0)
	#define	DTCEN01		(dtcen0.BIT_NUMBER.bit1)
	#define	DTCEN02		(dtcen0.BIT_NUMBER.bit2)
	#define	DTCEN03		(dtcen0.BIT_NUMBER.bit3)
	#define	DTCEN04		(dtcen0.BIT_NUMBER.bit4)
	#define	DTCEN05		(dtcen0.BIT_NUMBER.bit5)
	#define	DTCEN06		(dtcen0.BIT_NUMBER.bit6)
	#define	DTCEN07		(dtcen0.BIT_NUMBER.bit7)
	#define	DTCEN0_0	(dtcen0.BIT_NUMBER.bit0)
	#define	DTCEN0_1	(dtcen0.BIT_NUMBER.bit1)
	#define	DTCEN0_2	(dtcen0.BIT_NUMBER.bit2)
	#define	DTCEN0_3	(dtcen0.BIT_NUMBER.bit3)
	#define	DTCEN0_4	(dtcen0.BIT_NUMBER.bit4)
	#define	DTCEN0_5	(dtcen0.BIT_NUMBER.bit5)
	#define	DTCEN0_6	(dtcen0.BIT_NUMBER.bit6)
	#define	DTCEN0_7	(dtcen0.BIT_NUMBER.bit7)
	#define	DTCEN0		(dtcen0.ALL)
#endif

/* DTCEN1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN1;

SFR_GLOBAL	SFR_DTCEN1	dtcen1;

#ifdef __RL78__
	#define	DTCEN1_0	(DTCEN1.0)
	#define	DTCEN1_1	(DTCEN1.1)
	#define	DTCEN1_2	(DTCEN1.2)
	#define	DTCEN1_3	(DTCEN1.3)
	#define	DTCEN1_4	(DTCEN1.4)
	#define	DTCEN1_5	(DTCEN1.5)
	#define	DTCEN1_6	(DTCEN1.6)
	#define	DTCEN1_7	(DTCEN1.7)
#else
	#define	DTCEN10		(dtcen1.BIT_NUMBER.bit0)
	#define	DTCEN11		(dtcen1.BIT_NUMBER.bit1)
	#define	DTCEN12		(dtcen1.BIT_NUMBER.bit2)
	#define	DTCEN13		(dtcen1.BIT_NUMBER.bit3)
	#define	DTCEN14		(dtcen1.BIT_NUMBER.bit4)
	#define	DTCEN15		(dtcen1.BIT_NUMBER.bit5)
	#define	DTCEN16		(dtcen1.BIT_NUMBER.bit6)
	#define	DTCEN17		(dtcen1.BIT_NUMBER.bit7)
	#define	DTCEN1_0	(dtcen1.BIT_NUMBER.bit0)
	#define	DTCEN1_1	(dtcen1.BIT_NUMBER.bit1)
	#define	DTCEN1_2	(dtcen1.BIT_NUMBER.bit2)
	#define	DTCEN1_3	(dtcen1.BIT_NUMBER.bit3)
	#define	DTCEN1_4	(dtcen1.BIT_NUMBER.bit4)
	#define	DTCEN1_5	(dtcen1.BIT_NUMBER.bit5)
	#define	DTCEN1_6	(dtcen1.BIT_NUMBER.bit6)
	#define	DTCEN1_7	(dtcen1.BIT_NUMBER.bit7)
	#define	DTCEN1		(dtcen1.ALL)
#endif

/* DTCEN2 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN2;

SFR_GLOBAL	SFR_DTCEN2	dtcen2;

#ifdef __RL78__
	#define	DTCEN2_0	(DTCEN2.0)
	#define	DTCEN2_1	(DTCEN2.1)
	#define	DTCEN2_2	(DTCEN2.2)
	#define	DTCEN2_3	(DTCEN2.3)
	#define	DTCEN2_4	(DTCEN2.4)
	#define	DTCEN2_5	(DTCEN2.5)
	#define	DTCEN2_6	(DTCEN2.6)
	#define	DTCEN2_7	(DTCEN2.7)
#else
	#define	DTCEN20		(dtcen2.BIT_NUMBER.bit0)
	#define	DTCEN21		(dtcen2.BIT_NUMBER.bit1)
	#define	DTCEN22		(dtcen2.BIT_NUMBER.bit2)
	#define	DTCEN23		(dtcen2.BIT_NUMBER.bit3)
	#define	DTCEN24		(dtcen2.BIT_NUMBER.bit4)
	#define	DTCEN25		(dtcen2.BIT_NUMBER.bit5)
	#define	DTCEN26		(dtcen2.BIT_NUMBER.bit6)
	#define	DTCEN27		(dtcen2.BIT_NUMBER.bit7)
	#define	DTCEN2_0	(dtcen2.BIT_NUMBER.bit0)
	#define	DTCEN2_1	(dtcen2.BIT_NUMBER.bit1)
	#define	DTCEN2_2	(dtcen2.BIT_NUMBER.bit2)
	#define	DTCEN2_3	(dtcen2.BIT_NUMBER.bit3)
	#define	DTCEN2_4	(dtcen2.BIT_NUMBER.bit4)
	#define	DTCEN2_5	(dtcen2.BIT_NUMBER.bit5)
	#define	DTCEN2_6	(dtcen2.BIT_NUMBER.bit6)
	#define	DTCEN2_7	(dtcen2.BIT_NUMBER.bit7)
	#define	DTCEN2		(dtcen2.ALL)
#endif

/* DTCEN3 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN3;

SFR_GLOBAL	SFR_DTCEN3	dtcen3;

#ifdef __RL78__
	#define	DTCEN3_0	(DTCEN3.0)
	#define	DTCEN3_1	(DTCEN3.1)
	#define	DTCEN3_2	(DTCEN3.2)
	#define	DTCEN3_3	(DTCEN3.3)
	#define	DTCEN3_4	(DTCEN3.4)
	#define	DTCEN3_5	(DTCEN3.5)
	#define	DTCEN3_6	(DTCEN3.6)
	#define	DTCEN3_7	(DTCEN3.7)
#else
	#define	DTCEN30		(dtcen3.BIT_NUMBER.bit0)
	#define	DTCEN31		(dtcen3.BIT_NUMBER.bit1)
	#define	DTCEN32		(dtcen3.BIT_NUMBER.bit2)
	#define	DTCEN33		(dtcen3.BIT_NUMBER.bit3)
	#define	DTCEN34		(dtcen3.BIT_NUMBER.bit4)
	#define	DTCEN35		(dtcen3.BIT_NUMBER.bit5)
	#define	DTCEN36		(dtcen3.BIT_NUMBER.bit6)
	#define	DTCEN37		(dtcen3.BIT_NUMBER.bit7)
	#define	DTCEN3_0	(dtcen3.BIT_NUMBER.bit0)
	#define	DTCEN3_1	(dtcen3.BIT_NUMBER.bit1)
	#define	DTCEN3_2	(dtcen3.BIT_NUMBER.bit2)
	#define	DTCEN3_3	(dtcen3.BIT_NUMBER.bit3)
	#define	DTCEN3_4	(dtcen3.BIT_NUMBER.bit4)
	#define	DTCEN3_5	(dtcen3.BIT_NUMBER.bit5)
	#define	DTCEN3_6	(dtcen3.BIT_NUMBER.bit6)
	#define	DTCEN3_7	(dtcen3.BIT_NUMBER.bit7)
	#define	DTCEN3		(dtcen3.ALL)
#endif

/* DTCEN4 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN4;

