turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_DTCEN4	dtcen4;

#ifdef __RL78__
	#define	DTCEN4_0	(DTCEN4.0)
	#define	DTCEN4_1	(DTCEN4.1)
	#define	DTCEN4_2	(DTCEN4.2)
	#define	DTCEN4_3	(DTCEN4.3)
	#define	DTCEN4_4	(DTCEN4.4)
	#define	DTCEN4_5	(DTCEN4.5)
	#define	DTCEN4_6	(DTCEN4.6)
	#define	DTCEN4_7	(DTCEN4.7)
#else
	#define	DTCEN40		(dtcen4.BIT_NUMBER.bit0)
	#define	DTCEN41		(dtcen4.BIT_NUMBER.bit1)
	#define	DTCEN42		(dtcen4.BIT_NUMBER.bit2)
	#define	DTCEN43		(dtcen4.BIT_NUMBER.bit3)
	#define	DTCEN44		(dtcen4.BIT_NUMBER.bit4)
	#define	DTCEN45		(dtcen4.BIT_NUMBER.bit5)
	#define	DTCEN46		(dtcen4.BIT_NUMBER.bit6)
	#define	DTCEN47		(dtcen4.BIT_NUMBER.bit7)
	#define	DTCEN4_0	(dtcen4.BIT_NUMBER.bit0)
	#define	DTCEN4_1	(dtcen4.BIT_NUMBER.bit1)
	#define	DTCEN4_2	(dtcen4.BIT_NUMBER.bit2)
	#define	DTCEN4_3	(dtcen4.BIT_NUMBER.bit3)
	#define	DTCEN4_4	(dtcen4.BIT_NUMBER.bit4)
	#define	DTCEN4_5	(dtcen4.BIT_NUMBER.bit5)
	#define	DTCEN4_6	(dtcen4.BIT_NUMBER.bit6)
	#define	DTCEN4_7	(dtcen4.BIT_NUMBER.bit7)
	#define	DTCEN4		(dtcen4.ALL)
#endif

/* DTCEN5 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_DTCEN5;

SFR_GLOBAL	SFR_DTCEN5	dtcen5;

#ifdef __RL78__
	#define	DTCEN5_0	(DTCEN5.0)
	#define	DTCEN5_1	(DTCEN5.1)
	#define	DTCEN5_2	(DTCEN5.2)
	#define	DTCEN5_3	(DTCEN5.3)
	#define	DTCEN5_4	(DTCEN5.4)
	#define	DTCEN5_5	(DTCEN5.5)
	#define	DTCEN5_6	(DTCEN5.6)
	#define	DTCEN5_7	(DTCEN5.7)
#else
	#define	DTCEN50		(dtcen5.BIT_NUMBER.bit0)
	#define	DTCEN51		(dtcen5.BIT_NUMBER.bit1)
	#define	DTCEN52		(dtcen5.BIT_NUMBER.bit2)
	#define	DTCEN53		(dtcen5.BIT_NUMBER.bit3)
	#define	DTCEN54		(dtcen5.BIT_NUMBER.bit4)
	#define	DTCEN55		(dtcen5.BIT_NUMBER.bit5)
	#define	DTCEN56		(dtcen5.BIT_NUMBER.bit6)
	#define	DTCEN57		(dtcen5.BIT_NUMBER.bit7)
	#define	DTCEN5_0	(dtcen5.BIT_NUMBER.bit0)
	#define	DTCEN5_1	(dtcen5.BIT_NUMBER.bit1)
	#define	DTCEN5_2	(dtcen5.BIT_NUMBER.bit2)
	#define	DTCEN5_3	(dtcen5.BIT_NUMBER.bit3)
	#define	DTCEN5_4	(dtcen5.BIT_NUMBER.bit4)
	#define	DTCEN5_5	(dtcen5.BIT_NUMBER.bit5)
	#define	DTCEN5_6	(dtcen5.BIT_NUMBER.bit6)
	#define	DTCEN5_7	(dtcen5.BIT_NUMBER.bit7)
	#define	DTCEN5		(dtcen5.ALL)
#endif

/* CRC0CTL */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_CRC0CTL;

SFR_GLOBAL	SFR_CRC0CTL	crc0ctl;

#ifdef __RL78__
	#define	CRC0CTL_0	(CRC0CTL.0)
	#define	CRC0CTL_1	(CRC0CTL.1)
	#define	CRC0CTL_2	(CRC0CTL.2)
	#define	CRC0CTL_3	(CRC0CTL.3)
	#define	CRC0CTL_4	(CRC0CTL.4)
	#define	CRC0CTL_5	(CRC0CTL.5)
	#define	CRC0CTL_6	(CRC0CTL.6)
	#define	CRC0CTL_7	(CRC0CTL.7)
#else
	#define	CRC0EN		(crc0ctl.BIT_NUMBER.bit7)
	#define	CRC0CTL_0	(crc0ctl.BIT_NUMBER.bit0)
	#define	CRC0CTL_1	(crc0ctl.BIT_NUMBER.bit1)
	#define	CRC0CTL_2	(crc0ctl.BIT_NUMBER.bit2)
	#define	CRC0CTL_3	(crc0ctl.BIT_NUMBER.bit3)
	#define	CRC0CTL_4	(crc0ctl.BIT_NUMBER.bit4)
	#define	CRC0CTL_5	(crc0ctl.BIT_NUMBER.bit5)
	#define	CRC0CTL_6	(crc0ctl.BIT_NUMBER.bit6)
	#define	CRC0CTL_7	(crc0ctl.BIT_NUMBER.bit7)
	#define	CRC0CTL		(crc0ctl.ALL)
#endif

/* PGCRCL */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT pgcrcl;
#ifdef __RL78__
#else
	#define	PGCRCL	(pgcrcl)
#endif

/* CRCMD */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	crcmd;

#ifdef __RL78__
#else
	#define	CRCMD	(crcmd)
#endif

/* CRCD */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT crcd;
#ifdef __RL78__
#else
	#define	CRCD	(crcd)
#endif

/* C0CFGLL */
#ifdef __RL78__
#else
	#define	C0CFGLL	(c0cfgl.BYTE.c0cfgll)
#endif

/* C0CFGLH */
#ifdef __RL78__
#else
	#define	C0CFGLH	(c0cfgl.BYTE.c0cfglh)
#endif

/* C0CFGL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0cfgll;
	SFR_UNSIGNED_SHORT_INT	c0cfglh;
}SFR_BYTE_C0CFGL;

typedef union{
	SFR_BYTE_C0CFGL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0CFGL;

SFR_GLOBAL	SFR_C0CFGL	c0cfgl;

#ifdef __RL78__
#else
	#define	C0CFGL	(c0cfgl.ALL)
#endif

/* C0CFGHL */
#ifdef __RL78__
#else
	#define	C0CFGHL	(c0cfgh.BYTE.c0cfghl)
#endif

/* C0CFGHH */
#ifdef __RL78__
#else
	#define	C0CFGHH	(c0cfgh.BYTE.c0cfghh)
#endif

/* C0CFGH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0cfghl;
	SFR_UNSIGNED_SHORT_INT	c0cfghh;
}SFR_BYTE_C0CFGH;

typedef union{
	SFR_BYTE_C0CFGL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0CFGH;

SFR_GLOBAL	SFR_C0CFGH	c0cfgh;

#ifdef __RL78__
#else
	#define	C0CFGH	(c0cfgh.ALL)
#endif

/* C0CTRLL */
#ifdef __RL78__
#else
	#define	C0CTRLL	(c0ctrl.BYTE.c0ctrll)
#endif

/* C0CTRLH */
#ifdef __RL78__
#else
	#define	C0CTRLH	(c0ctrl.BYTE.c0ctrlh)
#endif

/* C0CTRL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0ctrll;
	SFR_UNSIGNED_SHORT_INT	c0ctrlh;
}SFR_BYTE_C0CTRL;

typedef union{
	SFR_BYTE_C0CTRL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0CTRL;

SFR_GLOBAL	SFR_C0CTRL	c0ctrl;

#ifdef __RL78__
#else
	#define	C0CTRL	(c0ctrl.ALL)
#endif

/* C0CTRHL */
#ifdef __RL78__
#else
	#define	C0CTRHL	(c0ctrh.BYTE.c0ctrhl)
#endif

/* C0CTRHH */
#ifdef __RL78__
#else
	#define	C0CTRHH	(c0ctrh.BYTE.c0ctrhh)
#endif

/* C0CTRH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0ctrhl;
	SFR_UNSIGNED_SHORT_INT	c0ctrhh;
}SFR_BYTE_C0CTRH;

typedef union{
	SFR_BYTE_C0CFGL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0CTRH;

SFR_GLOBAL	SFR_C0CTRH	c0ctrh;

#ifdef __RL78__
#else
	#define	C0CTRH	(c0ctrh.ALL)
#endif

/* C0STSLL */
#ifdef __RL78__
#else
	#define	C0STSLL	(c0stsl.BYTE.c0stsll)
#endif

/* C0STSLH */
#ifdef __RL78__
#else
	#define	C0STSLH	(c0stsl.BYTE.c0stslh)
#endif

/* C0STSL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0stsll;
	SFR_UNSIGNED_SHORT_INT	c0stslh;
}SFR_BYTE_C0STSL;

typedef union{
	SFR_BYTE_C0STSL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0STSL;

SFR_GLOBAL	SFR_C0STSL	c0stsl;

#ifdef __RL78__
#else
	#define	C0STSL	(c0stsl.ALL)
#endif

/* C0STSHL */
#ifdef __RL78__
#else
	#define	C0STSHL	(c0stsh.BYTE.c0stshl)
#endif

/* C0STSHH */
#ifdef __RL78__
#else
	#define	C0STSHH	(c0stsh.BYTE.c0stshh)
#endif

/* C0STSH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0stshl;
	SFR_UNSIGNED_SHORT_INT	c0stshh;
}SFR_BYTE_C0STSH;

typedef union{
	SFR_BYTE_C0STSH	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0STSH;

SFR_GLOBAL	SFR_C0STSH	c0stsh;

#ifdef __RL78__
#else
	#define	C0STSH	(c0stsh.ALL)
#endif

/* C0ERFLLL */
#ifdef __RL78__
#else
	#define	C0ERFLLL	(c0erfll.BYTE.c0erflll)
#endif

