turatsamar/DRV8889/src/rl78_ca78k0r.h
/* C0ERFLLH */
#ifdef __RL78__
#else
	#define	C0ERFLLH	(c0erfll.BYTE.c0erfllh)
#endif

/* C0ERFLL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0erflll;
	SFR_UNSIGNED_SHORT_INT	c0erfllh;
}SFR_BYTE_C0ERFLL;

typedef union{
	SFR_BYTE_C0ERFLL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0ERFLL;

SFR_GLOBAL	SFR_C0ERFLL	c0erfll;

#ifdef __RL78__
#else
	#define	C0ERFLL	(c0erfll.ALL)
#endif

/* C0ERFLHL */
#ifdef __RL78__
#else
	#define	C0ERFLHL	(c0erflh.BYTE.c0erflhl)
#endif

/* C0ERFLHH */
#ifdef __RL78__
#else
	#define	C0ERFLHH	(c0erflh.BYTE.c0erflhh)
#endif

/* C0ERFLH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	c0erflhl;
	SFR_UNSIGNED_SHORT_INT	c0erflhh;
}SFR_BYTE_C0ERFLH;

typedef union{
	SFR_BYTE_C0ERFLH	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_C0ERFLH;

SFR_GLOBAL	SFR_C0ERFLH	c0erflh;

#ifdef __RL78__
#else
	#define	C0ERFLH	(c0erflh.ALL)
#endif

/* GCFGLL */
#ifdef __RL78__
#else
	#define	GCFGLL	(gcfgl.BYTE.gcfgll)
#endif

/* GCFGLH */
#ifdef __RL78__
#else
	#define	GCFGLH	(gcfgl.BYTE.gcfglh)
#endif

/* GCFGL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gcfgll;
	SFR_UNSIGNED_SHORT_INT	gcfglh;
}SFR_BYTE_GCFGL;

typedef union{
	SFR_BYTE_GCFGL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GCFGL;

SFR_GLOBAL	SFR_GCFGL	gcfgl;

#ifdef __RL78__
#else
	#define	GCFGL	(gcfgl.ALL)
#endif

/* GCFGHL */
#ifdef __RL78__
#else
	#define	GCFGHL	(gcfgh.BYTE.gcfghl)
#endif

/* GCFGHH */
#ifdef __RL78__
#else
	#define	GCFGHH	(gcfgh.BYTE.gcfghh)
#endif

/* GCFGH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gcfghl;
	SFR_UNSIGNED_SHORT_INT	gcfghh;
}SFR_BYTE_GCFGH;

typedef union{
	SFR_BYTE_GCFGL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GCFGH;

SFR_GLOBAL	SFR_GCFGH	gcfgh;

#ifdef __RL78__
#else
	#define	GCFGH	(gcfgh.ALL)
#endif

/* GCTRLL */
#ifdef __RL78__
#else
	#define	GCTRLL	(gctrl.BYTE.gctrll)
#endif

/* GCTRLH */
#ifdef __RL78__
#else
	#define	GCTRLH	(gctrl.BYTE.gctrlh)
#endif

/* GCTRL */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gctrll;
	SFR_UNSIGNED_SHORT_INT	gctrlh;
}SFR_BYTE_GCTRL;

typedef union{
	SFR_BYTE_GCTRL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GCTRL;

SFR_GLOBAL	SFR_GCTRL	gctrl;

#ifdef __RL78__
#else
	#define	GCTRL	(gctrl.ALL)
#endif

/* GCTRHL */
#ifdef __RL78__
#else
	#define	GCTRHL	(gctrh.BYTE.gctrhl)
#endif

/* GCTRHH */
#ifdef __RL78__
#else
	#define	GCTRHH	(gctrh.BYTE.gctrhh)
#endif

/* GCTRH */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gctrhl;
	SFR_UNSIGNED_SHORT_INT	gctrhh;
}SFR_BYTE_GCTRH;

typedef union{
	SFR_BYTE_GCTRL	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GCTRH;

SFR_GLOBAL	SFR_GCTRH	gctrh;

#ifdef __RL78__
#else
	#define	GCTRH	(gctrh.ALL)
#endif

/* GSTSL */
#ifdef __RL78__
#else
	#define	GSTSL	(gsts.BYTE.gstsl)
#endif

/* GSTSH */
#ifdef __RL78__
#else
	#define	GSTSH	(gsts.BYTE.gstsh)
#endif

/* GSTS */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gstsl;
	SFR_UNSIGNED_SHORT_INT	gstsh;
}SFR_BYTE_GSTS;

typedef union{
	SFR_BYTE_GSTS	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GSTS;

SFR_GLOBAL	SFR_GSTS	gsts;

#ifdef __RL78__
#else
	#define	GSTS	(gsts.ALL)
#endif

/* GERFLL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	gerfll;

#ifdef __RL78__
#else
	#define	GERFLL	(gerfll)
#endif

/* GTSC */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT gtsc;
#ifdef __RL78__
#else
	#define	GTSC	(gtsc)
#endif

/* GAFLCFGL */
#ifdef __RL78__
#else
	#define	GAFLCFGL	(gaflcfg.BYTE.gaflcfgl)
#endif

/* GAFLCFGH */
#ifdef __RL78__
#else
	#define	GAFLCFGH	(gaflcfg.BYTE.gaflcfgh)
#endif

/* GAFLCFG */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflcfgl;
	SFR_UNSIGNED_SHORT_INT	gaflcfgh;
}SFR_BYTE_GAFLCFG;

typedef union{
	SFR_BYTE_GAFLCFG	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLCFG;

SFR_GLOBAL	SFR_GAFLCFG	gaflcfg;

#ifdef __RL78__
#else
	#define	GAFLCFG	(gaflcfg.ALL)
#endif

/* RMNBL */
#ifdef __RL78__
#else
	#define	RMNBL	(rmnb.BYTE.rmnbl)
#endif

/* RMNB */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmnbl;
	SFR_UNSIGNED_SHORT_INT	rmnbh;
}SFR_BYTE_RMNB;

typedef union{
	SFR_BYTE_RMNB	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMNB;

SFR_GLOBAL	SFR_RMNB	rmnb;

#ifdef __RL78__
#else
	#define	RMNB	(rmnb.ALL)
#endif

/* RMND0L */
#ifdef __RL78__
#else
	#define	RMND0L	(rmnd0.BYTE.rmnd0l)
#endif

/* RMND0H */
#ifdef __RL78__
#else
	#define	RMND0H	(rmnd0.BYTE.rmnd0h)
#endif

/* RMND0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmnd0l;
	SFR_UNSIGNED_SHORT_INT	rmnd0h;
}SFR_BYTE_RMND0;

typedef union{
	SFR_BYTE_RMND0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMND0;

SFR_GLOBAL	SFR_RMND0	rmnd0;

#ifdef __RL78__
#else
	#define	RMND0	(rmnd0.ALL)
#endif

/* RFCC0L */
#ifdef __RL78__
#else
	#define	RFCC0L	(rfcc0.BYTE.rfcc0l)
#endif

/* RFCC0H */
#ifdef __RL78__
#else
	#define	RFCC0H	(rfcc0.BYTE.rfcc0h)
#endif

/* RFCC0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfcc0l;
	SFR_UNSIGNED_SHORT_INT	rfcc0h;
}SFR_BYTE_RFCC0;

typedef union{
	SFR_BYTE_RFCC0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFCC0;

SFR_GLOBAL	SFR_RFCC0	rfcc0;

#ifdef __RL78__
#else
	#define	RFCC0	(rfcc0.ALL)
#endif


/* RFCC1L */
#ifdef __RL78__
#else
	#define	RFCC1L	(rfcc1.BYTE.rfcc1l)
#endif

/* RFCC1H */
#ifdef __RL78__
#else
	#define	RFCC1H	(rfcc1.BYTE.rfcc1h)
#endif

/* RFCC1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfcc1l;
	SFR_UNSIGNED_SHORT_INT	rfcc1h;
}SFR_BYTE_RFCC1;

typedef union{
	SFR_BYTE_RFCC1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFCC1;

SFR_GLOBAL	SFR_RFCC1	rfcc1;

#ifdef __RL78__
#else
	#define	RFCC1	(rfcc1.ALL)
#endif

/* RFSTS0L */
#ifdef __RL78__
#else
	#define	RFSTS0L	(rfsts0.BYTE.rfsts0l)
#endif

/* RFSTS0H */
#ifdef __RL78__
#else
	#define	RFSTS0H	(rfsts0.BYTE.rfsts0h)
#endif

/* RFSTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfsts0l;
	SFR_UNSIGNED_SHORT_INT	rfsts0h;
}SFR_BYTE_RFSTS0;

typedef union{
	SFR_BYTE_RFSTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFSTS0;

SFR_GLOBAL	SFR_RFSTS0	rfsts0;

#ifdef __RL78__
#else
	#define	RFSTS0	(rfsts0.ALL)
#endif


/* RFSTS1L */
#ifdef __RL78__
#else
	#define	RFSTS1L	(rfsts1.BYTE.rfsts1l)
#endif

/* RFSTS1H */
#ifdef __RL78__
#else
	#define	RFSTS1H	(rfsts1.BYTE.rfsts1h)
#endif

/* RFSTS1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfsts1l;
	SFR_UNSIGNED_SHORT_INT	rfsts1h;
}SFR_BYTE_RFSTS1;

typedef union{
	SFR_BYTE_RFSTS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFSTS1;

SFR_GLOBAL	SFR_RFSTS1	rfsts1;

#ifdef __RL78__
#else
	#define	RFSTS1	(rfsts1.ALL)
#endif

/* RFPCTR0L */
#ifdef __RL78__
#else
	#define	RFPCTR0L	(rfpctr0.BYTE.rfpctr0l)
#endif

/* RFPCTR0H */
#ifdef __RL78__
#else
	#define	RFPCTR0H	(rfpctr0.BYTE.rfpctr0h)
#endif

