turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RFPCTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfpctr0l;
	SFR_UNSIGNED_SHORT_INT	rfpctr0h;
}SFR_BYTE_RFPCTR0;

typedef union{
	SFR_BYTE_RFPCTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFPCTR0;

SFR_GLOBAL	SFR_RFPCTR0	rfpctr0;

#ifdef __RL78__
#else
	#define	RFPCTR0	(rfpctr0.ALL)
#endif

/* RFPCTR1L */
#ifdef __RL78__
#else
	#define	RFPCTR1L	(rfpctr1.BYTE.rfpctr1l)
#endif

/* RFPCTR1H */
#ifdef __RL78__
#else
	#define	RFPCTR1H	(rfpctr1.BYTE.rfpctr1h)
#endif

/* RFPCTR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfpctr1l;
	SFR_UNSIGNED_SHORT_INT	rfpctr1h;
}SFR_BYTE_RFPCTR1;

typedef union{
	SFR_BYTE_RFPCTR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFPCTR1;

SFR_GLOBAL	SFR_RFPCTR1	rfpctr1;

#ifdef __RL78__
#else
	#define	RFPCTR1	(rfpctr1.ALL)
#endif

/* CFCCL0L */
#ifdef __RL78__
#else
	#define	CFCCL0L	(cfccl0.BYTE.cfccl0l)
#endif

/* CFCCL0H */
#ifdef __RL78__
#else
	#define	CFCCL0H	(cfccl0.BYTE.cfccl0h)
#endif

/* CFCCL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfccl0l;
	SFR_UNSIGNED_SHORT_INT	cfccl0h;
}SFR_BYTE_CFCCL0;

typedef union{
	SFR_BYTE_CFCCL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFCCL0;

SFR_GLOBAL	SFR_CFCCL0	cfccl0;

#ifdef __RL78__
#else
	#define	CFCCL0	(cfccl0.ALL)
#endif

/* CFCCH0L */
#ifdef __RL78__
#else
	#define	CFCCH0L	(cfcch0.BYTE.cfcch0l)
#endif

/* CFCCH0H */
#ifdef __RL78__
#else
	#define	CFCCH0H	(cfcch0.BYTE.cfcch0h)
#endif

/* CFCCH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfcch0l;
	SFR_UNSIGNED_SHORT_INT	cfcch0h;
}SFR_BYTE_CFCCH0;

typedef union{
	SFR_BYTE_CFCCH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFCCH0;

SFR_GLOBAL	SFR_CFCCH0	cfcch0;

#ifdef __RL78__
#else
	#define	CFCCH0	(cfcch0.ALL)
#endif

/* CFSTS0L */
#ifdef __RL78__
#else
	#define	CFSTS0L	(cfsts0.BYTE.cfsts0l)
#endif

/* CFSTS0H */
#ifdef __RL78__
#else
	#define	CFSTS0H	(cfsts0.BYTE.cfsts0h)
#endif

/* CFSTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfsts0l;
	SFR_UNSIGNED_SHORT_INT	cfsts0h;
}SFR_BYTE_CFSTS0;

typedef union{
	SFR_BYTE_CFSTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFSTS0;

SFR_GLOBAL	SFR_CFSTS0	cfsts0;

#ifdef __RL78__
#else
	#define	CFSTS0	(cfsts0.ALL)
#endif

/* CFPCTR0L */
#ifdef __RL78__
#else
	#define	CFPCTR0L	(cfpctr0.BYTE.cfpctr0l)
#endif

/* CFPCTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfpctr0l;
	SFR_UNSIGNED_SHORT_INT	cfpctr0h;
}SFR_BYTE_CFPCTR0;

typedef union{
	SFR_BYTE_CFPCTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFPCTR0;

SFR_GLOBAL	SFR_CFPCTR0	cfpctr0;

#ifdef __RL78__
#else
	#define	CFPCTR0	(cfpctr0.ALL)
#endif

/* RFMSTS */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	rfmsts;

#ifdef __RL78__
#else
	#define	RFMSTS	(rfmsts)
#endif

/* CFMSTS */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	cfmsts;

#ifdef __RL78__
#else
	#define	CFMSTS	(cfmsts)
#endif

/* RFISTS */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	rfists;

#ifdef __RL78__
#else
	#define	RFISTS	(rfists)
#endif

/* CFISTS */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	cfists;

#ifdef __RL78__
#else
	#define	CFISTS	(cfists)
#endif

/* TMC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmc0;

#ifdef __RL78__
#else
	#define	TMC0	(tmc0)
#endif

/* TMC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmc1;

#ifdef __RL78__
#else
	#define	TMC1	(tmc1)
#endif

/* TMC2 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmc2;

#ifdef __RL78__
#else
	#define	TMC2	(tmc2)
#endif

/* TMC3 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmc3;

#ifdef __RL78__
#else
	#define	TMC3	(tmc3)
#endif

/* TMSTS0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmsts0;

#ifdef __RL78__
#else
	#define	TMSTS0	(tmsts0)
#endif

/* TMSTS1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmsts1;

#ifdef __RL78__
#else
	#define	TMSTS1	(tmsts1)
#endif

/* TMSTS2 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmsts2;

#ifdef __RL78__
#else
	#define	TMSTS2	(tmsts2)
#endif

/* TMSTS3 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	tmsts3;

#ifdef __RL78__
#else
	#define	TMSTS3	(tmsts3)
#endif

/* TMTRSTSL */
#ifdef __RL78__
#else
	#define	TMTRSTSL	(tmtrsts.BYTE.tmtrstsl)
#endif

/* TMTRSTSH */
#ifdef __RL78__
#else
	#define	TMTRSTSH	(tmtrsts.BYTE.tmtrstsh)
#endif

/* TMTRSTS */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmtrstsl;
	SFR_UNSIGNED_SHORT_INT	tmtrstsh;
}SFR_BYTE_TMTRSTS;

typedef union{
	SFR_BYTE_TMTRSTS	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMTRSTS;

SFR_GLOBAL	SFR_TMTRSTS	tmtrsts;

#ifdef __RL78__
#else
	#define	TMTRSTS	(tmtrsts.ALL)
#endif

/* TMTCSTSL */
#ifdef __RL78__
#else
	#define	TMTCSTSL	(tmtcsts.BYTE.tmtcstsl)
#endif

/* TMTCSTSH */
#ifdef __RL78__
#else
	#define	TMTCSTSH	(tmtcsts.BYTE.tmtcstsh)
#endif

/* TMTCSTS */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmtcstsl;
	SFR_UNSIGNED_SHORT_INT	tmtcstsh;
}SFR_BYTE_TMTCSTS;

typedef union{
	SFR_BYTE_TMTCSTS	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMTCSTS;

SFR_GLOBAL	SFR_TMTCSTS	tmtcsts;

#ifdef __RL78__
#else
	#define	TMTCSTS	(tmtcsts.ALL)
#endif

/* TMTASTSL */
#ifdef __RL78__
#else
	#define	TMTASTSL	(tmtasts.BYTE.tmtastsl)
#endif

/* TMTASTSH */
#ifdef __RL78__
#else
	#define	TMTASTSH	(tmtasts.BYTE.tmtastsh)
#endif

/* TMTASTS */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmtastsl;
	SFR_UNSIGNED_SHORT_INT	tmtastsh;
}SFR_BYTE_TMTASTS;

typedef union{
	SFR_BYTE_TMTASTS	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMTASTS;

SFR_GLOBAL	SFR_TMTASTS	tmtasts;

#ifdef __RL78__
#else
	#define	TMTASTS	(tmtasts.ALL)
#endif

/* TMIECL */
#ifdef __RL78__
#else
	#define	TMIECL	(tmiec.BYTE.tmiecl)
#endif

/* TMIECH */
#ifdef __RL78__
#else
	#define	TMIECH	(tmiec.BYTE.tmiech)
#endif

/* TMIEC */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmiecl;
	SFR_UNSIGNED_SHORT_INT	tmiech;
}SFR_BYTE_TMIEC;

typedef union{
	SFR_BYTE_TMIEC	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIEC;

SFR_GLOBAL	SFR_TMIEC	tmiec;

#ifdef __RL78__
#else
	#define	TMIEC	(tmiec.ALL)
#endif

/* THLCC0L */
#ifdef __RL78__
#else
	#define	THLCC0L	(thlcc0.BYTE.thlcc0l)
#endif

