turatsamar/DRV8889/src/rl78_ca78k0r.h
/* THLCC0H */
#ifdef __RL78__
#else
	#define	THLCC0H	(thlcc0.BYTE.thlcc0h)
#endif

/* THLCC0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	thlcc0l;
	SFR_UNSIGNED_SHORT_INT	thlcc0h;
}SFR_BYTE_THLCC0;

typedef union{
	SFR_BYTE_THLCC0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_THLCC0;

SFR_GLOBAL	SFR_THLCC0	thlcc0;

#ifdef __RL78__
#else
	#define	THLCC0	(thlcc0.ALL)
#endif

/* THLSTS0L */
#ifdef __RL78__
#else
	#define	THLSTS0L	(thlsts0.BYTE.thlsts0l)
#endif

/* THLSTS0H */
#ifdef __RL78__
#else
	#define	THLSTS0H	(thlsts0.BYTE.thlsts0h)
#endif

/* THLSTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	thlsts0l;
	SFR_UNSIGNED_SHORT_INT	thlsts0h;
}SFR_BYTE_THLSTS0;

typedef union{
	SFR_BYTE_THLSTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_THLSTS0;

SFR_GLOBAL	SFR_THLSTS0	thlsts0;

#ifdef __RL78__
#else
	#define	THLSTS0	(thlsts0.ALL)
#endif

/* THLPCTR0L */
#ifdef __RL78__
#else
	#define	THLPCTR0L	(thlpctr0.BYTE.thlpctr0l)
#endif

/* THLPCTR0H */
#ifdef __RL78__
#else
	#define	THLPCTR0H	(thlpctr0.BYTE.thlpctr0h)
#endif

/* THLPCTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	thlpctr0l;
	SFR_UNSIGNED_SHORT_INT	thlpctr0h;
}SFR_BYTE_THLPCTR0;

typedef union{
	SFR_BYTE_THLPCTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_THLPCTR0;

SFR_GLOBAL	SFR_THLPCTR0	thlpctr0;

#ifdef __RL78__
#else
	#define	THLPCTR0	(thlpctr0.ALL)
#endif

/* GTINTSTSL */
#ifdef __RL78__
#else
	#define	GTINTSTSL	(gtintsts.BYTE.gtintstsl)
#endif

/* GTINTSTSH */
#ifdef __RL78__
#else
	#define	GTINTSTSH	(gtintsts.BYTE.gtintstsh)
#endif

/* GTINTSTS */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gtintstsl;
	SFR_UNSIGNED_SHORT_INT	gtintstsh;
}SFR_BYTE_GTINTSTS;

typedef union{
	SFR_BYTE_GTINTSTS	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GTINTSTS;

SFR_GLOBAL	SFR_GTINTSTS	gtintsts;

#ifdef __RL78__
#else
	#define	GTINTSTS	(gtintsts.ALL)
#endif

/* GRWCRL */
#ifdef __RL78__
#else
	#define	GRWCRL	(grwcr.BYTE.grwcrl)
#endif

/* GRWCRH */
#ifdef __RL78__
#else
	#define	GRWCRH	(grwcr.BYTE.grwcrh)
#endif

/* GRWCR */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	grwcrl;
	SFR_UNSIGNED_SHORT_INT	grwcrh;
}SFR_BYTE_GRWCR;

typedef union{
	SFR_BYTE_GRWCR	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GRWCR;

SFR_GLOBAL	SFR_GRWCR	grwcr;

#ifdef __RL78__
#else
	#define	GRWCR	(grwcr.ALL)
#endif

/* GTSTCFGL */
#ifdef __RL78__
#else
	#define	GTSTCFGL	(gtstcfg.BYTE.gtstcfgl)
#endif

/* GTSTCFGH */
#ifdef __RL78__
#else
	#define	GTSTCFGH	(gtstcfg.BYTE.gtstcfgh)
#endif

/* GTSTCFG */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gtstcfgl;
	SFR_UNSIGNED_SHORT_INT	gtstcfgh;
}SFR_BYTE_GTSTCFG;

typedef union{
	SFR_BYTE_GTSTCFG	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GTSTCFG;

SFR_GLOBAL	SFR_GTSTCFG	gtstcfg;

#ifdef __RL78__
#else
	#define	GTSTCFG	(gtstcfg.ALL)
#endif

/* GTSTCTRL */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	gtstctrl;

#ifdef __RL78__
#else
	#define	GTSTCTRL	(gtstctrl)
#endif

/* GLOCKK */
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT glockk;
#ifdef __RL78__
#else
	#define	GLOCKK	(glockk)
#endif

/* CAN受信ルール登録レジスタここから*/
/* GAFLIDL0L */
#ifdef __RL78__
#else
	#define	GAFLIDL0L	(gaflidl0.BYTE.gaflidl0l)
#endif

/* GAFLIDL0H */
#ifdef __RL78__
#else
	#define	GAFLIDL0H	(gaflidl0.BYTE.gaflidl0h)
#endif

/* GAFLIDL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl0l;
	SFR_UNSIGNED_SHORT_INT	gaflidl0h;
}SFR_BYTE_GAFLIDL0;

typedef union{
	SFR_BYTE_GAFLIDL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL0;

SFR_GLOBAL	SFR_GAFLIDL0	gaflidl0;

#ifdef __RL78__
#else
	#define	GAFLIDL0	(gaflidl0.ALL)
#endif

/* GAFLIDH0L */
#ifdef __RL78__
#else
	#define	GAFLIDH0L	(gaflidh0.BYTE.gaflidh0l)
#endif

/* GAFLIDH0H */
#ifdef __RL78__
#else
	#define	GAFLIDH0H	(gaflidh0.BYTE.gaflidh0h)
#endif

/* GAFLIDH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh0l;
	SFR_UNSIGNED_SHORT_INT	gaflidh0h;
}SFR_BYTE_GAFLIDH0;

typedef union{
	SFR_BYTE_GAFLIDH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH0;

SFR_GLOBAL	SFR_GAFLIDH0	gaflidh0;

#ifdef __RL78__
#else
	#define	GAFLIDH0	(gaflidh0.ALL)
#endif

/* GAFLML0L */
#ifdef __RL78__
#else
	#define	GAFLML0L	(gaflml0.BYTE.gaflml0l)
#endif

/* GAFLML0H */
#ifdef __RL78__
#else
	#define	GAFLML0H	(gaflml0.BYTE.gaflml0h)
#endif

/* GAFLML0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml0l;
	SFR_UNSIGNED_SHORT_INT	gaflml0h;
}SFR_BYTE_GAFLML0;

typedef union{
	SFR_BYTE_GAFLML0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML0;

SFR_GLOBAL	SFR_GAFLML0	gaflml0;

#ifdef __RL78__
#else
	#define	GAFLML0	(gaflml0.ALL)
#endif

/* GAFLMH0L */
#ifdef __RL78__
#else
	#define	GAFLMH0L	(gaflmh0.BYTE.gaflmh0l)
#endif

/* GAFLMH0H */
#ifdef __RL78__
#else
	#define	GAFLMH0H	(gaflmh0.BYTE.gaflmh0h)
#endif

/* GAFLMH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh0l;
	SFR_UNSIGNED_SHORT_INT	gaflmh0h;
}SFR_BYTE_GAFLMH0;

typedef union{
	SFR_BYTE_GAFLMH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH0;

SFR_GLOBAL	SFR_GAFLMH0	gaflmh0;

#ifdef __RL78__
#else
	#define	GAFLMH0	(gaflmh0.ALL)
#endif

/* GAFLPL0L */
#ifdef __RL78__
#else
	#define	GAFLPL0L	(gaflpl0.BYTE.gaflpl0l)
#endif

/* GAFLPL0H */
#ifdef __RL78__
#else
	#define	GAFLPL0H	(gaflpl0.BYTE.gaflpl0h)
#endif

/* GAFLPL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl0l;
	SFR_UNSIGNED_SHORT_INT	gaflpl0h;
}SFR_BYTE_GAFLPL0;

typedef union{
	SFR_BYTE_GAFLPL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL0;

SFR_GLOBAL	SFR_GAFLPL0	gaflpl0;

#ifdef __RL78__
#else
	#define	GAFLPL0	(gaflpl0.ALL)
#endif

/* GAFLPH0L */
#ifdef __RL78__
#else
	#define	GAFLPH0L	(gaflph0.BYTE.gaflph0l)
#endif

/* GAFLPH0H */
#ifdef __RL78__
#else
	#define	GAFLPH0H	(gaflph0.BYTE.gaflph0h)
#endif

/* GAFLPH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph0l;
	SFR_UNSIGNED_SHORT_INT	gaflph0h;
}SFR_BYTE_GAFLPH0;

typedef union{
	SFR_BYTE_GAFLPH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH0;

SFR_GLOBAL	SFR_GAFLPH0	gaflph0;

#ifdef __RL78__
#else
	#define	GAFLPH0	(gaflph0.ALL)
#endif

/* GAFLIDL1L */
#ifdef __RL78__
#else
	#define	GAFLIDL1L	(gaflidl1.BYTE.gaflidl1l)
#endif

