turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDL1H */
#ifdef __RL78__
#else
	#define	GAFLIDL1H	(gaflidl1.BYTE.gaflidl1h)
#endif

/* GAFLIDL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl1l;
	SFR_UNSIGNED_SHORT_INT	gaflidl1h;
}SFR_BYTE_GAFLIDL1;

typedef union{
	SFR_BYTE_GAFLIDL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL1;

SFR_GLOBAL	SFR_GAFLIDL1	gaflidl1;

#ifdef __RL78__
#else
	#define	GAFLIDL1	(gaflidl1.ALL)
#endif

/* GAFLIDH1L */
#ifdef __RL78__
#else
	#define	GAFLIDH1L	(gaflidh1.BYTE.gaflidh1l)
#endif

/* GAFLIDH1H */
#ifdef __RL78__
#else
	#define	GAFLIDH1H	(gaflidh1.BYTE.gaflidh1h)
#endif

/* GAFLIDH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh1l;
	SFR_UNSIGNED_SHORT_INT	gaflidh1h;
}SFR_BYTE_GAFLIDH1;

typedef union{
	SFR_BYTE_GAFLIDH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH1;

SFR_GLOBAL	SFR_GAFLIDH1	gaflidh1;

#ifdef __RL78__
#else
	#define	GAFLIDH1	(gaflidh1.ALL)
#endif

/* GAFLML1L */
#ifdef __RL78__
#else
	#define	GAFLML1L	(gaflml1.BYTE.gaflml1l)
#endif

/* GAFLML1H */
#ifdef __RL78__
#else
	#define	GAFLML1H	(gaflml1.BYTE.gaflml1h)
#endif

/* GAFLML1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml1l;
	SFR_UNSIGNED_SHORT_INT	gaflml1h;
}SFR_BYTE_GAFLML1;

typedef union{
	SFR_BYTE_GAFLML1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML1;

SFR_GLOBAL	SFR_GAFLML1	gaflml1;

#ifdef __RL78__
#else
	#define	GAFLML1	(gaflml1.ALL)
#endif

/* GAFLMH1L */
#ifdef __RL78__
#else
	#define	GAFLMH1L	(gaflmh1.BYTE.gaflmh1l)
#endif

/* GAFLMH1H */
#ifdef __RL78__
#else
	#define	GAFLMH1H	(gaflmh1.BYTE.gaflmh1h)
#endif

/* GAFLMH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh1l;
	SFR_UNSIGNED_SHORT_INT	gaflmh1h;
}SFR_BYTE_GAFLMH1;

typedef union{
	SFR_BYTE_GAFLMH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH1;

SFR_GLOBAL	SFR_GAFLMH1	gaflmh1;

#ifdef __RL78__
#else
	#define	GAFLMH1	(gaflmh1.ALL)
#endif

/* GAFLPL1L */
#ifdef __RL78__
#else
	#define	GAFLPL1L	(gaflpl1.BYTE.gaflpl1l)
#endif

/* GAFLPL1H */
#ifdef __RL78__
#else
	#define	GAFLPL1H	(gaflpl1.BYTE.gaflpl1h)
#endif

/* GAFLPL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl1l;
	SFR_UNSIGNED_SHORT_INT	gaflpl1h;
}SFR_BYTE_GAFLPL1;

typedef union{
	SFR_BYTE_GAFLPL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL1;

SFR_GLOBAL	SFR_GAFLPL1	gaflpl1;

#ifdef __RL78__
#else
	#define	GAFLPL1	(gaflpl1.ALL)
#endif

/* GAFLPH1L */
#ifdef __RL78__
#else
	#define	GAFLPH1L	(gaflph1.BYTE.gaflph1l)
#endif

/* GAFLPH1H */
#ifdef __RL78__
#else
	#define	GAFLPH1H	(gaflph1.BYTE.gaflph1h)
#endif

/* GAFLPH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph1l;
	SFR_UNSIGNED_SHORT_INT	gaflph1h;
}SFR_BYTE_GAFLPH1;

typedef union{
	SFR_BYTE_GAFLPH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH1;

SFR_GLOBAL	SFR_GAFLPH1	gaflph1;

#ifdef __RL78__
#else
	#define	GAFLPH1	(gaflph1.ALL)
#endif

/* GAFLIDL2L */
#ifdef __RL78__
#else
	#define	GAFLIDL2L	(gaflidl2.BYTE.gaflidl2l)
#endif

/* GAFLIDL2H */
#ifdef __RL78__
#else
	#define	GAFLIDL2H	(gaflidl2.BYTE.gaflidl2h)
#endif

/* GAFLIDL2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl2l;
	SFR_UNSIGNED_SHORT_INT	gaflidl2h;
}SFR_BYTE_GAFLIDL2;

typedef union{
	SFR_BYTE_GAFLIDL2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL2;

SFR_GLOBAL	SFR_GAFLIDL2	gaflidl2;

#ifdef __RL78__
#else
	#define	GAFLIDL2	(gaflidl2.ALL)
#endif

/* GAFLIDH2L */
#ifdef __RL78__
#else
	#define	GAFLIDH2L	(gaflidh2.BYTE.gaflidh2l)
#endif

/* GAFLIDH2H */
#ifdef __RL78__
#else
	#define	GAFLIDH2H	(gaflidh2.BYTE.gaflidh2h)
#endif

/* GAFLIDH2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh2l;
	SFR_UNSIGNED_SHORT_INT	gaflidh2h;
}SFR_BYTE_GAFLIDH2;

typedef union{
	SFR_BYTE_GAFLIDH2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH2;

SFR_GLOBAL	SFR_GAFLIDH2	gaflidh2;

#ifdef __RL78__
#else
	#define	GAFLIDH2	(gaflidh2.ALL)
#endif

/* GAFLML2L */
#ifdef __RL78__
#else
	#define	GAFLML2L	(gaflml2.BYTE.gaflml2l)
#endif

/* GAFLML2H */
#ifdef __RL78__
#else
	#define	GAFLML2H	(gaflml2.BYTE.gaflml2h)
#endif

/* GAFLML2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml2l;
	SFR_UNSIGNED_SHORT_INT	gaflml2h;
}SFR_BYTE_GAFLML2;

typedef union{
	SFR_BYTE_GAFLML2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML2;

SFR_GLOBAL	SFR_GAFLML2	gaflml2;

#ifdef __RL78__
#else
	#define	GAFLML2	(gaflml2.ALL)
#endif

/* GAFLMH2L */
#ifdef __RL78__
#else
	#define	GAFLMH2L	(gaflmh2.BYTE.gaflmh2l)
#endif

/* GAFLMH2H */
#ifdef __RL78__
#else
	#define	GAFLMH2H	(gaflmh2.BYTE.gaflmh2h)
#endif

/* GAFLMH2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh2l;
	SFR_UNSIGNED_SHORT_INT	gaflmh2h;
}SFR_BYTE_GAFLMH2;

typedef union{
	SFR_BYTE_GAFLMH2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH2;

SFR_GLOBAL	SFR_GAFLMH2	gaflmh2;

#ifdef __RL78__
#else
	#define	GAFLMH2	(gaflmh2.ALL)
#endif

/* GAFLPL2L */
#ifdef __RL78__
#else
	#define	GAFLPL2L	(gaflpl2.BYTE.gaflpl2l)
#endif

/* GAFLPL2H */
#ifdef __RL78__
#else
	#define	GAFLPL2H	(gaflpl2.BYTE.gaflpl2h)
#endif

/* GAFLPL2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl2l;
	SFR_UNSIGNED_SHORT_INT	gaflpl2h;
}SFR_BYTE_GAFLPL2;

typedef union{
	SFR_BYTE_GAFLPL2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL2;

SFR_GLOBAL	SFR_GAFLPL2	gaflpl2;

#ifdef __RL78__
#else
	#define	GAFLPL2	(gaflpl2.ALL)
#endif

/* GAFLPH2L */
#ifdef __RL78__
#else
	#define	GAFLPH2L	(gaflph2.BYTE.gaflph2l)
#endif

/* GAFLPH2H */
#ifdef __RL78__
#else
	#define	GAFLPH2H	(gaflph2.BYTE.gaflph2h)
#endif

/* GAFLPH2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph2l;
	SFR_UNSIGNED_SHORT_INT	gaflph2h;
}SFR_BYTE_GAFLPH2;

typedef union{
	SFR_BYTE_GAFLPH2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH2;

SFR_GLOBAL	SFR_GAFLPH2	gaflph2;

#ifdef __RL78__
#else
	#define	GAFLPH2	(gaflph2.ALL)
#endif

/* GAFLIDL3L */
#ifdef __RL78__
#else
	#define	GAFLIDL3L	(gaflidl3.BYTE.gaflidl3l)
#endif

