turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDL3H */
#ifdef __RL78__
#else
	#define	GAFLIDL3H	(gaflidl3.BYTE.gaflidl3h)
#endif

/* GAFLIDL3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl3l;
	SFR_UNSIGNED_SHORT_INT	gaflidl3h;
}SFR_BYTE_GAFLIDL3;

typedef union{
	SFR_BYTE_GAFLIDL3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL3;

SFR_GLOBAL	SFR_GAFLIDL3	gaflidl3;

#ifdef __RL78__
#else
	#define	GAFLIDL3	(gaflidl3.ALL)
#endif

/* GAFLIDH3L */
#ifdef __RL78__
#else
	#define	GAFLIDH3L	(gaflidh3.BYTE.gaflidh3l)
#endif

/* GAFLIDH3H */
#ifdef __RL78__
#else
	#define	GAFLIDH3H	(gaflidh3.BYTE.gaflidh3h)
#endif

/* GAFLIDH3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh3l;
	SFR_UNSIGNED_SHORT_INT	gaflidh3h;
}SFR_BYTE_GAFLIDH3;

typedef union{
	SFR_BYTE_GAFLIDH3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH3;

SFR_GLOBAL	SFR_GAFLIDH3	gaflidh3;

#ifdef __RL78__
#else
	#define	GAFLIDH3	(gaflidh3.ALL)
#endif

/* GAFLML3L */
#ifdef __RL78__
#else
	#define	GAFLML3L	(gaflml3.BYTE.gaflml3l)
#endif

/* GAFLML3H */
#ifdef __RL78__
#else
	#define	GAFLML3H	(gaflml3.BYTE.gaflml3h)
#endif

/* GAFLML3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml3l;
	SFR_UNSIGNED_SHORT_INT	gaflml3h;
}SFR_BYTE_GAFLML3;

typedef union{
	SFR_BYTE_GAFLML3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML3;

SFR_GLOBAL	SFR_GAFLML3	gaflml3;

#ifdef __RL78__
#else
	#define	GAFLML3	(gaflml3.ALL)
#endif

/* GAFLMH3L */
#ifdef __RL78__
#else
	#define	GAFLMH3L	(gaflmh3.BYTE.gaflmh3l)
#endif

/* GAFLMH3H */
#ifdef __RL78__
#else
	#define	GAFLMH3H	(gaflmh3.BYTE.gaflmh3h)
#endif

/* GAFLMH3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh3l;
	SFR_UNSIGNED_SHORT_INT	gaflmh3h;
}SFR_BYTE_GAFLMH3;

typedef union{
	SFR_BYTE_GAFLMH3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH3;

SFR_GLOBAL	SFR_GAFLMH3	gaflmh3;

#ifdef __RL78__
#else
	#define	GAFLMH3	(gaflmh3.ALL)
#endif

/* GAFLPL3L */
#ifdef __RL78__
#else
	#define	GAFLPL3L	(gaflpl3.BYTE.gaflpl3l)
#endif

/* GAFLPL3H */
#ifdef __RL78__
#else
	#define	GAFLPL3H	(gaflpl3.BYTE.gaflpl3h)
#endif

/* GAFLPL3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl3l;
	SFR_UNSIGNED_SHORT_INT	gaflpl3h;
}SFR_BYTE_GAFLPL3;

typedef union{
	SFR_BYTE_GAFLPL3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL3;

SFR_GLOBAL	SFR_GAFLPL3	gaflpl3;

#ifdef __RL78__
#else
	#define	GAFLPL3	(gaflpl3.ALL)
#endif

/* GAFLPH3L */
#ifdef __RL78__
#else
	#define	GAFLPH3L	(gaflph3.BYTE.gaflph3l)
#endif

/* GAFLPH3H */
#ifdef __RL78__
#else
	#define	GAFLPH3H	(gaflph3.BYTE.gaflph3h)
#endif

/* GAFLPH3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph3l;
	SFR_UNSIGNED_SHORT_INT	gaflph3h;
}SFR_BYTE_GAFLPH3;

typedef union{
	SFR_BYTE_GAFLPH3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH3;

SFR_GLOBAL	SFR_GAFLPH3	gaflph3;

#ifdef __RL78__
#else
	#define	GAFLPH3	(gaflph3.ALL)
#endif

/* GAFLIDL4L */
#ifdef __RL78__
#else
	#define	GAFLIDL4L	(gaflidl4.BYTE.gaflidl4l)
#endif

/* GAFLIDL4H */
#ifdef __RL78__
#else
	#define	GAFLIDL4H	(gaflidl4.BYTE.gaflidl4h)
#endif

/* GAFLIDL4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl4l;
	SFR_UNSIGNED_SHORT_INT	gaflidl4h;
}SFR_BYTE_GAFLIDL4;

typedef union{
	SFR_BYTE_GAFLIDL4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL4;

SFR_GLOBAL	SFR_GAFLIDL4	gaflidl4;

#ifdef __RL78__
#else
	#define	GAFLIDL4	(gaflidl4.ALL)
#endif

/* GAFLIDH4L */
#ifdef __RL78__
#else
	#define	GAFLIDH4L	(gaflidh4.BYTE.gaflidh4l)
#endif

/* GAFLIDH4H */
#ifdef __RL78__
#else
	#define	GAFLIDH4H	(gaflidh4.BYTE.gaflidh4h)
#endif

/* GAFLIDH4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh4l;
	SFR_UNSIGNED_SHORT_INT	gaflidh4h;
}SFR_BYTE_GAFLIDH4;

typedef union{
	SFR_BYTE_GAFLIDH4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH4;

SFR_GLOBAL	SFR_GAFLIDH4	gaflidh4;

#ifdef __RL78__
#else
	#define	GAFLIDH4	(gaflidh4.ALL)
#endif

/* GAFLML4L */
#ifdef __RL78__
#else
	#define	GAFLML4L	(gaflml4.BYTE.gaflml4l)
#endif

/* GAFLML4H */
#ifdef __RL78__
#else
	#define	GAFLML4H	(gaflml4.BYTE.gaflml4h)
#endif

/* GAFLML4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml4l;
	SFR_UNSIGNED_SHORT_INT	gaflml4h;
}SFR_BYTE_GAFLML4;

typedef union{
	SFR_BYTE_GAFLML4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML4;

SFR_GLOBAL	SFR_GAFLML4	gaflml4;

#ifdef __RL78__
#else
	#define	GAFLML4	(gaflml4.ALL)
#endif

/* GAFLMH4L */
#ifdef __RL78__
#else
	#define	GAFLMH4L	(gaflmh4.BYTE.gaflmh4l)
#endif

/* GAFLMH4H */
#ifdef __RL78__
#else
	#define	GAFLMH4H	(gaflmh4.BYTE.gaflmh4h)
#endif

/* GAFLMH4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh4l;
	SFR_UNSIGNED_SHORT_INT	gaflmh4h;
}SFR_BYTE_GAFLMH4;

typedef union{
	SFR_BYTE_GAFLMH4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH4;

SFR_GLOBAL	SFR_GAFLMH4	gaflmh4;

#ifdef __RL78__
#else
	#define	GAFLMH4	(gaflmh4.ALL)
#endif

/* GAFLPL4L */
#ifdef __RL78__
#else
	#define	GAFLPL4L	(gaflpl4.BYTE.gaflpl4l)
#endif

/* GAFLPL4H */
#ifdef __RL78__
#else
	#define	GAFLPL4H	(gaflpl4.BYTE.gaflpl4h)
#endif

/* GAFLPL4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl4l;
	SFR_UNSIGNED_SHORT_INT	gaflpl4h;
}SFR_BYTE_GAFLPL4;

typedef union{
	SFR_BYTE_GAFLPL4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL4;

SFR_GLOBAL	SFR_GAFLPL4	gaflpl4;

#ifdef __RL78__
#else
	#define	GAFLPL4	(gaflpl4.ALL)
#endif

/* GAFLPH4L */
#ifdef __RL78__
#else
	#define	GAFLPH4L	(gaflph4.BYTE.gaflph4l)
#endif

/* GAFLPH4H */
#ifdef __RL78__
#else
	#define	GAFLPH4H	(gaflph4.BYTE.gaflph4h)
#endif

/* GAFLPH4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph4l;
	SFR_UNSIGNED_SHORT_INT	gaflph4h;
}SFR_BYTE_GAFLPH4;

typedef union{
	SFR_BYTE_GAFLPH4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH4;

SFR_GLOBAL	SFR_GAFLPH4	gaflph4;

#ifdef __RL78__
#else
	#define	GAFLPH4	(gaflph4.ALL)
#endif

/* GAFLIDL5L */
#ifdef __RL78__
#else
	#define	GAFLIDL5L	(gaflidl5.BYTE.gaflidl5l)
#endif

