turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDL5H */
#ifdef __RL78__
#else
	#define	GAFLIDL5H	(gaflidl5.BYTE.gaflidl5h)
#endif

/* GAFLIDL5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl5l;
	SFR_UNSIGNED_SHORT_INT	gaflidl5h;
}SFR_BYTE_GAFLIDL5;

typedef union{
	SFR_BYTE_GAFLIDL5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL5;

SFR_GLOBAL	SFR_GAFLIDL5	gaflidl5;

#ifdef __RL78__
#else
	#define	GAFLIDL5	(gaflidl5.ALL)
#endif

/* GAFLIDH5L */
#ifdef __RL78__
#else
	#define	GAFLIDH5L	(gaflidh5.BYTE.gaflidh5l)
#endif

/* GAFLIDH5H */
#ifdef __RL78__
#else
	#define	GAFLIDH5H	(gaflidh5.BYTE.gaflidh5h)
#endif

/* GAFLIDH5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh5l;
	SFR_UNSIGNED_SHORT_INT	gaflidh5h;
}SFR_BYTE_GAFLIDH5;

typedef union{
	SFR_BYTE_GAFLIDH5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH5;

SFR_GLOBAL	SFR_GAFLIDH5	gaflidh5;

#ifdef __RL78__
#else
	#define	GAFLIDH5	(gaflidh5.ALL)
#endif

/* GAFLML5L */
#ifdef __RL78__
#else
	#define	GAFLML5L	(gaflml5.BYTE.gaflml5l)
#endif

/* GAFLML5H */
#ifdef __RL78__
#else
	#define	GAFLML5H	(gaflml5.BYTE.gaflml5h)
#endif

/* GAFLML5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml5l;
	SFR_UNSIGNED_SHORT_INT	gaflml5h;
}SFR_BYTE_GAFLML5;

typedef union{
	SFR_BYTE_GAFLML5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML5;

SFR_GLOBAL	SFR_GAFLML5	gaflml5;

#ifdef __RL78__
#else
	#define	GAFLML5	(gaflml5.ALL)
#endif

/* GAFLMH5L */
#ifdef __RL78__
#else
	#define	GAFLMH5L	(gaflmh5.BYTE.gaflmh5l)
#endif

/* GAFLMH5H */
#ifdef __RL78__
#else
	#define	GAFLMH5H	(gaflmh5.BYTE.gaflmh5h)
#endif

/* GAFLMH5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh5l;
	SFR_UNSIGNED_SHORT_INT	gaflmh5h;
}SFR_BYTE_GAFLMH5;

typedef union{
	SFR_BYTE_GAFLMH5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH5;

SFR_GLOBAL	SFR_GAFLMH5	gaflmh5;

#ifdef __RL78__
#else
	#define	GAFLMH5	(gaflmh5.ALL)
#endif

/* GAFLPL5L */
#ifdef __RL78__
#else
	#define	GAFLPL5L	(gaflpl5.BYTE.gaflpl5l)
#endif

/* GAFLPL5H */
#ifdef __RL78__
#else
	#define	GAFLPL5H	(gaflpl5.BYTE.gaflpl5h)
#endif

/* GAFLPL5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl5l;
	SFR_UNSIGNED_SHORT_INT	gaflpl5h;
}SFR_BYTE_GAFLPL5;

typedef union{
	SFR_BYTE_GAFLPL5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL5;

SFR_GLOBAL	SFR_GAFLPL5	gaflpl5;

#ifdef __RL78__
#else
	#define	GAFLPL5	(gaflpl5.ALL)
#endif

/* GAFLPH5L */
#ifdef __RL78__
#else
	#define	GAFLPH5L	(gaflph5.BYTE.gaflph5l)
#endif

/* GAFLPH5H */
#ifdef __RL78__
#else
	#define	GAFLPH5H	(gaflph5.BYTE.gaflph5h)
#endif

/* GAFLPH5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph5l;
	SFR_UNSIGNED_SHORT_INT	gaflph5h;
}SFR_BYTE_GAFLPH5;

typedef union{
	SFR_BYTE_GAFLPH5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH5;

SFR_GLOBAL	SFR_GAFLPH5	gaflph5;

#ifdef __RL78__
#else
	#define	GAFLPH5	(gaflph5.ALL)
#endif

/* GAFLIDL6L */
#ifdef __RL78__
#else
	#define	GAFLIDL6L	(gaflidl6.BYTE.gaflidl6l)
#endif

/* GAFLIDL6H */
#ifdef __RL78__
#else
	#define	GAFLIDL6H	(gaflidl6.BYTE.gaflidl6h)
#endif

/* GAFLIDL6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl6l;
	SFR_UNSIGNED_SHORT_INT	gaflidl6h;
}SFR_BYTE_GAFLIDL6;

typedef union{
	SFR_BYTE_GAFLIDL6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL6;

SFR_GLOBAL	SFR_GAFLIDL6	gaflidl6;

#ifdef __RL78__
#else
	#define	GAFLIDL6	(gaflidl6.ALL)
#endif

/* GAFLIDH6L */
#ifdef __RL78__
#else
	#define	GAFLIDH6L	(gaflidh6.BYTE.gaflidh6l)
#endif

/* GAFLIDH6H */
#ifdef __RL78__
#else
	#define	GAFLIDH6H	(gaflidh6.BYTE.gaflidh6h)
#endif

/* GAFLIDH6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh6l;
	SFR_UNSIGNED_SHORT_INT	gaflidh6h;
}SFR_BYTE_GAFLIDH6;

typedef union{
	SFR_BYTE_GAFLIDH6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH6;

SFR_GLOBAL	SFR_GAFLIDH6	gaflidh6;

#ifdef __RL78__
#else
	#define	GAFLIDH6	(gaflidh6.ALL)
#endif

/* GAFLML6L */
#ifdef __RL78__
#else
	#define	GAFLML6L	(gaflml6.BYTE.gaflml6l)
#endif

/* GAFLML6H */
#ifdef __RL78__
#else
	#define	GAFLML6H	(gaflml6.BYTE.gaflml6h)
#endif

/* GAFLML6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml6l;
	SFR_UNSIGNED_SHORT_INT	gaflml6h;
}SFR_BYTE_GAFLML6;

typedef union{
	SFR_BYTE_GAFLML6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML6;

SFR_GLOBAL	SFR_GAFLML6	gaflml6;

#ifdef __RL78__
#else
	#define	GAFLML6	(gaflml6.ALL)
#endif

/* GAFLMH6L */
#ifdef __RL78__
#else
	#define	GAFLMH6L	(gaflmh6.BYTE.gaflmh6l)
#endif

/* GAFLMH6H */
#ifdef __RL78__
#else
	#define	GAFLMH6H	(gaflmh6.BYTE.gaflmh6h)
#endif

/* GAFLMH6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh6l;
	SFR_UNSIGNED_SHORT_INT	gaflmh6h;
}SFR_BYTE_GAFLMH6;

typedef union{
	SFR_BYTE_GAFLMH6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH6;

SFR_GLOBAL	SFR_GAFLMH6	gaflmh6;

#ifdef __RL78__
#else
	#define	GAFLMH6	(gaflmh6.ALL)
#endif

/* GAFLPL6L */
#ifdef __RL78__
#else
	#define	GAFLPL6L	(gaflpl6.BYTE.gaflpl6l)
#endif

/* GAFLPL6H */
#ifdef __RL78__
#else
	#define	GAFLPL6H	(gaflpl6.BYTE.gaflpl6h)
#endif

/* GAFLPL6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl6l;
	SFR_UNSIGNED_SHORT_INT	gaflpl6h;
}SFR_BYTE_GAFLPL6;

typedef union{
	SFR_BYTE_GAFLPL6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL6;

SFR_GLOBAL	SFR_GAFLPL6	gaflpl6;

#ifdef __RL78__
#else
	#define	GAFLPL6	(gaflpl6.ALL)
#endif

/* GAFLPH6L */
#ifdef __RL78__
#else
	#define	GAFLPH6L	(gaflph6.BYTE.gaflph6l)
#endif

/* GAFLPH6H */
#ifdef __RL78__
#else
	#define	GAFLPH6H	(gaflph6.BYTE.gaflph6h)
#endif

/* GAFLPH6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph6l;
	SFR_UNSIGNED_SHORT_INT	gaflph6h;
}SFR_BYTE_GAFLPH6;

typedef union{
	SFR_BYTE_GAFLPH6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH6;

SFR_GLOBAL	SFR_GAFLPH6	gaflph6;

#ifdef __RL78__
#else
	#define	GAFLPH6	(gaflph6.ALL)
#endif

/* GAFLIDL7L */
#ifdef __RL78__
#else
	#define	GAFLIDL7L	(gaflidl7.BYTE.gaflidl7l)
#endif

