turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDL7H */
#ifdef __RL78__
#else
	#define	GAFLIDL7H	(gaflidl7.BYTE.gaflidl7h)
#endif

/* GAFLIDL7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl7l;
	SFR_UNSIGNED_SHORT_INT	gaflidl7h;
}SFR_BYTE_GAFLIDL7;

typedef union{
	SFR_BYTE_GAFLIDL7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL7;

SFR_GLOBAL	SFR_GAFLIDL7	gaflidl7;

#ifdef __RL78__
#else
	#define	GAFLIDL7	(gaflidl7.ALL)
#endif

/* GAFLIDH7L */
#ifdef __RL78__
#else
	#define	GAFLIDH7L	(gaflidh7.BYTE.gaflidh7l)
#endif

/* GAFLIDH7H */
#ifdef __RL78__
#else
	#define	GAFLIDH7H	(gaflidh7.BYTE.gaflidh7h)
#endif

/* GAFLIDH7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh7l;
	SFR_UNSIGNED_SHORT_INT	gaflidh7h;
}SFR_BYTE_GAFLIDH7;

typedef union{
	SFR_BYTE_GAFLIDH7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH7;

SFR_GLOBAL	SFR_GAFLIDH7	gaflidh7;

#ifdef __RL78__
#else
	#define	GAFLIDH7	(gaflidh7.ALL)
#endif

/* GAFLML7L */
#ifdef __RL78__
#else
	#define	GAFLML7L	(gaflml7.BYTE.gaflml7l)
#endif

/* GAFLML7H */
#ifdef __RL78__
#else
	#define	GAFLML7H	(gaflml7.BYTE.gaflml7h)
#endif

/* GAFLML7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml7l;
	SFR_UNSIGNED_SHORT_INT	gaflml7h;
}SFR_BYTE_GAFLML7;

typedef union{
	SFR_BYTE_GAFLML7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML7;

SFR_GLOBAL	SFR_GAFLML7	gaflml7;

#ifdef __RL78__
#else
	#define	GAFLML7	(gaflml7.ALL)
#endif

/* GAFLMH7L */
#ifdef __RL78__
#else
	#define	GAFLMH7L	(gaflmh7.BYTE.gaflmh7l)
#endif

/* GAFLMH7H */
#ifdef __RL78__
#else
	#define	GAFLMH7H	(gaflmh7.BYTE.gaflmh7h)
#endif

/* GAFLMH7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh7l;
	SFR_UNSIGNED_SHORT_INT	gaflmh7h;
}SFR_BYTE_GAFLMH7;

typedef union{
	SFR_BYTE_GAFLMH7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH7;

SFR_GLOBAL	SFR_GAFLMH7	gaflmh7;

#ifdef __RL78__
#else
	#define	GAFLMH7	(gaflmh7.ALL)
#endif

/* GAFLPL7L */
#ifdef __RL78__
#else
	#define	GAFLPL7L	(gaflpl7.BYTE.gaflpl7l)
#endif

/* GAFLPL7H */
#ifdef __RL78__
#else
	#define	GAFLPL7H	(gaflpl7.BYTE.gaflpl7h)
#endif

/* GAFLPL7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl7l;
	SFR_UNSIGNED_SHORT_INT	gaflpl7h;
}SFR_BYTE_GAFLPL7;

typedef union{
	SFR_BYTE_GAFLPL7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL7;

SFR_GLOBAL	SFR_GAFLPL7	gaflpl7;

#ifdef __RL78__
#else
	#define	GAFLPL7	(gaflpl7.ALL)
#endif

/* GAFLPH7L */
#ifdef __RL78__
#else
	#define	GAFLPH7L	(gaflph7.BYTE.gaflph7l)
#endif

/* GAFLPH7H */
#ifdef __RL78__
#else
	#define	GAFLPH7H	(gaflph7.BYTE.gaflph7h)
#endif

/* GAFLPH7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph7l;
	SFR_UNSIGNED_SHORT_INT	gaflph7h;
}SFR_BYTE_GAFLPH7;

typedef union{
	SFR_BYTE_GAFLPH7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH7;

SFR_GLOBAL	SFR_GAFLPH7	gaflph7;

#ifdef __RL78__
#else
	#define	GAFLPH7	(gaflph7.ALL)
#endif


/* GAFLIDL8L */
#ifdef __RL78__
#else
	#define	GAFLIDL8L	(gaflidl8.BYTE.gaflidl8l)
#endif

/* GAFLIDL8H */
#ifdef __RL78__
#else
	#define	GAFLIDL8H	(gaflidl8.BYTE.gaflidl8h)
#endif

/* GAFLIDL8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl8l;
	SFR_UNSIGNED_SHORT_INT	gaflidl8h;
}SFR_BYTE_GAFLIDL8;

typedef union{
	SFR_BYTE_GAFLIDL8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL8;

SFR_GLOBAL	SFR_GAFLIDL8	gaflidl8;

#ifdef __RL78__
#else
	#define	GAFLIDL8	(gaflidl8.ALL)
#endif

/* GAFLIDH8L */
#ifdef __RL78__
#else
	#define	GAFLIDH8L	(gaflidh8.BYTE.gaflidh8l)
#endif

/* GAFLIDH8H */
#ifdef __RL78__
#else
	#define	GAFLIDH8H	(gaflidh8.BYTE.gaflidh8h)
#endif

/* GAFLIDH8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh8l;
	SFR_UNSIGNED_SHORT_INT	gaflidh8h;
}SFR_BYTE_GAFLIDH8;

typedef union{
	SFR_BYTE_GAFLIDH8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH8;

SFR_GLOBAL	SFR_GAFLIDH8	gaflidh8;

#ifdef __RL78__
#else
	#define	GAFLIDH8	(gaflidh8.ALL)
#endif

/* GAFLML8L */
#ifdef __RL78__
#else
	#define	GAFLML8L	(gaflml8.BYTE.gaflml8l)
#endif

/* GAFLML8H */
#ifdef __RL78__
#else
	#define	GAFLML8H	(gaflml8.BYTE.gaflml8h)
#endif

/* GAFLML8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml8l;
	SFR_UNSIGNED_SHORT_INT	gaflml8h;
}SFR_BYTE_GAFLML8;

typedef union{
	SFR_BYTE_GAFLML8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML8;

SFR_GLOBAL	SFR_GAFLML8	gaflml8;

#ifdef __RL78__
#else
	#define	GAFLML8	(gaflml8.ALL)
#endif

/* GAFLMH8L */
#ifdef __RL78__
#else
	#define	GAFLMH8L	(gaflmh8.BYTE.gaflmh8l)
#endif

/* GAFLMH8H */
#ifdef __RL78__
#else
	#define	GAFLMH8H	(gaflmh8.BYTE.gaflmh8h)
#endif

/* GAFLMH8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh8l;
	SFR_UNSIGNED_SHORT_INT	gaflmh8h;
}SFR_BYTE_GAFLMH8;

typedef union{
	SFR_BYTE_GAFLMH8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH8;

SFR_GLOBAL	SFR_GAFLMH8	gaflmh8;

#ifdef __RL78__
#else
	#define	GAFLMH8	(gaflmh8.ALL)
#endif

/* GAFLPL8L */
#ifdef __RL78__
#else
	#define	GAFLPL8L	(gaflpl8.BYTE.gaflpl8l)
#endif

/* GAFLPL8H */
#ifdef __RL78__
#else
	#define	GAFLPL8H	(gaflpl8.BYTE.gaflpl8h)
#endif

/* GAFLPL8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl8l;
	SFR_UNSIGNED_SHORT_INT	gaflpl8h;
}SFR_BYTE_GAFLPL8;

typedef union{
	SFR_BYTE_GAFLPL8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL8;

SFR_GLOBAL	SFR_GAFLPL8	gaflpl8;

#ifdef __RL78__
#else
	#define	GAFLPL8	(gaflpl8.ALL)
#endif

/* GAFLPH8L */
#ifdef __RL78__
#else
	#define	GAFLPH8L	(gaflph8.BYTE.gaflph8l)
#endif

/* GAFLPH8H */
#ifdef __RL78__
#else
	#define	GAFLPH8H	(gaflph8.BYTE.gaflph8h)
#endif

/* GAFLPH8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph8l;
	SFR_UNSIGNED_SHORT_INT	gaflph8h;
}SFR_BYTE_GAFLPH8;

typedef union{
	SFR_BYTE_GAFLPH8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH8;

SFR_GLOBAL	SFR_GAFLPH8	gaflph8;

#ifdef __RL78__
#else
	#define	GAFLPH8	(gaflph8.ALL)
#endif

/* GAFLIDL9L */
#ifdef __RL78__
#else
	#define	GAFLIDL9L	(gaflidl9.BYTE.gaflidl9l)
#endif

/* GAFLIDL9H */
#ifdef __RL78__
#else
	#define	GAFLIDL9H	(gaflidl9.BYTE.gaflidl9h)
#endif

/* GAFLIDL9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl9l;
	SFR_UNSIGNED_SHORT_INT	gaflidl9h;
}SFR_BYTE_GAFLIDL9;

typedef union{
	SFR_BYTE_GAFLIDL9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL9;

SFR_GLOBAL	SFR_GAFLIDL9	gaflidl9;

#ifdef __RL78__
#else
	#define	GAFLIDL9	(gaflidl9.ALL)
#endif

