turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDH9L */
#ifdef __RL78__
#else
	#define	GAFLIDH9L	(gaflidh9.BYTE.gaflidh9l)
#endif

/* GAFLIDH9H */
#ifdef __RL78__
#else
	#define	GAFLIDH9H	(gaflidh9.BYTE.gaflidh9h)
#endif

/* GAFLIDH9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh9l;
	SFR_UNSIGNED_SHORT_INT	gaflidh9h;
}SFR_BYTE_GAFLIDH9;

typedef union{
	SFR_BYTE_GAFLIDH9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH9;

SFR_GLOBAL	SFR_GAFLIDH9	gaflidh9;

#ifdef __RL78__
#else
	#define	GAFLIDH9	(gaflidh9.ALL)
#endif

/* GAFLML9L */
#ifdef __RL78__
#else
	#define	GAFLML9L	(gaflml9.BYTE.gaflml9l)
#endif

/* GAFLML9H */
#ifdef __RL78__
#else
	#define	GAFLML9H	(gaflml9.BYTE.gaflml9h)
#endif

/* GAFLML9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml9l;
	SFR_UNSIGNED_SHORT_INT	gaflml9h;
}SFR_BYTE_GAFLML9;

typedef union{
	SFR_BYTE_GAFLML9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML9;

SFR_GLOBAL	SFR_GAFLML9	gaflml9;

#ifdef __RL78__
#else
	#define	GAFLML9	(gaflml9.ALL)
#endif

/* GAFLMH9L */
#ifdef __RL78__
#else
	#define	GAFLMH9L	(gaflmh9.BYTE.gaflmh9l)
#endif

/* GAFLMH9H */
#ifdef __RL78__
#else
	#define	GAFLMH9H	(gaflmh9.BYTE.gaflmh9h)
#endif

/* GAFLMH9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh9l;
	SFR_UNSIGNED_SHORT_INT	gaflmh9h;
}SFR_BYTE_GAFLMH9;

typedef union{
	SFR_BYTE_GAFLMH9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH9;

SFR_GLOBAL	SFR_GAFLMH9	gaflmh9;

#ifdef __RL78__
#else
	#define	GAFLMH9	(gaflmh9.ALL)
#endif

/* GAFLPL9L */
#ifdef __RL78__
#else
	#define	GAFLPL9L	(gaflpl9.BYTE.gaflpl9l)
#endif

/* GAFLPL9H */
#ifdef __RL78__
#else
	#define	GAFLPL9H	(gaflpl9.BYTE.gaflpl9h)
#endif

/* GAFLPL9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl9l;
	SFR_UNSIGNED_SHORT_INT	gaflpl9h;
}SFR_BYTE_GAFLPL9;

typedef union{
	SFR_BYTE_GAFLPL9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL9;

SFR_GLOBAL	SFR_GAFLPL9	gaflpl9;

#ifdef __RL78__
#else
	#define	GAFLPL9	(gaflpl9.ALL)
#endif

/* GAFLPH9L */
#ifdef __RL78__
#else
	#define	GAFLPH9L	(gaflph9.BYTE.gaflph9l)
#endif

/* GAFLPH9H */
#ifdef __RL78__
#else
	#define	GAFLPH9H	(gaflph9.BYTE.gaflph9h)
#endif

/* GAFLPH9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph9l;
	SFR_UNSIGNED_SHORT_INT	gaflph9h;
}SFR_BYTE_GAFLPH9;

typedef union{
	SFR_BYTE_GAFLPH9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH9;

SFR_GLOBAL	SFR_GAFLPH9	gaflph9;

#ifdef __RL78__
#else
	#define	GAFLPH9	(gaflph9.ALL)
#endif

/* GAFLIDL10L */
#ifdef __RL78__
#else
	#define	GAFLIDL10L	(gaflidl10.BYTE.gaflidl10l)
#endif

/* GAFLIDL10H */
#ifdef __RL78__
#else
	#define	GAFLIDL10H	(gaflidl10.BYTE.gaflidl10h)
#endif

/* GAFLIDL10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl10l;
	SFR_UNSIGNED_SHORT_INT	gaflidl10h;
}SFR_BYTE_GAFLIDL10;

typedef union{
	SFR_BYTE_GAFLIDL10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL10;

SFR_GLOBAL	SFR_GAFLIDL10	gaflidl10;

#ifdef __RL78__
#else
	#define	GAFLIDL10	(gaflidl10.ALL)
#endif

/* GAFLIDH10L */
#ifdef __RL78__
#else
	#define	GAFLIDH10L	(gaflidh10.BYTE.gaflidh10l)
#endif

/* GAFLIDH10H */
#ifdef __RL78__
#else
	#define	GAFLIDH10H	(gaflidh10.BYTE.gaflidh10h)
#endif

/* GAFLIDH10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh10l;
	SFR_UNSIGNED_SHORT_INT	gaflidh10h;
}SFR_BYTE_GAFLIDH10;

typedef union{
	SFR_BYTE_GAFLIDH10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH10;

SFR_GLOBAL	SFR_GAFLIDH10	gaflidh10;

#ifdef __RL78__
#else
	#define	GAFLIDH10	(gaflidh10.ALL)
#endif

/* GAFLML10L */
#ifdef __RL78__
#else
	#define	GAFLML10L	(gaflml10.BYTE.gaflml10l)
#endif

/* GAFLML10H */
#ifdef __RL78__
#else
	#define	GAFLML10H	(gaflml10.BYTE.gaflml10h)
#endif

/* GAFLML10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml10l;
	SFR_UNSIGNED_SHORT_INT	gaflml10h;
}SFR_BYTE_GAFLML10;

typedef union{
	SFR_BYTE_GAFLML10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML10;

SFR_GLOBAL	SFR_GAFLML10	gaflml10;

#ifdef __RL78__
#else
	#define	GAFLML10	(gaflml10.ALL)
#endif

/* GAFLMH10L */
#ifdef __RL78__
#else
	#define	GAFLMH10L	(gaflmh10.BYTE.gaflmh10l)
#endif

/* GAFLMH10H */
#ifdef __RL78__
#else
	#define	GAFLMH10H	(gaflmh10.BYTE.gaflmh10h)
#endif

/* GAFLMH10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh10l;
	SFR_UNSIGNED_SHORT_INT	gaflmh10h;
}SFR_BYTE_GAFLMH10;

typedef union{
	SFR_BYTE_GAFLMH10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH10;

SFR_GLOBAL	SFR_GAFLMH10	gaflmh10;

#ifdef __RL78__
#else
	#define	GAFLMH10	(gaflmh10.ALL)
#endif

/* GAFLPL10L */
#ifdef __RL78__
#else
	#define	GAFLPL10L	(gaflpl10.BYTE.gaflpl10l)
#endif

/* GAFLPL10H */
#ifdef __RL78__
#else
	#define	GAFLPL10H	(gaflpl10.BYTE.gaflpl10h)
#endif

/* GAFLPL10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl10l;
	SFR_UNSIGNED_SHORT_INT	gaflpl10h;
}SFR_BYTE_GAFLPL10;

typedef union{
	SFR_BYTE_GAFLPL10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL10;

SFR_GLOBAL	SFR_GAFLPL10	gaflpl10;

#ifdef __RL78__
#else
	#define	GAFLPL10	(gaflpl10.ALL)
#endif

/* GAFLPH10L */
#ifdef __RL78__
#else
	#define	GAFLPH10L	(gaflph10.BYTE.gaflph10l)
#endif

/* GAFLPH10H */
#ifdef __RL78__
#else
	#define	GAFLPH10H	(gaflph10.BYTE.gaflph10h)
#endif

/* GAFLPH10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph10l;
	SFR_UNSIGNED_SHORT_INT	gaflph10h;
}SFR_BYTE_GAFLPH10;

typedef union{
	SFR_BYTE_GAFLPH10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH10;

SFR_GLOBAL	SFR_GAFLPH10	gaflph10;

#ifdef __RL78__
#else
	#define	GAFLPH10	(gaflph10.ALL)
#endif

/* GAFLIDL11L */
#ifdef __RL78__
#else
	#define	GAFLIDL11L	(gaflidl11.BYTE.gaflidl11l)
#endif

/* GAFLIDL11H */
#ifdef __RL78__
#else
	#define	GAFLIDL11H	(gaflidl11.BYTE.gaflidl11h)
#endif

/* GAFLIDL11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl11l;
	SFR_UNSIGNED_SHORT_INT	gaflidl11h;
}SFR_BYTE_GAFLIDL11;

typedef union{
	SFR_BYTE_GAFLIDL11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL11;

SFR_GLOBAL	SFR_GAFLIDL11	gaflidl11;

#ifdef __RL78__
#else
	#define	GAFLIDL11	(gaflidl11.ALL)
#endif

/* GAFLIDH11L */
#ifdef __RL78__
#else
	#define	GAFLIDH11L	(gaflidh11.BYTE.gaflidh11l)
#endif

