turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDH11H */
#ifdef __RL78__
#else
	#define	GAFLIDH11H	(gaflidh11.BYTE.gaflidh11h)
#endif

/* GAFLIDH11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh11l;
	SFR_UNSIGNED_SHORT_INT	gaflidh11h;
}SFR_BYTE_GAFLIDH11;

typedef union{
	SFR_BYTE_GAFLIDH11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH11;

SFR_GLOBAL	SFR_GAFLIDH11	gaflidh11;

#ifdef __RL78__
#else
	#define	GAFLIDH11	(gaflidh11.ALL)
#endif

/* GAFLML11L */
#ifdef __RL78__
#else
	#define	GAFLML11L	(gaflml11.BYTE.gaflml11l)
#endif

/* GAFLML11H */
#ifdef __RL78__
#else
	#define	GAFLML11H	(gaflml11.BYTE.gaflml11h)
#endif

/* GAFLML11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml11l;
	SFR_UNSIGNED_SHORT_INT	gaflml11h;
}SFR_BYTE_GAFLML11;

typedef union{
	SFR_BYTE_GAFLML11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML11;

SFR_GLOBAL	SFR_GAFLML11	gaflml11;

#ifdef __RL78__
#else
	#define	GAFLML11	(gaflml11.ALL)
#endif

/* GAFLMH11L */
#ifdef __RL78__
#else
	#define	GAFLMH11L	(gaflmh11.BYTE.gaflmh11l)
#endif

/* GAFLMH11H */
#ifdef __RL78__
#else
	#define	GAFLMH11H	(gaflmh11.BYTE.gaflmh11h)
#endif

/* GAFLMH11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh11l;
	SFR_UNSIGNED_SHORT_INT	gaflmh11h;
}SFR_BYTE_GAFLMH11;

typedef union{
	SFR_BYTE_GAFLMH11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH11;

SFR_GLOBAL	SFR_GAFLMH11	gaflmh11;

#ifdef __RL78__
#else
	#define	GAFLMH11	(gaflmh11.ALL)
#endif

/* GAFLPL11L */
#ifdef __RL78__
#else
	#define	GAFLPL11L	(gaflpl11.BYTE.gaflpl11l)
#endif

/* GAFLPL11H */
#ifdef __RL78__
#else
	#define	GAFLPL11H	(gaflpl11.BYTE.gaflpl11h)
#endif

/* GAFLPL11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl11l;
	SFR_UNSIGNED_SHORT_INT	gaflpl11h;
}SFR_BYTE_GAFLPL11;

typedef union{
	SFR_BYTE_GAFLPL11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL11;

SFR_GLOBAL	SFR_GAFLPL11	gaflpl11;

#ifdef __RL78__
#else
	#define	GAFLPL11	(gaflpl11.ALL)
#endif

/* GAFLPH11L */
#ifdef __RL78__
#else
	#define	GAFLPH11L	(gaflph11.BYTE.gaflph11l)
#endif

/* GAFLPH11H */
#ifdef __RL78__
#else
	#define	GAFLPH11H	(gaflph11.BYTE.gaflph11h)
#endif

/* GAFLPH11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph11l;
	SFR_UNSIGNED_SHORT_INT	gaflph11h;
}SFR_BYTE_GAFLPH11;

typedef union{
	SFR_BYTE_GAFLPH11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH11;

SFR_GLOBAL	SFR_GAFLPH11	gaflph11;

#ifdef __RL78__
#else
	#define	GAFLPH11	(gaflph11.ALL)
#endif

/* GAFLIDL12L */
#ifdef __RL78__
#else
	#define	GAFLIDL12L	(gaflidl12.BYTE.gaflidl12l)
#endif

/* GAFLIDL12H */
#ifdef __RL78__
#else
	#define	GAFLIDL12H	(gaflidl12.BYTE.gaflidl12h)
#endif

/* GAFLIDL12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl12l;
	SFR_UNSIGNED_SHORT_INT	gaflidl12h;
}SFR_BYTE_GAFLIDL12;

typedef union{
	SFR_BYTE_GAFLIDL12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL12;

SFR_GLOBAL	SFR_GAFLIDL12	gaflidl12;

#ifdef __RL78__
#else
	#define	GAFLIDL12	(gaflidl12.ALL)
#endif

/* GAFLIDH12L */
#ifdef __RL78__
#else
	#define	GAFLIDH12L	(gaflidh12.BYTE.gaflidh12l)
#endif

/* GAFLIDH12H */
#ifdef __RL78__
#else
	#define	GAFLIDH12H	(gaflidh12.BYTE.gaflidh12h)
#endif

/* GAFLIDH12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh12l;
	SFR_UNSIGNED_SHORT_INT	gaflidh12h;
}SFR_BYTE_GAFLIDH12;

typedef union{
	SFR_BYTE_GAFLIDH12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH12;

SFR_GLOBAL	SFR_GAFLIDH12	gaflidh12;

#ifdef __RL78__
#else
	#define	GAFLIDH12	(gaflidh12.ALL)
#endif

/* GAFLML12L */
#ifdef __RL78__
#else
	#define	GAFLML12L	(gaflml12.BYTE.gaflml12l)
#endif

/* GAFLML12H */
#ifdef __RL78__
#else
	#define	GAFLML12H	(gaflml12.BYTE.gaflml12h)
#endif

/* GAFLML12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml12l;
	SFR_UNSIGNED_SHORT_INT	gaflml12h;
}SFR_BYTE_GAFLML12;

typedef union{
	SFR_BYTE_GAFLML12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML12;

SFR_GLOBAL	SFR_GAFLML12	gaflml12;

#ifdef __RL78__
#else
	#define	GAFLML12	(gaflml12.ALL)
#endif

/* GAFLMH12L */
#ifdef __RL78__
#else
	#define	GAFLMH12L	(gaflmh12.BYTE.gaflmh12l)
#endif

/* GAFLMH12H */
#ifdef __RL78__
#else
	#define	GAFLMH12H	(gaflmh12.BYTE.gaflmh12h)
#endif

/* GAFLMH12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh12l;
	SFR_UNSIGNED_SHORT_INT	gaflmh12h;
}SFR_BYTE_GAFLMH12;

typedef union{
	SFR_BYTE_GAFLMH12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH12;

SFR_GLOBAL	SFR_GAFLMH12	gaflmh12;

#ifdef __RL78__
#else
	#define	GAFLMH12	(gaflmh12.ALL)
#endif

/* GAFLPL12L */
#ifdef __RL78__
#else
	#define	GAFLPL12L	(gaflpl12.BYTE.gaflpl12l)
#endif

/* GAFLPL12H */
#ifdef __RL78__
#else
	#define	GAFLPL12H	(gaflpl12.BYTE.gaflpl12h)
#endif

/* GAFLPL12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl12l;
	SFR_UNSIGNED_SHORT_INT	gaflpl12h;
}SFR_BYTE_GAFLPL12;

typedef union{
	SFR_BYTE_GAFLPL12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL12;

SFR_GLOBAL	SFR_GAFLPL12	gaflpl12;

#ifdef __RL78__
#else
	#define	GAFLPL12	(gaflpl12.ALL)
#endif

/* GAFLPH12L */
#ifdef __RL78__
#else
	#define	GAFLPH12L	(gaflph12.BYTE.gaflph12l)
#endif

/* GAFLPH12H */
#ifdef __RL78__
#else
	#define	GAFLPH12H	(gaflph12.BYTE.gaflph12h)
#endif

/* GAFLPH12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph12l;
	SFR_UNSIGNED_SHORT_INT	gaflph12h;
}SFR_BYTE_GAFLPH12;

typedef union{
	SFR_BYTE_GAFLPH12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH12;

SFR_GLOBAL	SFR_GAFLPH12	gaflph12;

#ifdef __RL78__
#else
	#define	GAFLPH12	(gaflph12.ALL)
#endif

/* GAFLIDL13L */
#ifdef __RL78__
#else
	#define	GAFLIDL13L	(gaflidl13.BYTE.gaflidl13l)
#endif

/* GAFLIDL13H */
#ifdef __RL78__
#else
	#define	GAFLIDL13H	(gaflidl13.BYTE.gaflidl13h)
#endif

/* GAFLIDL13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl13l;
	SFR_UNSIGNED_SHORT_INT	gaflidl13h;
}SFR_BYTE_GAFLIDL13;

typedef union{
	SFR_BYTE_GAFLIDL13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL13;

SFR_GLOBAL	SFR_GAFLIDL13	gaflidl13;

#ifdef __RL78__
#else
	#define	GAFLIDL13	(gaflidl13.ALL)
#endif

/* GAFLIDH13L */
#ifdef __RL78__
#else
	#define	GAFLIDH13L	(gaflidh13.BYTE.gaflidh13l)
#endif

