turatsamar/DRV8889/src/rl78_ca78k0r.h
/* GAFLIDH13H */
#ifdef __RL78__
#else
	#define	GAFLIDH13H	(gaflidh13.BYTE.gaflidh13h)
#endif

/* GAFLIDH13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh13l;
	SFR_UNSIGNED_SHORT_INT	gaflidh13h;
}SFR_BYTE_GAFLIDH13;

typedef union{
	SFR_BYTE_GAFLIDH13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH13;

SFR_GLOBAL	SFR_GAFLIDH13	gaflidh13;

#ifdef __RL78__
#else
	#define	GAFLIDH13	(gaflidh13.ALL)
#endif

/* GAFLML13L */
#ifdef __RL78__
#else
	#define	GAFLML13L	(gaflml13.BYTE.gaflml13l)
#endif

/* GAFLML13H */
#ifdef __RL78__
#else
	#define	GAFLML13H	(gaflml13.BYTE.gaflml13h)
#endif

/* GAFLML13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml13l;
	SFR_UNSIGNED_SHORT_INT	gaflml13h;
}SFR_BYTE_GAFLML13;

typedef union{
	SFR_BYTE_GAFLML13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML13;

SFR_GLOBAL	SFR_GAFLML13	gaflml13;

#ifdef __RL78__
#else
	#define	GAFLML13	(gaflml13.ALL)
#endif

/* GAFLMH13L */
#ifdef __RL78__
#else
	#define	GAFLMH13L	(gaflmh13.BYTE.gaflmh13l)
#endif

/* GAFLMH13H */
#ifdef __RL78__
#else
	#define	GAFLMH13H	(gaflmh13.BYTE.gaflmh13h)
#endif

/* GAFLMH13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh13l;
	SFR_UNSIGNED_SHORT_INT	gaflmh13h;
}SFR_BYTE_GAFLMH13;

typedef union{
	SFR_BYTE_GAFLMH13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH13;

SFR_GLOBAL	SFR_GAFLMH13	gaflmh13;

#ifdef __RL78__
#else
	#define	GAFLMH13	(gaflmh13.ALL)
#endif

/* GAFLPL13L */
#ifdef __RL78__
#else
	#define	GAFLPL13L	(gaflpl13.BYTE.gaflpl13l)
#endif

/* GAFLPL13H */
#ifdef __RL78__
#else
	#define	GAFLPL13H	(gaflpl13.BYTE.gaflpl13h)
#endif

/* GAFLPL13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl13l;
	SFR_UNSIGNED_SHORT_INT	gaflpl13h;
}SFR_BYTE_GAFLPL13;

typedef union{
	SFR_BYTE_GAFLPL13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL13;

SFR_GLOBAL	SFR_GAFLPL13	gaflpl13;

#ifdef __RL78__
#else
	#define	GAFLPL13	(gaflpl13.ALL)
#endif

/* GAFLPH13L */
#ifdef __RL78__
#else
	#define	GAFLPH13L	(gaflph13.BYTE.gaflph13l)
#endif

/* GAFLPH13H */
#ifdef __RL78__
#else
	#define	GAFLPH13H	(gaflph13.BYTE.gaflph13h)
#endif

/* GAFLPH13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph13l;
	SFR_UNSIGNED_SHORT_INT	gaflph13h;
}SFR_BYTE_GAFLPH13;

typedef union{
	SFR_BYTE_GAFLPH13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH13;

SFR_GLOBAL	SFR_GAFLPH13	gaflph13;

#ifdef __RL78__
#else
	#define	GAFLPH13	(gaflph13.ALL)
#endif

/* GAFLIDL14L */
#ifdef __RL78__
#else
	#define	GAFLIDL14L	(gaflidl14.BYTE.gaflidl14l)
#endif

/* GAFLIDL14H */
#ifdef __RL78__
#else
	#define	GAFLIDL14H	(gaflidl14.BYTE.gaflidl14h)
#endif

/* GAFLIDL14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl14l;
	SFR_UNSIGNED_SHORT_INT	gaflidl14h;
}SFR_BYTE_GAFLIDL14;

typedef union{
	SFR_BYTE_GAFLIDL14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL14;

SFR_GLOBAL	SFR_GAFLIDL14	gaflidl14;

#ifdef __RL78__
#else
	#define	GAFLIDL14	(gaflidl14.ALL)
#endif

/* GAFLIDH14L */
#ifdef __RL78__
#else
	#define	GAFLIDH14L	(gaflidh14.BYTE.gaflidh14l)
#endif

/* GAFLIDH14H */
#ifdef __RL78__
#else
	#define	GAFLIDH14H	(gaflidh14.BYTE.gaflidh14h)
#endif

/* GAFLIDH14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh14l;
	SFR_UNSIGNED_SHORT_INT	gaflidh14h;
}SFR_BYTE_GAFLIDH14;

typedef union{
	SFR_BYTE_GAFLIDH14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH14;

SFR_GLOBAL	SFR_GAFLIDH14	gaflidh14;

#ifdef __RL78__
#else
	#define	GAFLIDH14	(gaflidh14.ALL)
#endif

/* GAFLML14L */
#ifdef __RL78__
#else
	#define	GAFLML14L	(gaflml14.BYTE.gaflml14l)
#endif

/* GAFLML14H */
#ifdef __RL78__
#else
	#define	GAFLML14H	(gaflml14.BYTE.gaflml14h)
#endif

/* GAFLML14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml14l;
	SFR_UNSIGNED_SHORT_INT	gaflml14h;
}SFR_BYTE_GAFLML14;

typedef union{
	SFR_BYTE_GAFLML14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML14;

SFR_GLOBAL	SFR_GAFLML14	gaflml14;

#ifdef __RL78__
#else
	#define	GAFLML14	(gaflml14.ALL)
#endif

/* GAFLMH14L */
#ifdef __RL78__
#else
	#define	GAFLMH14L	(gaflmh14.BYTE.gaflmh14l)
#endif

/* GAFLMH14H */
#ifdef __RL78__
#else
	#define	GAFLMH14H	(gaflmh14.BYTE.gaflmh14h)
#endif

/* GAFLMH14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh14l;
	SFR_UNSIGNED_SHORT_INT	gaflmh14h;
}SFR_BYTE_GAFLMH14;

typedef union{
	SFR_BYTE_GAFLMH14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH14;

SFR_GLOBAL	SFR_GAFLMH14	gaflmh14;

#ifdef __RL78__
#else
	#define	GAFLMH14	(gaflmh14.ALL)
#endif

/* GAFLPL14L */
#ifdef __RL78__
#else
	#define	GAFLPL14L	(gaflpl14.BYTE.gaflpl14l)
#endif

/* GAFLPL14H */
#ifdef __RL78__
#else
	#define	GAFLPL14H	(gaflpl14.BYTE.gaflpl14h)
#endif

/* GAFLPL14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl14l;
	SFR_UNSIGNED_SHORT_INT	gaflpl14h;
}SFR_BYTE_GAFLPL14;

typedef union{
	SFR_BYTE_GAFLPL14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL14;

SFR_GLOBAL	SFR_GAFLPL14	gaflpl14;

#ifdef __RL78__
#else
	#define	GAFLPL14	(gaflpl14.ALL)
#endif

/* GAFLPH14L */
#ifdef __RL78__
#else
	#define	GAFLPH14L	(gaflph14.BYTE.gaflph14l)
#endif

/* GAFLPH14H */
#ifdef __RL78__
#else
	#define	GAFLPH14H	(gaflph14.BYTE.gaflph14h)
#endif

/* GAFLPH14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph14l;
	SFR_UNSIGNED_SHORT_INT	gaflph14h;
}SFR_BYTE_GAFLPH14;

typedef union{
	SFR_BYTE_GAFLPH14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH14;

SFR_GLOBAL	SFR_GAFLPH14	gaflph14;

#ifdef __RL78__
#else
	#define	GAFLPH14	(gaflph14.ALL)
#endif

/* GAFLIDL15L */
#ifdef __RL78__
#else
	#define	GAFLIDL15L	(gaflidl15.BYTE.gaflidl15l)
#endif

/* GAFLIDL15H */
#ifdef __RL78__
#else
	#define	GAFLIDL15H	(gaflidl15.BYTE.gaflidl15h)
#endif

/* GAFLIDL15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidl15l;
	SFR_UNSIGNED_SHORT_INT	gaflidl15h;
}SFR_BYTE_GAFLIDL15;

typedef union{
	SFR_BYTE_GAFLIDL15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDL15;

