turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_GAFLIDL15	gaflidl15;

#ifdef __RL78__
#else
	#define	GAFLIDL15	(gaflidl15.ALL)
#endif

/* GAFLIDH15L */
#ifdef __RL78__
#else
	#define	GAFLIDH15L	(gaflidh15.BYTE.gaflidh15l)
#endif

/* GAFLIDH15H */
#ifdef __RL78__
#else
	#define	GAFLIDH15H	(gaflidh15.BYTE.gaflidh15h)
#endif

/* GAFLIDH15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflidh15l;
	SFR_UNSIGNED_SHORT_INT	gaflidh15h;
}SFR_BYTE_GAFLIDH15;

typedef union{
	SFR_BYTE_GAFLIDH15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLIDH15;

SFR_GLOBAL	SFR_GAFLIDH15	gaflidh15;

#ifdef __RL78__
#else
	#define	GAFLIDH15	(gaflidh15.ALL)
#endif

/* GAFLML15L */
#ifdef __RL78__
#else
	#define	GAFLML15L	(gaflml15.BYTE.gaflml15l)
#endif

/* GAFLML15H */
#ifdef __RL78__
#else
	#define	GAFLML15H	(gaflml15.BYTE.gaflml15h)
#endif

/* GAFLML15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflml15l;
	SFR_UNSIGNED_SHORT_INT	gaflml15h;
}SFR_BYTE_GAFLML15;

typedef union{
	SFR_BYTE_GAFLML15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLML15;

SFR_GLOBAL	SFR_GAFLML15	gaflml15;

#ifdef __RL78__
#else
	#define	GAFLML15	(gaflml15.ALL)
#endif

/* GAFLMH15L */
#ifdef __RL78__
#else
	#define	GAFLMH15L	(gaflmh15.BYTE.gaflmh15l)
#endif

/* GAFLMH15H */
#ifdef __RL78__
#else
	#define	GAFLMH15H	(gaflmh15.BYTE.gaflmh15h)
#endif

/* GAFLMH15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflmh15l;
	SFR_UNSIGNED_SHORT_INT	gaflmh15h;
}SFR_BYTE_GAFLMH15;

typedef union{
	SFR_BYTE_GAFLMH15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLMH15;

SFR_GLOBAL	SFR_GAFLMH15	gaflmh15;

#ifdef __RL78__
#else
	#define	GAFLMH15	(gaflmh15.ALL)
#endif

/* GAFLPL15L */
#ifdef __RL78__
#else
	#define	GAFLPL15L	(gaflpl15.BYTE.gaflpl15l)
#endif

/* GAFLPL15H */
#ifdef __RL78__
#else
	#define	GAFLPL15H	(gaflpl15.BYTE.gaflpl15h)
#endif

/* GAFLPL15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflpl15l;
	SFR_UNSIGNED_SHORT_INT	gaflpl15h;
}SFR_BYTE_GAFLPL15;

typedef union{
	SFR_BYTE_GAFLPL15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPL15;

SFR_GLOBAL	SFR_GAFLPL15	gaflpl15;

#ifdef __RL78__
#else
	#define	GAFLPL15	(gaflpl15.ALL)
#endif

/* GAFLPH15L */
#ifdef __RL78__
#else
	#define	GAFLPH15L	(gaflph15.BYTE.gaflph15l)
#endif

/* GAFLPH15H */
#ifdef __RL78__
#else
	#define	GAFLPH15H	(gaflph15.BYTE.gaflph15h)
#endif

/* GAFLPH15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	gaflph15l;
	SFR_UNSIGNED_SHORT_INT	gaflph15h;
}SFR_BYTE_GAFLPH15;

typedef union{
	SFR_BYTE_GAFLPH15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_GAFLPH15;

SFR_GLOBAL	SFR_GAFLPH15	gaflph15;

#ifdef __RL78__
#else
	#define	GAFLPH15	(gaflph15.ALL)
#endif

/* CAN受信ルール登録レジスタここまで */

/* CAN受信バッファ・レジスタここから */
/* RMIDL0L */
#ifdef __RL78__
#else
	#define	RMIDL0L	(rmidl0.BYTE.rmidl0l)
#endif

/* RMIDL0H */
#ifdef __RL78__
#else
	#define	RMIDL0H	(rmidl0.BYTE.rmidl0h)
#endif

/* RMIDL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl0l;
	SFR_UNSIGNED_SHORT_INT	rmidl0h;
}SFR_BYTE_RMIDL0;

typedef union{
	SFR_BYTE_RMIDL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL0;

SFR_GLOBAL	SFR_RMIDL0	rmidl0;

#ifdef __RL78__
#else
	#define	RMIDL0	(rmidl0.ALL)
#endif

/* RMIDH0L */
#ifdef __RL78__
#else
	#define	RMIDH0L	(rmidh0.BYTE.rmidh0l)
#endif

/* RMIDH0H */
#ifdef __RL78__
#else
	#define	RMIDH0H	(rmidh0.BYTE.rmidh0h)
#endif

/* RMIDH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh0l;
	SFR_UNSIGNED_SHORT_INT	rmidh0h;
}SFR_BYTE_RMIDH0;

typedef union{
	SFR_BYTE_RMIDH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH0;

SFR_GLOBAL	SFR_RMIDH0	rmidh0;

#ifdef __RL78__
#else
	#define	RMIDH0	(rmidh0.ALL)
#endif

/* RMTS0L */
#ifdef __RL78__
#else
	#define	RMTS0L	(rmts0.BYTE.rmts0l)
#endif

/* RMTS0H */
#ifdef __RL78__
#else
	#define	RMTS0H	(rmts0.BYTE.rmts0h)
#endif

/* RMTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts0l;
	SFR_UNSIGNED_SHORT_INT	rmts0h;
}SFR_BYTE_RMTS0;

typedef union{
	SFR_BYTE_RMTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS0;

SFR_GLOBAL	SFR_RMTS0	rmts0;

#ifdef __RL78__
#else
	#define	RMTS0	(rmts0.ALL)
#endif

/* RMPTR0L */
#ifdef __RL78__
#else
	#define	RMPTR0L	(rmptr0.BYTE.rmptr0l)
#endif

/* RMPTR0H */
#ifdef __RL78__
#else
	#define	RMPTR0H	(rmptr0.BYTE.rmptr0h)
#endif

/* RMPTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr0l;
	SFR_UNSIGNED_SHORT_INT	rmptr0h;
}SFR_BYTE_RMPTR0;

typedef union{
	SFR_BYTE_RMPTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR0;

SFR_GLOBAL	SFR_RMPTR0	rmptr0;

#ifdef __RL78__
#else
	#define	RMPTR0	(rmptr0.ALL)
#endif

/* RMDF00L */
#ifdef __RL78__
#else
	#define	RMDF00L	(rmdf00.BYTE.rmdf00l)
#endif

/* RMDF00H */
#ifdef __RL78__
#else
	#define	RMDF00H	(rmdf00.BYTE.rmdf00h)
#endif

/* RMDF00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf00l;
	SFR_UNSIGNED_SHORT_INT	rmdf00h;
}SFR_BYTE_RMDF00;

typedef union{
	SFR_BYTE_RMDF00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF00;

SFR_GLOBAL	SFR_RMDF00	rmdf00;

#ifdef __RL78__
#else
	#define	RMDF00	(rmdf00.ALL)
#endif

/* RMDF10L */
#ifdef __RL78__
#else
	#define	RMDF10L	(rmdf10.BYTE.rmdf10l)
#endif

/* RMDF10H */
#ifdef __RL78__
#else
	#define	RMDF10H	(rmdf10.BYTE.rmdf10h)
#endif

/* RMDF10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf10l;
	SFR_UNSIGNED_SHORT_INT	rmdf10h;
}SFR_BYTE_RMDF10;

typedef union{
	SFR_BYTE_RMDF10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF10;

SFR_GLOBAL	SFR_RMDF10	rmdf10;

#ifdef __RL78__
#else
	#define	RMDF10	(rmdf10.ALL)
#endif

/* RMDF20L */
#ifdef __RL78__
#else
	#define	RMDF20L	(rmdf20.BYTE.rmdf20l)
#endif

/* RMDF20H */
#ifdef __RL78__
#else
	#define	RMDF20H	(rmdf20.BYTE.rmdf20h)
#endif

/* RMDF20 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf20l;
	SFR_UNSIGNED_SHORT_INT	rmdf20h;
}SFR_BYTE_RMDF20;

typedef union{
	SFR_BYTE_RMDF20	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF20;

SFR_GLOBAL	SFR_RMDF20	rmdf20;

#ifdef __RL78__
#else
	#define	RMDF20	(rmdf20.ALL)
#endif

