turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF30L */
#ifdef __RL78__
#else
	#define	RMDF30L	(rmdf30.BYTE.rmdf30l)
#endif

/* RMDF30H */
#ifdef __RL78__
#else
	#define	RMDF30H	(rmdf30.BYTE.rmdf30h)
#endif

/* RMDF30 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf30l;
	SFR_UNSIGNED_SHORT_INT	rmdf30h;
}SFR_BYTE_RMDF30;

typedef union{
	SFR_BYTE_RMDF30	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF30;

SFR_GLOBAL	SFR_RMDF30	rmdf30;

#ifdef __RL78__
#else
	#define	RMDF30	(rmdf30.ALL)
#endif

/* RMIDL1L */
#ifdef __RL78__
#else
	#define	RMIDL1L	(rmidl1.BYTE.rmidl1l)
#endif

/* RMIDL1H */
#ifdef __RL78__
#else
	#define	RMIDL1H	(rmidl1.BYTE.rmidl1h)
#endif

/* RMIDL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl1l;
	SFR_UNSIGNED_SHORT_INT	rmidl1h;
}SFR_BYTE_RMIDL1;

typedef union{
	SFR_BYTE_RMIDL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL1;

SFR_GLOBAL	SFR_RMIDL1	rmidl1;

#ifdef __RL78__
#else
	#define	RMIDL1	(rmidl1.ALL)
#endif

/* RMIDH1L */
#ifdef __RL78__
#else
	#define	RMIDH1L	(rmidh1.BYTE.rmidh1l)
#endif

/* RMIDH1H */
#ifdef __RL78__
#else
	#define	RMIDH1H	(rmidh1.BYTE.rmidh1h)
#endif

/* RMIDH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh1l;
	SFR_UNSIGNED_SHORT_INT	rmidh1h;
}SFR_BYTE_RMIDH1;

typedef union{
	SFR_BYTE_RMIDH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH1;

SFR_GLOBAL	SFR_RMIDH1	rmidh1;

#ifdef __RL78__
#else
	#define	RMIDH1	(rmidh1.ALL)
#endif

/* RMTS1L */
#ifdef __RL78__
#else
	#define	RMTS1L	(rmts1.BYTE.rmts1l)
#endif

/* RMTS1H */
#ifdef __RL78__
#else
	#define	RMTS1H	(rmts1.BYTE.rmts1h)
#endif

/* RMTS1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts1l;
	SFR_UNSIGNED_SHORT_INT	rmts1h;
}SFR_BYTE_RMTS1;

typedef union{
	SFR_BYTE_RMTS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS1;

SFR_GLOBAL	SFR_RMTS1	rmts1;

#ifdef __RL78__
#else
	#define	RMTS1	(rmts1.ALL)
#endif

/* RMPTR1L */
#ifdef __RL78__
#else
	#define	RMPTR1L	(rmptr1.BYTE.rmptr1l)
#endif

/* RMPTR1H */
#ifdef __RL78__
#else
	#define	RMPTR1H	(rmptr1.BYTE.rmptr1h)
#endif

/* RMPTR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr1l;
	SFR_UNSIGNED_SHORT_INT	rmptr1h;
}SFR_BYTE_RMPTR1;

typedef union{
	SFR_BYTE_RMPTR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR1;

SFR_GLOBAL	SFR_RMPTR1	rmptr1;

#ifdef __RL78__
#else
	#define	RMPTR1	(rmptr1.ALL)
#endif

/* RMDF01L */
#ifdef __RL78__
#else
	#define	RMDF01L	(rmdf01.BYTE.rmdf01l)
#endif

/* RMDF01H */
#ifdef __RL78__
#else
	#define	RMDF01H	(rmdf01.BYTE.rmdf01h)
#endif

/* RMDF01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf01l;
	SFR_UNSIGNED_SHORT_INT	rmdf01h;
}SFR_BYTE_RMDF01;

typedef union{
	SFR_BYTE_RMDF01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF01;

SFR_GLOBAL	SFR_RMDF01	rmdf01;

#ifdef __RL78__
#else
	#define	RMDF01	(rmdf01.ALL)
#endif

/* RMDF11L */
#ifdef __RL78__
#else
	#define	RMDF11L	(rmdf11.BYTE.rmdf11l)
#endif

/* RMDF11H */
#ifdef __RL78__
#else
	#define	RMDF11H	(rmdf11.BYTE.rmdf11h)
#endif

/* RMDF11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf11l;
	SFR_UNSIGNED_SHORT_INT	rmdf11h;
}SFR_BYTE_RMDF11;

typedef union{
	SFR_BYTE_RMDF11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF11;

SFR_GLOBAL	SFR_RMDF11	rmdf11;

#ifdef __RL78__
#else
	#define	RMDF11	(rmdf11.ALL)
#endif

/* RMDF21L */
#ifdef __RL78__
#else
	#define	RMDF21L	(rmdf21.BYTE.rmdf21l)
#endif

/* RMDF21H */
#ifdef __RL78__
#else
	#define	RMDF21H	(rmdf21.BYTE.rmdf21h)
#endif

/* RMDF21 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf21l;
	SFR_UNSIGNED_SHORT_INT	rmdf21h;
}SFR_BYTE_RMDF21;

typedef union{
	SFR_BYTE_RMDF21	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF21;

SFR_GLOBAL	SFR_RMDF21	rmdf21;

#ifdef __RL78__
#else
	#define	RMDF21	(rmdf21.ALL)
#endif

/* RMDF31L */
#ifdef __RL78__
#else
	#define	RMDF31L	(rmdf31.BYTE.rmdf31l)
#endif

/* RMDF31H */
#ifdef __RL78__
#else
	#define	RMDF31H	(rmdf31.BYTE.rmdf31h)
#endif

/* RMDF31 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf31l;
	SFR_UNSIGNED_SHORT_INT	rmdf31h;
}SFR_BYTE_RMDF31;

typedef union{
	SFR_BYTE_RMDF31	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF31;

SFR_GLOBAL	SFR_RMDF31	rmdf31;

#ifdef __RL78__
#else
	#define	RMDF31	(rmdf31.ALL)
#endif

/* RMIDL2L */
#ifdef __RL78__
#else
	#define	RMIDL2L	(rmidl2.BYTE.rmidl2l)
#endif

/* RMIDL2H */
#ifdef __RL78__
#else
	#define	RMIDL2H	(rmidl2.BYTE.rmidl2h)
#endif

/* RMIDL2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl2l;
	SFR_UNSIGNED_SHORT_INT	rmidl2h;
}SFR_BYTE_RMIDL2;

typedef union{
	SFR_BYTE_RMIDL2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL2;

SFR_GLOBAL	SFR_RMIDL2	rmidl2;

#ifdef __RL78__
#else
	#define	RMIDL2	(rmidl2.ALL)
#endif

/* RMIDH2L */
#ifdef __RL78__
#else
	#define	RMIDH2L	(rmidh2.BYTE.rmidh2l)
#endif

/* RMIDH2H */
#ifdef __RL78__
#else
	#define	RMIDH2H	(rmidh2.BYTE.rmidh2h)
#endif

/* RMIDH2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh2l;
	SFR_UNSIGNED_SHORT_INT	rmidh2h;
}SFR_BYTE_RMIDH2;

typedef union{
	SFR_BYTE_RMIDH2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH2;

SFR_GLOBAL	SFR_RMIDH2	rmidh2;

#ifdef __RL78__
#else
	#define	RMIDH2	(rmidh2.ALL)
#endif

/* RMTS2L */
#ifdef __RL78__
#else
	#define	RMTS2L	(rmts2.BYTE.rmts2l)
#endif

/* RMTS2H */
#ifdef __RL78__
#else
	#define	RMTS2H	(rmts2.BYTE.rmts2h)
#endif

/* RMTS2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts2l;
	SFR_UNSIGNED_SHORT_INT	rmts2h;
}SFR_BYTE_RMTS2;

typedef union{
	SFR_BYTE_RMTS2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS2;

SFR_GLOBAL	SFR_RMTS2	rmts2;

#ifdef __RL78__
#else
	#define	RMTS2	(rmts2.ALL)
#endif

/* RMPTR2L */
#ifdef __RL78__
#else
	#define	RMPTR2L	(rmptr2.BYTE.rmptr2l)
#endif

/* RMPTR2H */
#ifdef __RL78__
#else
	#define	RMPTR2H	(rmptr2.BYTE.rmptr2h)
#endif

/* RMPTR2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr2l;
	SFR_UNSIGNED_SHORT_INT	rmptr2h;
}SFR_BYTE_RMPTR2;

typedef union{
	SFR_BYTE_RMPTR2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR2;

SFR_GLOBAL	SFR_RMPTR2	rmptr2;
	
#ifdef __RL78__
#else
	#define	RMPTR2	(rmptr2.ALL)
#endif

/* RMDF02L */
#ifdef __RL78__
#else
	#define	RMDF02L	(rmdf02.BYTE.rmdf02l)
#endif

/* RMDF02H */
#ifdef __RL78__
#else
	#define	RMDF02H	(rmdf02.BYTE.rmdf02h)
#endif

/* RMDF02 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf02l;
	SFR_UNSIGNED_SHORT_INT	rmdf02h;
}SFR_BYTE_RMDF02;

typedef union{
	SFR_BYTE_RMDF02	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF02;

SFR_GLOBAL	SFR_RMDF02	rmdf02;

#ifdef __RL78__
#else
	#define	RMDF02	(rmdf02.ALL)
#endif

/* RMDF12L */
#ifdef __RL78__
#else
	#define	RMDF12L	(rmdf12.BYTE.rmdf12l)
#endif

