turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF12H */
#ifdef __RL78__
#else
	#define	RMDF12H	(rmdf12.BYTE.rmdf12h)
#endif

/* RMDF12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf12l;
	SFR_UNSIGNED_SHORT_INT	rmdf12h;
}SFR_BYTE_RMDF12;

typedef union{
	SFR_BYTE_RMDF12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF12;

SFR_GLOBAL	SFR_RMDF12	rmdf12;

#ifdef __RL78__
#else
	#define	RMDF12	(rmdf12.ALL)
#endif

/* RMDF22L */
#ifdef __RL78__
#else
	#define	RMDF22L	(rmdf22.BYTE.rmdf22l)
#endif

/* RMDF22H */
#ifdef __RL78__
#else
	#define	RMDF22H	(rmdf22.BYTE.rmdf22h)
#endif

/* RMDF22 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf22l;
	SFR_UNSIGNED_SHORT_INT	rmdf22h;
}SFR_BYTE_RMDF22;

typedef union{
	SFR_BYTE_RMDF22	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF22;

SFR_GLOBAL	SFR_RMDF22	rmdf22;

#ifdef __RL78__
#else
	#define	RMDF22	(rmdf22.ALL)
#endif

/* RMDF32L */
#ifdef __RL78__
#else
	#define	RMDF32L	(rmdf32.BYTE.rmdf32l)
#endif

/* RMDF32H */
#ifdef __RL78__
#else
	#define	RMDF32H	(rmdf32.BYTE.rmdf32h)
#endif

/* RMDF32 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf32l;
	SFR_UNSIGNED_SHORT_INT	rmdf32h;
}SFR_BYTE_RMDF32;

typedef union{
	SFR_BYTE_RMDF32	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF32;

SFR_GLOBAL	SFR_RMDF32	rmdf32;

#ifdef __RL78__
#else
	#define	RMDF32	(rmdf32.ALL)
#endif

/* RMIDL3L */
#ifdef __RL78__
#else
	#define	RMIDL3L	(rmidl3.BYTE.rmidl3l)
#endif

/* RMIDL3H */
#ifdef __RL78__
#else
	#define	RMIDL3H	(rmidl3.BYTE.rmidl3h)
#endif

/* RMIDL3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl3l;
	SFR_UNSIGNED_SHORT_INT	rmidl3h;
}SFR_BYTE_RMIDL3;

typedef union{
	SFR_BYTE_RMIDL3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL3;

SFR_GLOBAL	SFR_RMIDL3	rmidl3;

#ifdef __RL78__
#else
	#define	RMIDL3	(rmidl3.ALL)
#endif

/* RMIDH3L */
#ifdef __RL78__
#else
	#define	RMIDH3L	(rmidh3.BYTE.rmidh3l)
#endif

/* RMIDH3H */
#ifdef __RL78__
#else
	#define	RMIDH3H	(rmidh3.BYTE.rmidh3h)
#endif

/* RMIDH3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh3l;
	SFR_UNSIGNED_SHORT_INT	rmidh3h;
}SFR_BYTE_RMIDH3;

typedef union{
	SFR_BYTE_RMIDH3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH3;

SFR_GLOBAL	SFR_RMIDH3	rmidh3;

#ifdef __RL78__
#else
	#define	RMIDH3	(rmidh3.ALL)
#endif

/* RMTS3L */
#ifdef __RL78__
#else
	#define	RMTS3L	(rmts3.BYTE.rmts3l)
#endif

/* RMTS3H */
#ifdef __RL78__
#else
	#define	RMTS3H	(rmts3.BYTE.rmts3h)
#endif

/* RMTS3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts3l;
	SFR_UNSIGNED_SHORT_INT	rmts3h;
}SFR_BYTE_RMTS3;

typedef union{
	SFR_BYTE_RMTS3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS3;

SFR_GLOBAL	SFR_RMTS3	rmts3;

#ifdef __RL78__
#else
	#define	RMTS3	(rmts3.ALL)
#endif

/* RMPTR3L */
#ifdef __RL78__
#else
	#define	RMPTR3L	(rmptr3.BYTE.rmptr3l)
#endif

/* RMPTR3H */
#ifdef __RL78__
#else
	#define	RMPTR3H	(rmptr3.BYTE.rmptr3h)
#endif

/* RMPTR3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr3l;
	SFR_UNSIGNED_SHORT_INT	rmptr3h;
}SFR_BYTE_RMPTR3;

typedef union{
	SFR_BYTE_RMPTR3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR3;

SFR_GLOBAL	SFR_RMPTR3	rmptr3;

#ifdef __RL78__
#else
	#define	RMPTR3	(rmptr3.ALL)
#endif

/* RMDF03L */
#ifdef __RL78__
#else
	#define	RMDF03L	(rmdf03.BYTE.rmdf03l)
#endif

/* RMDF03H */
#ifdef __RL78__
#else
	#define	RMDF03H	(rmdf03.BYTE.rmdf03h)
#endif

/* RMDF03 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf03l;
	SFR_UNSIGNED_SHORT_INT	rmdf03h;
}SFR_BYTE_RMDF03;

typedef union{
	SFR_BYTE_RMDF03	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF03;

SFR_GLOBAL	SFR_RMDF03	rmdf03;

#ifdef __RL78__
#else
	#define	RMDF03	(rmdf03.ALL)
#endif

/* RMDF13L */
#ifdef __RL78__
#else
	#define	RMDF13L	(rmdf13.BYTE.rmdf13l)
#endif

/* RMDF13H */
#ifdef __RL78__
#else
	#define	RMDF13H	(rmdf13.BYTE.rmdf13h)
#endif

/* RMDF13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf13l;
	SFR_UNSIGNED_SHORT_INT	rmdf13h;
}SFR_BYTE_RMDF13;

typedef union{
	SFR_BYTE_RMDF13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF13;

SFR_GLOBAL	SFR_RMDF13	rmdf13;

#ifdef __RL78__
#else
	#define	RMDF13	(rmdf13.ALL)
#endif

/* RMDF23L */
#ifdef __RL78__
#else
	#define	RMDF23L	(rmdf23.BYTE.rmdf23l)
#endif

/* RMDF23H */
#ifdef __RL78__
#else
	#define	RMDF23H	(rmdf23.BYTE.rmdf23h)
#endif

/* RMDF23 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf23l;
	SFR_UNSIGNED_SHORT_INT	rmdf23h;
}SFR_BYTE_RMDF23;

typedef union{
	SFR_BYTE_RMDF23	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF23;

SFR_GLOBAL	SFR_RMDF23	rmdf23;

#ifdef __RL78__
#else
	#define	RMDF23	(rmdf23.ALL)
#endif

/* RMDF33L */
#ifdef __RL78__
#else
	#define	RMDF33L	(rmdf33.BYTE.rmdf33l)
#endif

/* RMDF33H */
#ifdef __RL78__
#else
	#define	RMDF33H	(rmdf33.BYTE.rmdf33h)
#endif

/* RMDF33 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf33l;
	SFR_UNSIGNED_SHORT_INT	rmdf33h;
}SFR_BYTE_RMDF33;

typedef union{
	SFR_BYTE_RMDF33	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF33;

SFR_GLOBAL	SFR_RMDF33	rmdf33;

#ifdef __RL78__
#else
	#define	RMDF33	(rmdf33.ALL)
#endif

/* RMIDL4L */
#ifdef __RL78__
#else
	#define	RMIDL4L	(rmidl4.BYTE.rmidl4l)
#endif

/* RMIDL4H */
#ifdef __RL78__
#else
	#define	RMIDL4H	(rmidl4.BYTE.rmidl4h)
#endif

/* RMIDL4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl4l;
	SFR_UNSIGNED_SHORT_INT	rmidl4h;
}SFR_BYTE_RMIDL4;

typedef union{
	SFR_BYTE_RMIDL4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL4;

SFR_GLOBAL	SFR_RMIDL4	rmidl4;

#ifdef __RL78__
#else
	#define	RMIDL4	(rmidl4.ALL)
#endif

/* RMIDH4L */
#ifdef __RL78__
#else
	#define	RMIDH4L	(rmidh4.BYTE.rmidh4l)
#endif

/* RMIDH4H */
#ifdef __RL78__
#else
	#define	RMIDH4H	(rmidh4.BYTE.rmidh4h)
#endif

/* RMIDH4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh4l;
	SFR_UNSIGNED_SHORT_INT	rmidh4h;
}SFR_BYTE_RMIDH4;

typedef union{
	SFR_BYTE_RMIDH4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH4;

SFR_GLOBAL	SFR_RMIDH4	rmidh4;

#ifdef __RL78__
#else
	#define	RMIDH4	(rmidh4.ALL)
#endif

/* RMTS4L */
#ifdef __RL78__
#else
	#define	RMTS4L	(rmts4.BYTE.rmts4l)
#endif

/* RMTS4H */
#ifdef __RL78__
#else
	#define	RMTS4H	(rmts4.BYTE.rmts4h)
#endif

