turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMTS4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts4l;
	SFR_UNSIGNED_SHORT_INT	rmts4h;
}SFR_BYTE_RMTS4;

typedef union{
	SFR_BYTE_RMTS4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS4;

SFR_GLOBAL	SFR_RMTS4	rmts4;

#ifdef __RL78__
#else
	#define	RMTS4	(rmts4.ALL)
#endif

/* RMPTR4L */
#ifdef __RL78__
#else
	#define	RMPTR4L	(rmptr4.BYTE.rmptr4l)
#endif

/* RMPTR4H */
#ifdef __RL78__
#else
	#define	RMPTR4H	(rmptr4.BYTE.rmptr4h)
#endif

/* RMPTR4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr4l;
	SFR_UNSIGNED_SHORT_INT	rmptr4h;
}SFR_BYTE_RMPTR4;

typedef union{
	SFR_BYTE_RMPTR4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR4;

SFR_GLOBAL	SFR_RMPTR4	rmptr4;

#ifdef __RL78__
#else
	#define	RMPTR4	(rmptr4.ALL)
#endif

/* RMDF04L */
#ifdef __RL78__
#else
	#define	RMDF04L	(rmdf04.BYTE.rmdf04l)
#endif

/* RMDF04H */
#ifdef __RL78__
#else
	#define	RMDF04H	(rmdf04.BYTE.rmdf04h)
#endif

/* RMDF04 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf04l;
	SFR_UNSIGNED_SHORT_INT	rmdf04h;
}SFR_BYTE_RMDF04;

typedef union{
	SFR_BYTE_RMDF04	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF04;

SFR_GLOBAL	SFR_RMDF04	rmdf04;

#ifdef __RL78__
#else
	#define	RMDF04	(rmdf04.ALL)
#endif

/* RMDF14L */
#ifdef __RL78__
#else
	#define	RMDF14L	(rmdf14.BYTE.rmdf14l)
#endif

/* RMDF14H */
#ifdef __RL78__
#else
	#define	RMDF14H	(rmdf14.BYTE.rmdf14h)
#endif

/* RMDF14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf14l;
	SFR_UNSIGNED_SHORT_INT	rmdf14h;
}SFR_BYTE_RMDF14;

typedef union{
	SFR_BYTE_RMDF14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF14;

SFR_GLOBAL	SFR_RMDF14	rmdf14;

#ifdef __RL78__
#else
	#define	RMDF14	(rmdf14.ALL)
#endif

/* RMDF24L */
#ifdef __RL78__
#else
	#define	RMDF24L	(rmdf24.BYTE.rmdf24l)
#endif

/* RMDF24H */
#ifdef __RL78__
#else
	#define	RMDF24H	(rmdf24.BYTE.rmdf24h)
#endif

/* RMDF24 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf24l;
	SFR_UNSIGNED_SHORT_INT	rmdf24h;
}SFR_BYTE_RMDF24;

typedef union{
	SFR_BYTE_RMDF24	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF24;

SFR_GLOBAL	SFR_RMDF24	rmdf24;

#ifdef __RL78__
#else
	#define	RMDF24	(rmdf24.ALL)
#endif

/* RMDF34L */
#ifdef __RL78__
#else
	#define	RMDF34L	(rmdf34.BYTE.rmdf34l)
#endif

/* RMDF34H */
#ifdef __RL78__
#else
	#define	RMDF34H	(rmdf34.BYTE.rmdf34h)
#endif

/* RMDF34 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf34l;
	SFR_UNSIGNED_SHORT_INT	rmdf34h;
}SFR_BYTE_RMDF34;

typedef union{
	SFR_BYTE_RMDF34	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF34;

SFR_GLOBAL	SFR_RMDF34	rmdf34;

#ifdef __RL78__
#else
	#define	RMDF34	(rmdf34.ALL)
#endif

/* RMIDL5L */
#ifdef __RL78__
#else
	#define	RMIDL5L	(rmidl5.BYTE.rmidl5l)
#endif

/* RMIDL5H */
#ifdef __RL78__
#else
	#define	RMIDL5H	(rmidl5.BYTE.rmidl5h)
#endif

/* RMIDL5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl5l;
	SFR_UNSIGNED_SHORT_INT	rmidl5h;
}SFR_BYTE_RMIDL5;

typedef union{
	SFR_BYTE_RMIDL5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL5;

SFR_GLOBAL	SFR_RMIDL5	rmidl5;

#ifdef __RL78__
#else
	#define	RMIDL5	(rmidl5.ALL)
#endif

/* RMIDH5L */
#ifdef __RL78__
#else
	#define	RMIDH5L	(rmidh5.BYTE.rmidh5l)
#endif

/* RMIDH5H */
#ifdef __RL78__
#else
	#define	RMIDH5H	(rmidh5.BYTE.rmidh5h)
#endif

/* RMIDH5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh5l;
	SFR_UNSIGNED_SHORT_INT	rmidh5h;
}SFR_BYTE_RMIDH5;

typedef union{
	SFR_BYTE_RMIDH5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH5;

SFR_GLOBAL	SFR_RMIDH5	rmidh5;

#ifdef __RL78__
#else
	#define	RMIDH5	(rmidh5.ALL)
#endif

/* RMTS5L */
#ifdef __RL78__
#else
	#define	RMTS5L	(rmts5.BYTE.rmts5l)
#endif

/* RMTS5H */
#ifdef __RL78__
#else
	#define	RMTS5H	(rmts5.BYTE.rmts5h)
#endif

/* RMTS5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts5l;
	SFR_UNSIGNED_SHORT_INT	rmts5h;
}SFR_BYTE_RMTS5;

typedef union{
	SFR_BYTE_RMTS5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS5;

SFR_GLOBAL	SFR_RMTS5	rmts5;

#ifdef __RL78__
#else
	#define	RMTS5	(rmts5.ALL)
#endif

/* RMPTR5L */
#ifdef __RL78__
#else
	#define	RMPTR5L	(rmptr5.BYTE.rmptr5l)
#endif

/* RMPTR5H */
#ifdef __RL78__
#else
	#define	RMPTR5H	(rmptr5.BYTE.rmptr5h)
#endif

/* RMPTR5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr5l;
	SFR_UNSIGNED_SHORT_INT	rmptr5h;
}SFR_BYTE_RMPTR5;

typedef union{
	SFR_BYTE_RMPTR5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR5;

SFR_GLOBAL	SFR_RMPTR5	rmptr5;

#ifdef __RL78__
#else
	#define	RMPTR5	(rmptr5.ALL)
#endif

/* RMDF05L */
#ifdef __RL78__
#else
	#define	RMDF05L	(rmdf05.BYTE.rmdf05l)
#endif

/* RMDF05H */
#ifdef __RL78__
#else
	#define	RMDF05H	(rmdf05.BYTE.rmdf05h)
#endif

/* RMDF05 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf05l;
	SFR_UNSIGNED_SHORT_INT	rmdf05h;
}SFR_BYTE_RMDF05;

typedef union{
	SFR_BYTE_RMDF05	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF05;

SFR_GLOBAL	SFR_RMDF05	rmdf05;

#ifdef __RL78__
#else
	#define	RMDF05	(rmdf05.ALL)
#endif

/* RMDF15L */
#ifdef __RL78__
#else
	#define	RMDF15L	(rmdf15.BYTE.rmdf15l)
#endif

/* RMDF15H */
#ifdef __RL78__
#else
	#define	RMDF15H	(rmdf15.BYTE.rmdf15h)
#endif

/* RMDF15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf15l;
	SFR_UNSIGNED_SHORT_INT	rmdf15h;
}SFR_BYTE_RMDF15;

typedef union{
	SFR_BYTE_RMDF15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF15;

SFR_GLOBAL	SFR_RMDF15	rmdf15;

#ifdef __RL78__
#else
	#define	RMDF15	(rmdf15.ALL)
#endif

/* RMDF25L */
#ifdef __RL78__
#else
	#define	RMDF25L	(rmdf25.BYTE.rmdf25l)
#endif

/* RMDF25H */
#ifdef __RL78__
#else
	#define	RMDF25H	(rmdf25.BYTE.rmdf25h)
#endif

/* RMDF25 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf25l;
	SFR_UNSIGNED_SHORT_INT	rmdf25h;
}SFR_BYTE_RMDF25;

typedef union{
	SFR_BYTE_RMDF25	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF25;

SFR_GLOBAL	SFR_RMDF25	rmdf25;

#ifdef __RL78__
#else
	#define	RMDF25	(rmdf25.ALL)
#endif

