turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF35L */
#ifdef __RL78__
#else
	#define	RMDF35L	(rmdf35.BYTE.rmdf35l)
#endif

/* RMDF35H */
#ifdef __RL78__
#else
	#define	RMDF35H	(rmdf35.BYTE.rmdf35h)
#endif

/* RMDF35 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf35l;
	SFR_UNSIGNED_SHORT_INT	rmdf35h;
}SFR_BYTE_RMDF35;

typedef union{
	SFR_BYTE_RMDF35	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF35;

SFR_GLOBAL	SFR_RMDF35	rmdf35;

#ifdef __RL78__
#else
	#define	RMDF35	(rmdf35.ALL)
#endif

/* RMIDL6L */
#ifdef __RL78__
#else
	#define	RMIDL6L	(rmidl6.BYTE.rmidl6l)
#endif

/* RMIDL6H */
#ifdef __RL78__
#else
	#define	RMIDL6H	(rmidl6.BYTE.rmidl6h)
#endif

/* RMIDL6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl6l;
	SFR_UNSIGNED_SHORT_INT	rmidl6h;
}SFR_BYTE_RMIDL6;

typedef union{
	SFR_BYTE_RMIDL6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL6;

SFR_GLOBAL	SFR_RMIDL6	rmidl6;

#ifdef __RL78__
#else
	#define	RMIDL6	(rmidl6.ALL)
#endif

/* RMIDH6L */
#ifdef __RL78__
#else
	#define	RMIDH6L	(rmidh6.BYTE.rmidh6l)
#endif

/* RMIDH6H */
#ifdef __RL78__
#else
	#define	RMIDH6H	(rmidh6.BYTE.rmidh6h)
#endif

/* RMIDH6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh6l;
	SFR_UNSIGNED_SHORT_INT	rmidh6h;
}SFR_BYTE_RMIDH6;

typedef union{
	SFR_BYTE_RMIDH6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH6;

SFR_GLOBAL	SFR_RMIDH6	rmidh6;

#ifdef __RL78__
#else
	#define	RMIDH6	(rmidh6.ALL)
#endif

/* RMTS6L */
#ifdef __RL78__
#else
	#define	RMTS6L	(rmts6.BYTE.rmts6l)
#endif

/* RMTS6H */
#ifdef __RL78__
#else
	#define	RMTS6H	(rmts6.BYTE.rmts6h)
#endif

/* RMTS6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts6l;
	SFR_UNSIGNED_SHORT_INT	rmts6h;
}SFR_BYTE_RMTS6;

typedef union{
	SFR_BYTE_RMTS6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS6;

SFR_GLOBAL	SFR_RMTS6	rmts6;

#ifdef __RL78__
#else
	#define	RMTS6	(rmts6.ALL)
#endif

/* RMPTR6L */
#ifdef __RL78__
#else
	#define	RMPTR6L	(rmptr6.BYTE.rmptr6l)
#endif

/* RMPTR6H */
#ifdef __RL78__
#else
	#define	RMPTR6H	(rmptr6.BYTE.rmptr6h)
#endif

/* RMPTR6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr6l;
	SFR_UNSIGNED_SHORT_INT	rmptr6h;
}SFR_BYTE_RMPTR6;

typedef union{
	SFR_BYTE_RMPTR6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR6;

SFR_GLOBAL	SFR_RMPTR6	rmptr6;

#ifdef __RL78__
#else
	#define	RMPTR6	(rmptr6.ALL)
#endif

/* RMDF06L */
#ifdef __RL78__
#else
	#define	RMDF06L	(rmdf06.BYTE.rmdf06l)
#endif

/* RMDF06H */
#ifdef __RL78__
#else
	#define	RMDF06H	(rmdf06.BYTE.rmdf06h)
#endif

/* RMDF06 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf06l;
	SFR_UNSIGNED_SHORT_INT	rmdf06h;
}SFR_BYTE_RMDF06;

typedef union{
	SFR_BYTE_RMDF06	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF06;

SFR_GLOBAL	SFR_RMDF06	rmdf06;

#ifdef __RL78__
#else
	#define	RMDF06	(rmdf06.ALL)
#endif

/* RMDF16L */
#ifdef __RL78__
#else
	#define	RMDF16L	(rmdf16.BYTE.rmdf16l)
#endif

/* RMDF16H */
#ifdef __RL78__
#else
	#define	RMDF16H	(rmdf16.BYTE.rmdf16h)
#endif

/* RMDF16 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf16l;
	SFR_UNSIGNED_SHORT_INT	rmdf16h;
}SFR_BYTE_RMDF16;

typedef union{
	SFR_BYTE_RMDF16	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF16;

SFR_GLOBAL	SFR_RMDF16	rmdf16;

#ifdef __RL78__
#else
	#define	RMDF16	(rmdf16.ALL)
#endif

/* RMDF26L */
#ifdef __RL78__
#else
	#define	RMDF26L	(rmdf26.BYTE.rmdf26l)
#endif

/* RMDF26H */
#ifdef __RL78__
#else
	#define	RMDF26H	(rmdf26.BYTE.rmdf26h)
#endif

/* RMDF26 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf26l;
	SFR_UNSIGNED_SHORT_INT	rmdf26h;
}SFR_BYTE_RMDF26;

typedef union{
	SFR_BYTE_RMDF26	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF26;

SFR_GLOBAL	SFR_RMDF26	rmdf26;

#ifdef __RL78__
#else
	#define	RMDF26	(rmdf26.ALL)
#endif

/* RMDF36L */
#ifdef __RL78__
#else
	#define	RMDF36L	(rmdf36.BYTE.rmdf36l)
#endif

/* RMDF36H */
#ifdef __RL78__
#else
	#define	RMDF36H	(rmdf36.BYTE.rmdf36h)
#endif

/* RMDF36 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf36l;
	SFR_UNSIGNED_SHORT_INT	rmdf36h;
}SFR_BYTE_RMDF36;

typedef union{
	SFR_BYTE_RMDF36	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF36;

SFR_GLOBAL	SFR_RMDF36	rmdf36;

#ifdef __RL78__
#else
	#define	RMDF36	(rmdf36.ALL)
#endif

/* RMIDL7L */
#ifdef __RL78__
#else
	#define	RMIDL7L	(rmidl7.BYTE.rmidl7l)
#endif

/* RMIDL7H */
#ifdef __RL78__
#else
	#define	RMIDL7H	(rmidl7.BYTE.rmidl7h)
#endif

/* RMIDL7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl7l;
	SFR_UNSIGNED_SHORT_INT	rmidl7h;
}SFR_BYTE_RMIDL7;

typedef union{
	SFR_BYTE_RMIDL7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL7;

SFR_GLOBAL	SFR_RMIDL7	rmidl7;

#ifdef __RL78__
#else
	#define	RMIDL7	(rmidl7.ALL)
#endif

/* RMIDH7L */
#ifdef __RL78__
#else
	#define	RMIDH7L	(rmidh7.BYTE.rmidh7l)
#endif

/* RMIDH7H */
#ifdef __RL78__
#else
	#define	RMIDH7H	(rmidh7.BYTE.rmidh7h)
#endif

/* RMIDH7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh7l;
	SFR_UNSIGNED_SHORT_INT	rmidh7h;
}SFR_BYTE_RMIDH7;

typedef union{
	SFR_BYTE_RMIDH7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH7;

SFR_GLOBAL	SFR_RMIDH7	rmidh7;

#ifdef __RL78__
#else
	#define	RMIDH7	(rmidh7.ALL)
#endif

/* RMTS7L */
#ifdef __RL78__
#else
	#define	RMTS7L	(rmts7.BYTE.rmts7l)
#endif

/* RMTS7H */
#ifdef __RL78__
#else
	#define	RMTS7H	(rmts7.BYTE.rmts7h)
#endif

/* RMTS7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts7l;
	SFR_UNSIGNED_SHORT_INT	rmts7h;
}SFR_BYTE_RMTS7;

typedef union{
	SFR_BYTE_RMTS7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS7;

SFR_GLOBAL	SFR_RMTS7	rmts7;

#ifdef __RL78__
#else
	#define	RMTS7	(rmts7.ALL)
#endif

/* RMPTR7L */
#ifdef __RL78__
#else
	#define	RMPTR7L	(rmptr7.BYTE.rmptr7l)
#endif

/* RMPTR7H */
#ifdef __RL78__
#else
	#define	RMPTR7H	(rmptr7.BYTE.rmptr7h)
#endif

/* RMPTR7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr7l;
	SFR_UNSIGNED_SHORT_INT	rmptr7h;
}SFR_BYTE_RMPTR7;

typedef union{
	SFR_BYTE_RMPTR7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR7;

