turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_RMPTR7	rmptr7;

#ifdef __RL78__
#else
	#define	RMPTR7	(rmptr7.ALL)
#endif

/* RMDF07L */
#ifdef __RL78__
#else
	#define	RMDF07L	(rmdf07.BYTE.rmdf07l)
#endif

/* RMDF07H */
#ifdef __RL78__
#else
	#define	RMDF07H	(rmdf07.BYTE.rmdf07h)
#endif

/* RMDF07 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf07l;
	SFR_UNSIGNED_SHORT_INT	rmdf07h;
}SFR_BYTE_RMDF07;

typedef union{
	SFR_BYTE_RMDF07	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF07;

SFR_GLOBAL	SFR_RMDF07	rmdf07;

#ifdef __RL78__
#else
	#define	RMDF07	(rmdf07.ALL)
#endif

/* RMDF17L */
#ifdef __RL78__
#else
	#define	RMDF17L	(rmdf17.BYTE.rmdf17l)
#endif

/* RMDF17H */
#ifdef __RL78__
#else
	#define	RMDF17H	(rmdf17.BYTE.rmdf17h)
#endif

/* RMDF17 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf17l;
	SFR_UNSIGNED_SHORT_INT	rmdf17h;
}SFR_BYTE_RMDF17;

typedef union{
	SFR_BYTE_RMDF17	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF17;

SFR_GLOBAL	SFR_RMDF17	rmdf17;

#ifdef __RL78__
#else
	#define	RMDF17	(rmdf17.ALL)
#endif

/* RMDF27L */
#ifdef __RL78__
#else
	#define	RMDF27L	(rmdf27.BYTE.rmdf27l)
#endif

/* RMDF27H */
#ifdef __RL78__
#else
	#define	RMDF27H	(rmdf27.BYTE.rmdf27h)
#endif

/* RMDF27 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf27l;
	SFR_UNSIGNED_SHORT_INT	rmdf27h;
}SFR_BYTE_RMDF27;

typedef union{
	SFR_BYTE_RMDF27	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF27;

SFR_GLOBAL	SFR_RMDF27	rmdf27;

#ifdef __RL78__
#else
	#define	RMDF27	(rmdf27.ALL)
#endif

/* RMDF37L */
#ifdef __RL78__
#else
	#define	RMDF37L	(rmdf37.BYTE.rmdf37l)
#endif

/* RMDF37H */
#ifdef __RL78__
#else
	#define	RMDF37H	(rmdf37.BYTE.rmdf37h)
#endif

/* RMDF37 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf37l;
	SFR_UNSIGNED_SHORT_INT	rmdf37h;
}SFR_BYTE_RMDF37;

typedef union{
	SFR_BYTE_RMDF37	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF37;

SFR_GLOBAL	SFR_RMDF37	rmdf37;

#ifdef __RL78__
#else
	#define	RMDF37	(rmdf37.ALL)
#endif

/* RMIDL8L */
#ifdef __RL78__
#else
	#define	RMIDL8L	(rmidl8.BYTE.rmidl8l)
#endif

/* RMIDL8H */
#ifdef __RL78__
#else
	#define	RMIDL8H	(rmidl8.BYTE.rmidl8h)
#endif

/* RMIDL8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl8l;
	SFR_UNSIGNED_SHORT_INT	rmidl8h;
}SFR_BYTE_RMIDL8;

typedef union{
	SFR_BYTE_RMIDL8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL8;

SFR_GLOBAL	SFR_RMIDL8	rmidl8;

#ifdef __RL78__
#else
	#define	RMIDL8	(rmidl8.ALL)
#endif

/* RMIDH8L */
#ifdef __RL78__
#else
	#define	RMIDH8L	(rmidh8.BYTE.rmidh8l)
#endif

/* RMIDH8H */
#ifdef __RL78__
#else
	#define	RMIDH8H	(rmidh8.BYTE.rmidh8h)
#endif

/* RMIDH8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh8l;
	SFR_UNSIGNED_SHORT_INT	rmidh8h;
}SFR_BYTE_RMIDH8;

typedef union{
	SFR_BYTE_RMIDH8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH8;

SFR_GLOBAL	SFR_RMIDH8	rmidh8;

#ifdef __RL78__
#else
	#define	RMIDH8	(rmidh8.ALL)
#endif

/* RMTS8L */
#ifdef __RL78__
#else
	#define	RMTS8L	(rmts8.BYTE.rmts8l)
#endif

/* RMTS8H */
#ifdef __RL78__
#else
	#define	RMTS8H	(rmts8.BYTE.rmts8h)
#endif

/* RMTS8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts8l;
	SFR_UNSIGNED_SHORT_INT	rmts8h;
}SFR_BYTE_RMTS8;

typedef union{
	SFR_BYTE_RMTS8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS8;

SFR_GLOBAL	SFR_RMTS8	rmts8;

#ifdef __RL78__
#else
	#define	RMTS8	(rmts8.ALL)
#endif

/* RMPTR8L */
#ifdef __RL78__
#else
	#define	RMPTR8L	(rmptr8.BYTE.rmptr8l)
#endif

/* RMPTR8H */
#ifdef __RL78__
#else
	#define	RMPTR8H	(rmptr8.BYTE.rmptr8h)
#endif

/* RMPTR8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr8l;
	SFR_UNSIGNED_SHORT_INT	rmptr8h;
}SFR_BYTE_RMPTR8;

typedef union{
	SFR_BYTE_RMPTR8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR8;

SFR_GLOBAL	SFR_RMPTR8	rmptr8;

#ifdef __RL78__
#else
	#define	RMPTR8	(rmptr8.ALL)
#endif

/* RMDF08L */
#ifdef __RL78__
#else
	#define	RMDF08L	(rmdf08.BYTE.rmdf08l)
#endif

/* RMDF08H */
#ifdef __RL78__
#else
	#define	RMDF08H	(rmdf08.BYTE.rmdf08h)
#endif

/* RMDF08 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf08l;
	SFR_UNSIGNED_SHORT_INT	rmdf08h;
}SFR_BYTE_RMDF08;

typedef union{
	SFR_BYTE_RMDF08	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF08;

SFR_GLOBAL	SFR_RMDF08	rmdf08;

#ifdef __RL78__
#else
	#define	RMDF08	(rmdf08.ALL)
#endif

/* RMDF18L */
#ifdef __RL78__
#else
	#define	RMDF18L	(rmdf18.BYTE.rmdf18l)
#endif

/* RMDF18H */
#ifdef __RL78__
#else
	#define	RMDF18H	(rmdf18.BYTE.rmdf18h)
#endif

/* RMDF18 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf18l;
	SFR_UNSIGNED_SHORT_INT	rmdf18h;
}SFR_BYTE_RMDF18;

typedef union{
	SFR_BYTE_RMDF18	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF18;

SFR_GLOBAL	SFR_RMDF18	rmdf18;

#ifdef __RL78__
#else
	#define	RMDF18	(rmdf18.ALL)
#endif

/* RMDF28L */
#ifdef __RL78__
#else
	#define	RMDF28L	(rmdf28.BYTE.rmdf28l)
#endif

/* RMDF28H */
#ifdef __RL78__
#else
	#define	RMDF28H	(rmdf28.BYTE.rmdf28h)
#endif

/* RMDF28 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf28l;
	SFR_UNSIGNED_SHORT_INT	rmdf28h;
}SFR_BYTE_RMDF28;

typedef union{
	SFR_BYTE_RMDF28	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF28;

SFR_GLOBAL	SFR_RMDF28	rmdf28;

#ifdef __RL78__
#else
	#define	RMDF28	(rmdf28.ALL)
#endif

/* RMDF38L */
#ifdef __RL78__
#else
	#define	RMDF38L	(rmdf38.BYTE.rmdf38l)
#endif

/* RMDF38H */
#ifdef __RL78__
#else
	#define	RMDF38H	(rmdf38.BYTE.rmdf38h)
#endif

/* RMDF38 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf38l;
	SFR_UNSIGNED_SHORT_INT	rmdf38h;
}SFR_BYTE_RMDF38;

typedef union{
	SFR_BYTE_RMDF38	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF38;

SFR_GLOBAL	SFR_RMDF38	rmdf38;

#ifdef __RL78__
#else
	#define	RMDF38	(rmdf38.ALL)
#endif

/* RMIDL9L */
#ifdef __RL78__
#else
	#define	RMIDL9L	(rmidl9.BYTE.rmidl9l)
#endif

/* RMIDL9H */
#ifdef __RL78__
#else
	#define	RMIDL9H	(rmidl9.BYTE.rmidl9h)
#endif

/* RMIDL9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl9l;
	SFR_UNSIGNED_SHORT_INT	rmidl9h;
}SFR_BYTE_RMIDL9;

typedef union{
	SFR_BYTE_RMIDL9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL9;

SFR_GLOBAL	SFR_RMIDL9	rmidl9;

#ifdef __RL78__
#else
	#define	RMIDL9	(rmidl9.ALL)
#endif

/* RMIDH9L */
#ifdef __RL78__
#else
	#define	RMIDH9L	(rmidh9.BYTE.rmidh9l)
#endif

