turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMIDH9H */
#ifdef __RL78__
#else
	#define	RMIDH9H	(rmidh9.BYTE.rmidh9h)
#endif

/* RMIDH9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh9l;
	SFR_UNSIGNED_SHORT_INT	rmidh9h;
}SFR_BYTE_RMIDH9;

typedef union{
	SFR_BYTE_RMIDH9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH9;

SFR_GLOBAL	SFR_RMIDH9	rmidh9;

#ifdef __RL78__
#else
	#define	RMIDH9	(rmidh9.ALL)
#endif

/* RMTS9L */
#ifdef __RL78__
#else
	#define	RMTS9L	(rmts9.BYTE.rmts9l)
#endif

/* RMTS9H */
#ifdef __RL78__
#else
	#define	RMTS9H	(rmts9.BYTE.rmts9h)
#endif

/* RMTS9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts9l;
	SFR_UNSIGNED_SHORT_INT	rmts9h;
}SFR_BYTE_RMTS9;

typedef union{
	SFR_BYTE_RMTS9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS9;

SFR_GLOBAL	SFR_RMTS9	rmts9;

#ifdef __RL78__
#else
	#define	RMTS9	(rmts9.ALL)
#endif

/* RMPTR9L */
#ifdef __RL78__
#else
	#define	RMPTR9L	(rmptr9.BYTE.rmptr9l)
#endif

/* RMPTR9H */
#ifdef __RL78__
#else
	#define	RMPTR9H	(rmptr9.BYTE.rmptr9h)
#endif

/* RMPTR9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr9l;
	SFR_UNSIGNED_SHORT_INT	rmptr9h;
}SFR_BYTE_RMPTR9;

typedef union{
	SFR_BYTE_RMPTR9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR9;

SFR_GLOBAL	SFR_RMPTR9	rmptr9;

#ifdef __RL78__
#else
	#define	RMPTR9	(rmptr9.ALL)
#endif

/* RMDF09L */
#ifdef __RL78__
#else
	#define	RMDF09L	(rmdf09.BYTE.rmdf09l)
#endif

/* RMDF09H */
#ifdef __RL78__
#else
	#define	RMDF09H	(rmdf09.BYTE.rmdf09h)
#endif

/* RMDF09 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf09l;
	SFR_UNSIGNED_SHORT_INT	rmdf09h;
}SFR_BYTE_RMDF09;

typedef union{
	SFR_BYTE_RMDF09	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF09;

SFR_GLOBAL	SFR_RMDF09	rmdf09;

#ifdef __RL78__
#else
	#define	RMDF09	(rmdf09.ALL)
#endif

/* RMDF19L */
#ifdef __RL78__
#else
	#define	RMDF19L	(rmdf19.BYTE.rmdf19l)
#endif

/* RMDF19H */
#ifdef __RL78__
#else
	#define	RMDF19H	(rmdf19.BYTE.rmdf19h)
#endif

/* RMDF19 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf19l;
	SFR_UNSIGNED_SHORT_INT	rmdf19h;
}SFR_BYTE_RMDF19;

typedef union{
	SFR_BYTE_RMDF19	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF19;

SFR_GLOBAL	SFR_RMDF19	rmdf19;

#ifdef __RL78__
#else
	#define	RMDF19	(rmdf19.ALL)
#endif

/* RMDF29L */
#ifdef __RL78__
#else
	#define	RMDF29L	(rmdf29.BYTE.rmdf29l)
#endif

/* RMDF29H */
#ifdef __RL78__
#else
	#define	RMDF29H	(rmdf29.BYTE.rmdf29h)
#endif

/* RMDF29 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf29l;
	SFR_UNSIGNED_SHORT_INT	rmdf29h;
}SFR_BYTE_RMDF29;

typedef union{
	SFR_BYTE_RMDF29	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF29;

SFR_GLOBAL	SFR_RMDF29	rmdf29;

#ifdef __RL78__
#else
	#define	RMDF29	(rmdf29.ALL)
#endif

/* RMDF39L */
#ifdef __RL78__
#else
	#define	RMDF39L	(rmdf39.BYTE.rmdf39l)
#endif

/* RMDF39H */
#ifdef __RL78__
#else
	#define	RMDF39H	(rmdf39.BYTE.rmdf39h)
#endif

/* RMDF39 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf39l;
	SFR_UNSIGNED_SHORT_INT	rmdf39h;
}SFR_BYTE_RMDF39;

typedef union{
	SFR_BYTE_RMDF39	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF39;

SFR_GLOBAL	SFR_RMDF39	rmdf39;

#ifdef __RL78__
#else
	#define	RMDF39	(rmdf39.ALL)
#endif

/* RMIDL10L */
#ifdef __RL78__
#else
	#define	RMIDL10L	(rmidl10.BYTE.rmidl10l)
#endif

/* RMIDL10H */
#ifdef __RL78__
#else
	#define	RMIDL10H	(rmidl10.BYTE.rmidl10h)
#endif

/* RMIDL10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl10l;
	SFR_UNSIGNED_SHORT_INT	rmidl10h;
}SFR_BYTE_RMIDL10;

typedef union{
	SFR_BYTE_RMIDL10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL10;

SFR_GLOBAL	SFR_RMIDL10	rmidl10;

#ifdef __RL78__
#else
	#define	RMIDL10	(rmidl10.ALL)
#endif

/* RMIDH10L */
#ifdef __RL78__
#else
	#define	RMIDH10L	(rmidh10.BYTE.rmidh10l)
#endif

/* RMIDH10H */
#ifdef __RL78__
#else
	#define	RMIDH10H	(rmidh10.BYTE.rmidh10h)
#endif

/* RMIDH10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh10l;
	SFR_UNSIGNED_SHORT_INT	rmidh10h;
}SFR_BYTE_RMIDH10;

typedef union{
	SFR_BYTE_RMIDH10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH10;

SFR_GLOBAL	SFR_RMIDH10	rmidh10;

#ifdef __RL78__
#else
	#define	RMIDH10	(rmidh10.ALL)
#endif

/* RMTS10L */
#ifdef __RL78__
#else
	#define	RMTS10L	(rmts10.BYTE.rmts10l)
#endif

/* RMTS10H */
#ifdef __RL78__
#else
	#define	RMTS10H	(rmts10.BYTE.rmts10h)
#endif

/* RMTS10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts10l;
	SFR_UNSIGNED_SHORT_INT	rmts10h;
}SFR_BYTE_RMTS10;

typedef union{
	SFR_BYTE_RMTS10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS10;

SFR_GLOBAL	SFR_RMTS10	rmts10;

#ifdef __RL78__
#else
	#define	RMTS10	(rmts10.ALL)
#endif

/* RMPTR10L */
#ifdef __RL78__
#else
	#define	RMPTR10L	(rmptr10.BYTE.rmptr10l)
#endif

/* RMPTR10H */
#ifdef __RL78__
#else
	#define	RMPTR10H	(rmptr10.BYTE.rmptr10h)
#endif

/* RMPTR10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr10l;
	SFR_UNSIGNED_SHORT_INT	rmptr10h;
}SFR_BYTE_RMPTR10;

typedef union{
	SFR_BYTE_RMPTR10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR10;

SFR_GLOBAL	SFR_RMPTR10	rmptr10;

#ifdef __RL78__
#else
	#define	RMPTR10	(rmptr10.ALL)
#endif

/* RMDF010L */
#ifdef __RL78__
#else
	#define	RMDF010L	(rmdf010.BYTE.rmdf010l)
#endif

/* RMDF010H */
#ifdef __RL78__
#else
	#define	RMDF010H	(rmdf010.BYTE.rmdf010h)
#endif

/* RMDF010 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf010l;
	SFR_UNSIGNED_SHORT_INT	rmdf010h;
}SFR_BYTE_RMDF010;

typedef union{
	SFR_BYTE_RMDF010	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF010;

SFR_GLOBAL	SFR_RMDF010	rmdf010;

#ifdef __RL78__
#else
	#define	RMDF010	(rmdf010.ALL)
#endif

/* RMDF110L */
#ifdef __RL78__
#else
	#define	RMDF110L	(rmdf110.BYTE.rmdf110l)
#endif

/* RMDF110H */
#ifdef __RL78__
#else
	#define	RMDF110H	(rmdf110.BYTE.rmdf110h)
#endif

/* RMDF110 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf110l;
	SFR_UNSIGNED_SHORT_INT	rmdf110h;
}SFR_BYTE_RMDF110;

typedef union{
	SFR_BYTE_RMDF110	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF110;

SFR_GLOBAL	SFR_RMDF110	rmdf110;

#ifdef __RL78__
#else
	#define	RMDF110	(rmdf110.ALL)
#endif

/* RMDF210L */
#ifdef __RL78__
#else
	#define	RMDF210L	(rmdf210.BYTE.rmdf210l)
#endif

