turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF210H */
#ifdef __RL78__
#else
	#define	RMDF210H	(rmdf210.BYTE.rmdf210h)
#endif

/* RMDF210 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf210l;
	SFR_UNSIGNED_SHORT_INT	rmdf210h;
}SFR_BYTE_RMDF210;

typedef union{
	SFR_BYTE_RMDF210	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF210;

SFR_GLOBAL	SFR_RMDF210	rmdf210;

#ifdef __RL78__
#else
	#define	RMDF210	(rmdf210.ALL)
#endif

/* RMDF310L */
#ifdef __RL78__
#else
	#define	RMDF310L	(rmdf310.BYTE.rmdf310l)
#endif

/* RMDF310H */
#ifdef __RL78__
#else
	#define	RMDF310H	(rmdf310.BYTE.rmdf310h)
#endif

/* RMDF310 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf310l;
	SFR_UNSIGNED_SHORT_INT	rmdf310h;
}SFR_BYTE_RMDF310;

typedef union{
	SFR_BYTE_RMDF310	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF310;

SFR_GLOBAL	SFR_RMDF310	rmdf310;

#ifdef __RL78__
#else
	#define	RMDF310	(rmdf310.ALL)
#endif

/* RMIDL11L */
#ifdef __RL78__
#else
	#define	RMIDL11L	(rmidl11.BYTE.rmidl11l)
#endif

/* RMIDL11H */
#ifdef __RL78__
#else
	#define	RMIDL11H	(rmidl11.BYTE.rmidl11h)
#endif

/* RMIDL11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl11l;
	SFR_UNSIGNED_SHORT_INT	rmidl11h;
}SFR_BYTE_RMIDL11;

typedef union{
	SFR_BYTE_RMIDL11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL11;

SFR_GLOBAL	SFR_RMIDL11	rmidl11;

#ifdef __RL78__
#else
	#define	RMIDL11	(rmidl11.ALL)
#endif

/* RMIDH11L */
#ifdef __RL78__
#else
	#define	RMIDH11L	(rmidh11.BYTE.rmidh11l)
#endif

/* RMIDH11H */
#ifdef __RL78__
#else
	#define	RMIDH11H	(rmidh11.BYTE.rmidh11h)
#endif

/* RMIDH11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh11l;
	SFR_UNSIGNED_SHORT_INT	rmidh11h;
}SFR_BYTE_RMIDH11;

typedef union{
	SFR_BYTE_RMIDH11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH11;

SFR_GLOBAL	SFR_RMIDH11	rmidh11;

#ifdef __RL78__
#else
	#define	RMIDH11	(rmidh11.ALL)
#endif

/* RMTS11L */
#ifdef __RL78__
#else
	#define	RMTS11L	(rmts11.BYTE.rmts11l)
#endif

/* RMTS11H */
#ifdef __RL78__
#else
	#define	RMTS11H	(rmts11.BYTE.rmts11h)
#endif

/* RMTS11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts11l;
	SFR_UNSIGNED_SHORT_INT	rmts11h;
}SFR_BYTE_RMTS11;

typedef union{
	SFR_BYTE_RMTS11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS11;

SFR_GLOBAL	SFR_RMTS11	rmts11;

#ifdef __RL78__
#else
	#define	RMTS11	(rmts11.ALL)
#endif

/* RMPTR11L */
#ifdef __RL78__
#else
	#define	RMPTR11L	(rmptr11.BYTE.rmptr11l)
#endif

/* RMPTR11H */
#ifdef __RL78__
#else
	#define	RMPTR11H	(rmptr11.BYTE.rmptr11h)
#endif

/* RMPTR11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr11l;
	SFR_UNSIGNED_SHORT_INT	rmptr11h;
}SFR_BYTE_RMPTR11;

typedef union{
	SFR_BYTE_RMPTR11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR11;

SFR_GLOBAL	SFR_RMPTR11	rmptr11;

#ifdef __RL78__
#else
	#define	RMPTR11	(rmptr11.ALL)
#endif

/* RMDF011L */
#ifdef __RL78__
#else
	#define	RMDF011L	(rmdf011.BYTE.rmdf011l)
#endif

/* RMDF011H */
#ifdef __RL78__
#else
	#define	RMDF011H	(rmdf011.BYTE.rmdf011h)
#endif

/* RMDF011 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf011l;
	SFR_UNSIGNED_SHORT_INT	rmdf011h;
}SFR_BYTE_RMDF011;

typedef union{
	SFR_BYTE_RMDF011	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF011;

SFR_GLOBAL	SFR_RMDF011	rmdf011;

#ifdef __RL78__
#else
	#define	RMDF011	(rmdf011.ALL)
#endif

/* RMDF111L */
#ifdef __RL78__
#else
	#define	RMDF111L	(rmdf111.BYTE.rmdf111l)
#endif

/* RMDF111H */
#ifdef __RL78__
#else
	#define	RMDF111H	(rmdf111.BYTE.rmdf111h)
#endif

/* RMDF111 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf111l;
	SFR_UNSIGNED_SHORT_INT	rmdf111h;
}SFR_BYTE_RMDF111;

typedef union{
	SFR_BYTE_RMDF111	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF111;

SFR_GLOBAL	SFR_RMDF111	rmdf111;

#ifdef __RL78__
#else
	#define	RMDF111	(rmdf111.ALL)
#endif

/* RMDF211L */
#ifdef __RL78__
#else
	#define	RMDF211L	(rmdf211.BYTE.rmdf211l)
#endif

/* RMDF211H */
#ifdef __RL78__
#else
	#define	RMDF211H	(rmdf211.BYTE.rmdf211h)
#endif

/* RMDF211 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf211l;
	SFR_UNSIGNED_SHORT_INT	rmdf211h;
}SFR_BYTE_RMDF211;

typedef union{
	SFR_BYTE_RMDF211	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF211;

SFR_GLOBAL	SFR_RMDF211	rmdf211;

#ifdef __RL78__
#else
	#define	RMDF211	(rmdf211.ALL)
#endif

/* RMDF311L */
#ifdef __RL78__
#else
	#define	RMDF311L	(rmdf311.BYTE.rmdf311l)
#endif

/* RMDF311H */
#ifdef __RL78__
#else
	#define	RMDF311H	(rmdf311.BYTE.rmdf311h)
#endif

/* RMDF311 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf311l;
	SFR_UNSIGNED_SHORT_INT	rmdf311h;
}SFR_BYTE_RMDF311;

typedef union{
	SFR_BYTE_RMDF311	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF311;

SFR_GLOBAL	SFR_RMDF311	rmdf311;

#ifdef __RL78__
#else
	#define	RMDF311	(rmdf311.ALL)
#endif

/* RMIDL12L */
#ifdef __RL78__
#else
	#define	RMIDL12L	(rmidl12.BYTE.rmidl12l)
#endif

/* RMIDL12H */
#ifdef __RL78__
#else
	#define	RMIDL12H	(rmidl12.BYTE.rmidl12h)
#endif

/* RMIDL12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl12l;
	SFR_UNSIGNED_SHORT_INT	rmidl12h;
}SFR_BYTE_RMIDL12;

typedef union{
	SFR_BYTE_RMIDL12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL12;

SFR_GLOBAL	SFR_RMIDL12	rmidl12;

#ifdef __RL78__
#else
	#define	RMIDL12	(rmidl12.ALL)
#endif

/* RMIDH12L */
#ifdef __RL78__
#else
	#define	RMIDH12L	(rmidh12.BYTE.rmidh12l)
#endif

/* RMIDH12H */
#ifdef __RL78__
#else
	#define	RMIDH12H	(rmidh12.BYTE.rmidh12h)
#endif

/* RMIDH12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh12l;
	SFR_UNSIGNED_SHORT_INT	rmidh12h;
}SFR_BYTE_RMIDH12;

typedef union{
	SFR_BYTE_RMIDH12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH12;

SFR_GLOBAL	SFR_RMIDH12	rmidh12;

#ifdef __RL78__
#else
	#define	RMIDH12	(rmidh12.ALL)
#endif

/* RMTS12L */
#ifdef __RL78__
#else
	#define	RMTS12L	(rmts12.BYTE.rmts12l)
#endif

/* RMTS12H */
#ifdef __RL78__
#else
	#define	RMTS12H	(rmts12.BYTE.rmts12h)
#endif

/* RMTS12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts12l;
	SFR_UNSIGNED_SHORT_INT	rmts12h;
}SFR_BYTE_RMTS12;

typedef union{
	SFR_BYTE_RMTS12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS12;

SFR_GLOBAL	SFR_RMTS12	rmts12;

#ifdef __RL78__
#else
	#define	RMTS12	(rmts12.ALL)
#endif

/* RMPTR12L */
#ifdef __RL78__
#else
	#define	RMPTR12L	(rmptr12.BYTE.rmptr12l)
#endif

/* RMPTR12H */
#ifdef __RL78__
#else
	#define	RMPTR12H	(rmptr12.BYTE.rmptr12h)
#endif

/* RMPTR12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr12l;
	SFR_UNSIGNED_SHORT_INT	rmptr12h;
}SFR_BYTE_RMPTR12;

typedef union{
	SFR_BYTE_RMPTR12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR12;

SFR_GLOBAL	SFR_RMPTR12	rmptr12;

#ifdef __RL78__
#else
	#define	RMPTR12	(rmptr12.ALL)
#endif

/* RMDF012L */
#ifdef __RL78__
#else
	#define	RMDF012L	(rmdf012.BYTE.rmdf012l)
#endif

/* RMDF012H */
#ifdef __RL78__
#else
	#define	RMDF012H	(rmdf012.BYTE.rmdf012h)
#endif

/* RMDF012 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf012l;
	SFR_UNSIGNED_SHORT_INT	rmdf012h;
}SFR_BYTE_RMDF012;

typedef union{
	SFR_BYTE_RMDF012	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF012;

SFR_GLOBAL	SFR_RMDF012	rmdf012;

#ifdef __RL78__
#else
	#define	RMDF012	(rmdf012.ALL)
#endif

/* RMDF112L */
#ifdef __RL78__
#else
	#define	RMDF112L	(rmdf112.BYTE.rmdf112l)
#endif

/* RMDF112H */
#ifdef __RL78__
#else
	#define	RMDF112H	(rmdf112.BYTE.rmdf112h)
#endif

