turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF112 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf112l;
	SFR_UNSIGNED_SHORT_INT	rmdf112h;
}SFR_BYTE_RMDF112;

typedef union{
	SFR_BYTE_RMDF112	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF112;

SFR_GLOBAL	SFR_RMDF112	rmdf112;

#ifdef __RL78__
#else
	#define	RMDF112	(rmdf112.ALL)
#endif

/* RMDF212L */
#ifdef __RL78__
#else
	#define	RMDF212L	(rmdf212.BYTE.rmdf212l)
#endif

/* RMDF212H */
#ifdef __RL78__
#else
	#define	RMDF212H	(rmdf212.BYTE.rmdf212h)
#endif

/* RMDF212 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf212l;
	SFR_UNSIGNED_SHORT_INT	rmdf212h;
}SFR_BYTE_RMDF212;

typedef union{
	SFR_BYTE_RMDF212	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF212;

SFR_GLOBAL	SFR_RMDF212	rmdf212;

#ifdef __RL78__
#else
	#define	RMDF212	(rmdf212.ALL)
#endif

/* RMDF312L */
#ifdef __RL78__
#else
	#define	RMDF312L	(rmdf312.BYTE.rmdf312l)
#endif

/* RMDF312H */
#ifdef __RL78__
#else
	#define	RMDF312H	(rmdf312.BYTE.rmdf312h)
#endif

/* RMDF312 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf312l;
	SFR_UNSIGNED_SHORT_INT	rmdf312h;
}SFR_BYTE_RMDF312;

typedef union{
	SFR_BYTE_RMDF312	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF312;

SFR_GLOBAL	SFR_RMDF312	rmdf312;

#ifdef __RL78__
#else
	#define	RMDF312	(rmdf312.ALL)
#endif

/* RMIDL13L */
#ifdef __RL78__
#else
	#define	RMIDL13L	(rmidl13.BYTE.rmidl13l)
#endif

/* RMIDL13H */
#ifdef __RL78__
#else
	#define	RMIDL13H	(rmidl13.BYTE.rmidl13h)
#endif

/* RMIDL13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl13l;
	SFR_UNSIGNED_SHORT_INT	rmidl13h;
}SFR_BYTE_RMIDL13;

typedef union{
	SFR_BYTE_RMIDL13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL13;

SFR_GLOBAL	SFR_RMIDL13	rmidl13;

#ifdef __RL78__
#else
	#define	RMIDL13	(rmidl13.ALL)
#endif

/* RMIDH13L */
#ifdef __RL78__
#else
	#define	RMIDH13L	(rmidh13.BYTE.rmidh13l)
#endif

/* RMIDH13H */
#ifdef __RL78__
#else
	#define	RMIDH13H	(rmidh13.BYTE.rmidh13h)
#endif

/* RMIDH13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh13l;
	SFR_UNSIGNED_SHORT_INT	rmidh13h;
}SFR_BYTE_RMIDH13;

typedef union{
	SFR_BYTE_RMIDH13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH13;

SFR_GLOBAL	SFR_RMIDH13	rmidh13;

#ifdef __RL78__
#else
	#define	RMIDH13	(rmidh13.ALL)
#endif

/* RMTS13L */
#ifdef __RL78__
#else
	#define	RMTS13L	(rmts13.BYTE.rmts13l)
#endif

/* RMTS13H */
#ifdef __RL78__
#else
	#define	RMTS13H	(rmts13.BYTE.rmts13h)
#endif

/* RMTS13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts13l;
	SFR_UNSIGNED_SHORT_INT	rmts13h;
}SFR_BYTE_RMTS13;

typedef union{
	SFR_BYTE_RMTS13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS13;

SFR_GLOBAL	SFR_RMTS13	rmts13;

#ifdef __RL78__
#else
	#define	RMTS13	(rmts13.ALL)
#endif

/* RMPTR13L */
#ifdef __RL78__
#else
	#define	RMPTR13L	(rmptr13.BYTE.rmptr13l)
#endif

/* RMPTR13H */
#ifdef __RL78__
#else
	#define	RMPTR13H	(rmptr13.BYTE.rmptr13h)
#endif

/* RMPTR13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr13l;
	SFR_UNSIGNED_SHORT_INT	rmptr13h;
}SFR_BYTE_RMPTR13;

typedef union{
	SFR_BYTE_RMPTR13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR13;

SFR_GLOBAL	SFR_RMPTR13	rmptr13;

#ifdef __RL78__
#else
	#define	RMPTR13	(rmptr13.ALL)
#endif

/* RMDF013L */
#ifdef __RL78__
#else
	#define	RMDF013L	(rmdf013.BYTE.rmdf013l)
#endif

/* RMDF013H */
#ifdef __RL78__
#else
	#define	RMDF013H	(rmdf013.BYTE.rmdf013h)
#endif

/* RMDF013 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf013l;
	SFR_UNSIGNED_SHORT_INT	rmdf013h;
}SFR_BYTE_RMDF013;

typedef union{
	SFR_BYTE_RMDF013	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF013;

SFR_GLOBAL	SFR_RMDF013	rmdf013;

#ifdef __RL78__
#else
	#define	RMDF013	(rmdf013.ALL)
#endif

/* RMDF113L */
#ifdef __RL78__
#else
	#define	RMDF113L	(rmdf113.BYTE.rmdf113l)
#endif

/* RMDF113H */
#ifdef __RL78__
#else
	#define	RMDF113H	(rmdf113.BYTE.rmdf113h)
#endif

/* RMDF113 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf113l;
	SFR_UNSIGNED_SHORT_INT	rmdf113h;
}SFR_BYTE_RMDF113;

typedef union{
	SFR_BYTE_RMDF113	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF113;

SFR_GLOBAL	SFR_RMDF113	rmdf113;

#ifdef __RL78__
#else
	#define	RMDF113	(rmdf113.ALL)
#endif

/* RMDF213L */
#ifdef __RL78__
#else
	#define	RMDF213L	(rmdf213.BYTE.rmdf213l)
#endif

/* RMDF213H */
#ifdef __RL78__
#else
	#define	RMDF213H	(rmdf213.BYTE.rmdf213h)
#endif

/* RMDF213 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf213l;
	SFR_UNSIGNED_SHORT_INT	rmdf213h;
}SFR_BYTE_RMDF213;

typedef union{
	SFR_BYTE_RMDF213	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF213;

SFR_GLOBAL	SFR_RMDF213	rmdf213;

#ifdef __RL78__
#else
	#define	RMDF213	(rmdf213.ALL)
#endif

/* RMDF313L */
#ifdef __RL78__
#else
	#define	RMDF313L	(rmdf313.BYTE.rmdf313l)
#endif

/* RMDF313H */
#ifdef __RL78__
#else
	#define	RMDF313H	(rmdf313.BYTE.rmdf313h)
#endif

/* RMDF313 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf313l;
	SFR_UNSIGNED_SHORT_INT	rmdf313h;
}SFR_BYTE_RMDF313;

typedef union{
	SFR_BYTE_RMDF313	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF313;

SFR_GLOBAL	SFR_RMDF313	rmdf313;

#ifdef __RL78__
#else
	#define	RMDF313	(rmdf313.ALL)
#endif

/* RMIDL14L */
#ifdef __RL78__
#else
	#define	RMIDL14L	(rmidl14.BYTE.rmidl14l)
#endif

/* RMIDL14H */
#ifdef __RL78__
#else
	#define	RMIDL14H	(rmidl14.BYTE.rmidl14h)
#endif

/* RMIDL14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl14l;
	SFR_UNSIGNED_SHORT_INT	rmidl14h;
}SFR_BYTE_RMIDL14;

typedef union{
	SFR_BYTE_RMIDL14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL14;

SFR_GLOBAL	SFR_RMIDL14	rmidl14;

#ifdef __RL78__
#else
	#define	RMIDL14	(rmidl14.ALL)
#endif

/* RMIDH14L */
#ifdef __RL78__
#else
	#define	RMIDH14L	(rmidh14.BYTE.rmidh14l)
#endif

/* RMIDH14H */
#ifdef __RL78__
#else
	#define	RMIDH14H	(rmidh14.BYTE.rmidh14h)
#endif

/* RMIDH14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh14l;
	SFR_UNSIGNED_SHORT_INT	rmidh14h;
}SFR_BYTE_RMIDH14;

typedef union{
	SFR_BYTE_RMIDH14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH14;

SFR_GLOBAL	SFR_RMIDH14	rmidh14;

#ifdef __RL78__
#else
	#define	RMIDH14	(rmidh14.ALL)
#endif

/* RMTS14L */
#ifdef __RL78__
#else
	#define	RMTS14L	(rmts14.BYTE.rmts14l)
#endif

/* RMTS14H */
#ifdef __RL78__
#else
	#define	RMTS14H	(rmts14.BYTE.rmts14h)
#endif

/* RMTS14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts14l;
	SFR_UNSIGNED_SHORT_INT	rmts14h;
}SFR_BYTE_RMTS14;

typedef union{
	SFR_BYTE_RMTS14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS14;

SFR_GLOBAL	SFR_RMTS14	rmts14;

#ifdef __RL78__
#else
	#define	RMTS14	(rmts14.ALL)
#endif

/* RMPTR14L */
#ifdef __RL78__
#else
	#define	RMPTR14L	(rmptr14.BYTE.rmptr14l)
#endif

/* RMPTR14H */
#ifdef __RL78__
#else
	#define	RMPTR14H	(rmptr14.BYTE.rmptr14h)
#endif

/* RMPTR14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr14l;
	SFR_UNSIGNED_SHORT_INT	rmptr14h;
}SFR_BYTE_RMPTR14;

typedef union{
	SFR_BYTE_RMPTR14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR14;

SFR_GLOBAL	SFR_RMPTR14	rmptr14;

#ifdef __RL78__
#else
	#define	RMPTR14	(rmptr14.ALL)
#endif

/* RMDF014L */
#ifdef __RL78__
#else
	#define	RMDF014L	(rmdf014.BYTE.rmdf014l)
#endif

/* RMDF014H */
#ifdef __RL78__
#else
	#define	RMDF014H	(rmdf014.BYTE.rmdf014h)
#endif

/* RMDF014 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf014l;
	SFR_UNSIGNED_SHORT_INT	rmdf014h;
}SFR_BYTE_RMDF014;

typedef union{
	SFR_BYTE_RMDF014	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF014;

SFR_GLOBAL	SFR_RMDF014	rmdf014;

#ifdef __RL78__
#else
	#define	RMDF014	(rmdf014.ALL)
#endif

/* RMDF114L */
#ifdef __RL78__
#else
	#define	RMDF114L	(rmdf114.BYTE.rmdf114l)
#endif

/* RMDF114H */
#ifdef __RL78__
#else
	#define	RMDF114H	(rmdf114.BYTE.rmdf114h)
#endif

