turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RMDF114 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf114l;
	SFR_UNSIGNED_SHORT_INT	rmdf114h;
}SFR_BYTE_RMDF114;

typedef union{
	SFR_BYTE_RMDF114	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF114;

SFR_GLOBAL	SFR_RMDF114	rmdf114;

#ifdef __RL78__
#else
	#define	RMDF114	(rmdf114.ALL)
#endif

/* RMDF214L */
#ifdef __RL78__
#else
	#define	RMDF214L	(rmdf214.BYTE.rmdf214l)
#endif

/* RMDF214H */
#ifdef __RL78__
#else
	#define	RMDF214H	(rmdf214.BYTE.rmdf214h)
#endif

/* RMDF214 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf214l;
	SFR_UNSIGNED_SHORT_INT	rmdf214h;
}SFR_BYTE_RMDF214;

typedef union{
	SFR_BYTE_RMDF214	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF214;

SFR_GLOBAL	SFR_RMDF214	rmdf214;

#ifdef __RL78__
#else
	#define	RMDF214	(rmdf214.ALL)
#endif

/* RMDF314L */
#ifdef __RL78__
#else
	#define	RMDF314L	(rmdf314.BYTE.rmdf314l)
#endif

/* RMDF314H */
#ifdef __RL78__
#else
	#define	RMDF314H	(rmdf314.BYTE.rmdf314h)
#endif

/* RMDF314 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf314l;
	SFR_UNSIGNED_SHORT_INT	rmdf314h;
}SFR_BYTE_RMDF314;

typedef union{
	SFR_BYTE_RMDF314	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF314;

SFR_GLOBAL	SFR_RMDF314	rmdf314;

#ifdef __RL78__
#else
	#define	RMDF314	(rmdf314.ALL)
#endif

/* RMIDL15L */
#ifdef __RL78__
#else
	#define	RMIDL15L	(rmidl15.BYTE.rmidl15l)
#endif

/* RMIDL15H */
#ifdef __RL78__
#else
	#define	RMIDL15H	(rmidl15.BYTE.rmidl15h)
#endif

/* RMIDL15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidl15l;
	SFR_UNSIGNED_SHORT_INT	rmidl15h;
}SFR_BYTE_RMIDL15;

typedef union{
	SFR_BYTE_RMIDL15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDL15;

SFR_GLOBAL	SFR_RMIDL15	rmidl15;

#ifdef __RL78__
#else
	#define	RMIDL15	(rmidl15.ALL)
#endif

/* RMIDH15L */
#ifdef __RL78__
#else
	#define	RMIDH15L	(rmidh15.BYTE.rmidh15l)
#endif

/* RMIDH15H */
#ifdef __RL78__
#else
	#define	RMIDH15H	(rmidh15.BYTE.rmidh15h)
#endif

/* RMIDH15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmidh15l;
	SFR_UNSIGNED_SHORT_INT	rmidh15h;
}SFR_BYTE_RMIDH15;

typedef union{
	SFR_BYTE_RMIDH15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMIDH15;

SFR_GLOBAL	SFR_RMIDH15	rmidh15;

#ifdef __RL78__
#else
	#define	RMIDH15	(rmidh15.ALL)
#endif

/* RMTS15L */
#ifdef __RL78__
#else
	#define	RMTS15L	(rmts15.BYTE.rmts15l)
#endif

/* RMTS15H */
#ifdef __RL78__
#else
	#define	RMTS15H	(rmts15.BYTE.rmts15h)
#endif

/* RMTS15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmts15l;
	SFR_UNSIGNED_SHORT_INT	rmts15h;
}SFR_BYTE_RMTS15;

typedef union{
	SFR_BYTE_RMTS15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMTS15;

SFR_GLOBAL	SFR_RMTS15	rmts15;

#ifdef __RL78__
#else
	#define	RMTS15	(rmts15.ALL)
#endif

/* RMPTR15L */
#ifdef __RL78__
#else
	#define	RMPTR15L	(rmptr15.BYTE.rmptr15l)
#endif

/* RMPTR15H */
#ifdef __RL78__
#else
	#define	RMPTR15H	(rmptr15.BYTE.rmptr15h)
#endif

/* RMPTR15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmptr15l;
	SFR_UNSIGNED_SHORT_INT	rmptr15h;
}SFR_BYTE_RMPTR15;

typedef union{
	SFR_BYTE_RMPTR15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMPTR15;

SFR_GLOBAL	SFR_RMPTR15	rmptr15;

#ifdef __RL78__
#else
	#define	RMPTR15	(rmptr15.ALL)
#endif

/* RMDF015L */
#ifdef __RL78__
#else
	#define	RMDF015L	(rmdf015.BYTE.rmdf015l)
#endif

/* RMDF015H */
#ifdef __RL78__
#else
	#define	RMDF015H	(rmdf015.BYTE.rmdf015h)
#endif

/* RMDF015 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf015l;
	SFR_UNSIGNED_SHORT_INT	rmdf015h;
}SFR_BYTE_RMDF015;

typedef union{
	SFR_BYTE_RMDF015	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF015;

SFR_GLOBAL	SFR_RMDF015	rmdf015;

#ifdef __RL78__
#else
	#define	RMDF015	(rmdf015.ALL)
#endif

/* RMDF115L */
#ifdef __RL78__
#else
	#define	RMDF115L	(rmdf115.BYTE.rmdf115l)
#endif

/* RMDF115H */
#ifdef __RL78__
#else
	#define	RMDF115H	(rmdf115.BYTE.rmdf115h)
#endif

/* RMDF115 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf115l;
	SFR_UNSIGNED_SHORT_INT	rmdf115h;
}SFR_BYTE_RMDF115;

typedef union{
	SFR_BYTE_RMDF115	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF115;

SFR_GLOBAL	SFR_RMDF115	rmdf115;

#ifdef __RL78__
#else
	#define	RMDF115	(rmdf115.ALL)
#endif

/* RMDF215L */
#ifdef __RL78__
#else
	#define	RMDF215L	(rmdf215.BYTE.rmdf215l)
#endif

/* RMDF215H */
#ifdef __RL78__
#else
	#define	RMDF215H	(rmdf215.BYTE.rmdf215h)
#endif

/* RMDF215 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf215l;
	SFR_UNSIGNED_SHORT_INT	rmdf215h;
}SFR_BYTE_RMDF215;

typedef union{
	SFR_BYTE_RMDF215	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF215;

SFR_GLOBAL	SFR_RMDF215	rmdf215;

#ifdef __RL78__
#else
	#define	RMDF215	(rmdf215.ALL)
#endif

/* RMDF315L */
#ifdef __RL78__
#else
	#define	RMDF315L	(rmdf315.BYTE.rmdf315l)
#endif

/* RMDF315H */
#ifdef __RL78__
#else
	#define	RMDF315H	(rmdf315.BYTE.rmdf315h)
#endif

/* RMDF315 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rmdf315l;
	SFR_UNSIGNED_SHORT_INT	rmdf315h;
}SFR_BYTE_RMDF315;

typedef union{
	SFR_BYTE_RMDF315	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RMDF315;

SFR_GLOBAL	SFR_RMDF315	rmdf315;

#ifdef __RL78__
#else
	#define	RMDF315	(rmdf315.ALL)
#endif
/* CAN受信バッファ・レジスタここまで */

/* CAN用RAMテスト・レジスタここから */
/* RPGACC0L */
#ifdef __RL78__
#else
	#define	RPGACC0L	(rpgacc0.BYTE.rpgacc0l)
#endif

/* RPGACC0H */
#ifdef __RL78__
#else
	#define	RPGACC0H	(rpgacc0.BYTE.rpgacc0h)
#endif

/* RPGACC0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc0l;
	SFR_UNSIGNED_SHORT_INT	rpgacc0h;
}SFR_BYTE_RPGACC0;

typedef union{
	SFR_BYTE_RPGACC0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC0;

SFR_GLOBAL	SFR_RPGACC0	rpgacc0;

#ifdef __RL78__
#else
	#define	RPGACC0	(rpgacc0.ALL)
#endif

/* RPGACC1L */
#ifdef __RL78__
#else
	#define	RPGACC1L	(rpgacc1.BYTE.rpgacc1l)
#endif

/* RPGACC1H */
#ifdef __RL78__
#else
	#define	RPGACC1H	(rpgacc1.BYTE.rpgacc1h)
#endif

