turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc1l;
	SFR_UNSIGNED_SHORT_INT	rpgacc1h;
}SFR_BYTE_RPGACC1;

typedef union{
	SFR_BYTE_RPGACC1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC1;

SFR_GLOBAL	SFR_RPGACC1	rpgacc1;

#ifdef __RL78__
#else
	#define	RPGACC1	(rpgacc1.ALL)
#endif

/* RPGACC2L */
#ifdef __RL78__
#else
	#define	RPGACC2L	(rpgacc2.BYTE.rpgacc2l)
#endif

/* RPGACC2H */
#ifdef __RL78__
#else
	#define	RPGACC2H	(rpgacc2.BYTE.rpgacc2h)
#endif

/* RPGACC2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc2l;
	SFR_UNSIGNED_SHORT_INT	rpgacc2h;
}SFR_BYTE_RPGACC2;

typedef union{
	SFR_BYTE_RPGACC2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC2;

SFR_GLOBAL	SFR_RPGACC2	rpgacc2;

#ifdef __RL78__
#else
	#define	RPGACC2	(rpgacc2.ALL)
#endif

/* RPGACC3L */
#ifdef __RL78__
#else
	#define	RPGACC3L	(rpgacc3.BYTE.rpgacc3l)
#endif

/* RPGACC3H */
#ifdef __RL78__
#else
	#define	RPGACC3H	(rpgacc3.BYTE.rpgacc3h)
#endif

/* RPGACC3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc3l;
	SFR_UNSIGNED_SHORT_INT	rpgacc3h;
}SFR_BYTE_RPGACC3;

typedef union{
	SFR_BYTE_RPGACC3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC3;

SFR_GLOBAL	SFR_RPGACC3	rpgacc3;

#ifdef __RL78__
#else
	#define	RPGACC3	(rpgacc3.ALL)
#endif

/* RPGACC4L */
#ifdef __RL78__
#else
	#define	RPGACC4L	(rpgacc4.BYTE.rpgacc4l)
#endif

/* RPGACC4H */
#ifdef __RL78__
#else
	#define	RPGACC4H	(rpgacc4.BYTE.rpgacc4h)
#endif

/* RPGACC4 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc4l;
	SFR_UNSIGNED_SHORT_INT	rpgacc4h;
}SFR_BYTE_RPGACC4;

typedef union{
	SFR_BYTE_RPGACC4	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC4;

SFR_GLOBAL	SFR_RPGACC4	rpgacc4;

#ifdef __RL78__
#else
	#define	RPGACC4	(rpgacc4.ALL)
#endif

/* RPGACC5L */
#ifdef __RL78__
#else
	#define	RPGACC5L	(rpgacc5.BYTE.rpgacc5l)
#endif

/* RPGACC5H */
#ifdef __RL78__
#else
	#define	RPGACC5H	(rpgacc5.BYTE.rpgacc5h)
#endif

/* RPGACC5 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc5l;
	SFR_UNSIGNED_SHORT_INT	rpgacc5h;
}SFR_BYTE_RPGACC5;

typedef union{
	SFR_BYTE_RPGACC5	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC5;

SFR_GLOBAL	SFR_RPGACC5	rpgacc5;

#ifdef __RL78__
#else
	#define	RPGACC5	(rpgacc5.ALL)
#endif

/* RPGACC6L */
#ifdef __RL78__
#else
	#define	RPGACC6L	(rpgacc6.BYTE.rpgacc6l)
#endif

/* RPGACC6H */
#ifdef __RL78__
#else
	#define	RPGACC6H	(rpgacc6.BYTE.rpgacc6h)
#endif

/* RPGACC6 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc6l;
	SFR_UNSIGNED_SHORT_INT	rpgacc6h;
}SFR_BYTE_RPGACC6;

typedef union{
	SFR_BYTE_RPGACC6	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC6;

SFR_GLOBAL	SFR_RPGACC6	rpgacc6;

#ifdef __RL78__
#else
	#define	RPGACC6	(rpgacc6.ALL)
#endif

/* RPGACC7L */
#ifdef __RL78__
#else
	#define	RPGACC7L	(rpgacc7.BYTE.rpgacc7l)
#endif

/* RPGACC7H */
#ifdef __RL78__
#else
	#define	RPGACC7H	(rpgacc7.BYTE.rpgacc7h)
#endif

/* RPGACC7 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc7l;
	SFR_UNSIGNED_SHORT_INT	rpgacc7h;
}SFR_BYTE_RPGACC7;

typedef union{
	SFR_BYTE_RPGACC7	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC7;

SFR_GLOBAL	SFR_RPGACC7	rpgacc7;

#ifdef __RL78__
#else
	#define	RPGACC7	(rpgacc7.ALL)
#endif

/* RPGACC8L */
#ifdef __RL78__
#else
	#define	RPGACC8L	(rpgacc8.BYTE.rpgacc8l)
#endif

/* RPGACC8H */
#ifdef __RL78__
#else
	#define	RPGACC8H	(rpgacc8.BYTE.rpgacc8h)
#endif

/* RPGACC8 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc8l;
	SFR_UNSIGNED_SHORT_INT	rpgacc8h;
}SFR_BYTE_RPGACC8;

typedef union{
	SFR_BYTE_RPGACC8	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC8;

SFR_GLOBAL	SFR_RPGACC8	rpgacc8;

#ifdef __RL78__
#else
	#define	RPGACC8	(rpgacc8.ALL)
#endif

/* RPGACC9L */
#ifdef __RL78__
#else
	#define	RPGACC9L	(rpgacc9.BYTE.rpgacc9l)
#endif

/* RPGACC9H */
#ifdef __RL78__
#else
	#define	RPGACC9H	(rpgacc9.BYTE.rpgacc9h)
#endif

/* RPGACC9 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc9l;
	SFR_UNSIGNED_SHORT_INT	rpgacc9h;
}SFR_BYTE_RPGACC9;

typedef union{
	SFR_BYTE_RPGACC9	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC9;

SFR_GLOBAL	SFR_RPGACC9	rpgacc9;

#ifdef __RL78__
#else
	#define	RPGACC9	(rpgacc9.ALL)
#endif

/* RPGACC10L */
#ifdef __RL78__
#else
	#define	RPGACC10L	(rpgacc10.BYTE.rpgacc10l)
#endif

/* RPGACC10H */
#ifdef __RL78__
#else
	#define	RPGACC10H	(rpgacc10.BYTE.rpgacc10h)
#endif

/* RPGACC10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc10l;
	SFR_UNSIGNED_SHORT_INT	rpgacc10h;
}SFR_BYTE_RPGACC10;

typedef union{
	SFR_BYTE_RPGACC10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC10;

SFR_GLOBAL	SFR_RPGACC10	rpgacc10;

#ifdef __RL78__
#else
	#define	RPGACC10	(rpgacc10.ALL)
#endif

/* RPGACC11L */
#ifdef __RL78__
#else
	#define	RPGACC11L	(rpgacc11.BYTE.rpgacc11l)
#endif

/* RPGACC11H */
#ifdef __RL78__
#else
	#define	RPGACC11H	(rpgacc11.BYTE.rpgacc11h)
#endif

/* RPGACC11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc11l;
	SFR_UNSIGNED_SHORT_INT	rpgacc11h;
}SFR_BYTE_RPGACC11;

typedef union{
	SFR_BYTE_RPGACC11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC11;

SFR_GLOBAL	SFR_RPGACC11	rpgacc11;

#ifdef __RL78__
#else
	#define	RPGACC11	(rpgacc11.ALL)
#endif

/* RPGACC12L */
#ifdef __RL78__
#else
	#define	RPGACC12L	(rpgacc12.BYTE.rpgacc12l)
#endif

/* RPGACC12H */
#ifdef __RL78__
#else
	#define	RPGACC12H	(rpgacc12.BYTE.rpgacc12h)
#endif

/* RPGACC12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc12l;
	SFR_UNSIGNED_SHORT_INT	rpgacc12h;
}SFR_BYTE_RPGACC12;

typedef union{
	SFR_BYTE_RPGACC12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC12;

SFR_GLOBAL	SFR_RPGACC12	rpgacc12;

#ifdef __RL78__
#else
	#define	RPGACC12	(rpgacc12.ALL)
#endif

/* RPGACC13L */
#ifdef __RL78__
#else
	#define	RPGACC13L	(rpgacc13.BYTE.rpgacc13l)
#endif

/* RPGACC13H */
#ifdef __RL78__
#else
	#define	RPGACC13H	(rpgacc13.BYTE.rpgacc13h)
#endif

