turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc13l;
	SFR_UNSIGNED_SHORT_INT	rpgacc13h;
}SFR_BYTE_RPGACC13;

typedef union{
	SFR_BYTE_RPGACC13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC13;

SFR_GLOBAL	SFR_RPGACC13	rpgacc13;

#ifdef __RL78__
#else
	#define	RPGACC13	(rpgacc13.ALL)
#endif

/* RPGACC14L */
#ifdef __RL78__
#else
	#define	RPGACC14L	(rpgacc14.BYTE.rpgacc14l)
#endif

/* RPGACC14H */
#ifdef __RL78__
#else
	#define	RPGACC14H	(rpgacc14.BYTE.rpgacc14h)
#endif

/* RPGACC14 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc14l;
	SFR_UNSIGNED_SHORT_INT	rpgacc14h;
}SFR_BYTE_RPGACC14;

typedef union{
	SFR_BYTE_RPGACC14	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC14;

SFR_GLOBAL	SFR_RPGACC14	rpgacc14;

#ifdef __RL78__
#else
	#define	RPGACC14	(rpgacc14.ALL)
#endif

/* RPGACC15L */
#ifdef __RL78__
#else
	#define	RPGACC15L	(rpgacc15.BYTE.rpgacc15l)
#endif

/* RPGACC15H */
#ifdef __RL78__
#else
	#define	RPGACC15H	(rpgacc15.BYTE.rpgacc15h)
#endif

/* RPGACC15 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc15l;
	SFR_UNSIGNED_SHORT_INT	rpgacc15h;
}SFR_BYTE_RPGACC15;

typedef union{
	SFR_BYTE_RPGACC15	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC15;

SFR_GLOBAL	SFR_RPGACC15	rpgacc15;

#ifdef __RL78__
#else
	#define	RPGACC15	(rpgacc15.ALL)
#endif

/* RPGACC16L */
#ifdef __RL78__
#else
	#define	RPGACC16L	(rpgacc16.BYTE.rpgacc16l)
#endif

/* RPGACC16H */
#ifdef __RL78__
#else
	#define	RPGACC16H	(rpgacc16.BYTE.rpgacc16h)
#endif

/* RPGACC16 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc16l;
	SFR_UNSIGNED_SHORT_INT	rpgacc16h;
}SFR_BYTE_RPGACC16;

typedef union{
	SFR_BYTE_RPGACC16	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC16;

SFR_GLOBAL	SFR_RPGACC16	rpgacc16;

#ifdef __RL78__
#else
	#define	RPGACC16	(rpgacc16.ALL)
#endif

/* RPGACC17L */
#ifdef __RL78__
#else
	#define	RPGACC17L	(rpgacc17.BYTE.rpgacc17l)
#endif

/* RPGACC17H */
#ifdef __RL78__
#else
	#define	RPGACC17H	(rpgacc17.BYTE.rpgacc17h)
#endif

/* RPGACC17 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc17l;
	SFR_UNSIGNED_SHORT_INT	rpgacc17h;
}SFR_BYTE_RPGACC17;

typedef union{
	SFR_BYTE_RPGACC17	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC17;

SFR_GLOBAL	SFR_RPGACC17	rpgacc17;

#ifdef __RL78__
#else
	#define	RPGACC17	(rpgacc17.ALL)
#endif

/* RPGACC18L */
#ifdef __RL78__
#else
	#define	RPGACC18L	(rpgacc18.BYTE.rpgacc18l)
#endif

/* RPGACC18H */
#ifdef __RL78__
#else
	#define	RPGACC18H	(rpgacc18.BYTE.rpgacc18h)
#endif

/* RPGACC18 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc18l;
	SFR_UNSIGNED_SHORT_INT	rpgacc18h;
}SFR_BYTE_RPGACC18;

typedef union{
	SFR_BYTE_RPGACC18	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC18;

SFR_GLOBAL	SFR_RPGACC18	rpgacc18;

#ifdef __RL78__
#else
	#define	RPGACC18	(rpgacc18.ALL)
#endif

/* RPGACC19L */
#ifdef __RL78__
#else
	#define	RPGACC19L	(rpgacc19.BYTE.rpgacc19l)
#endif

/* RPGACC19H */
#ifdef __RL78__
#else
	#define	RPGACC19H	(rpgacc19.BYTE.rpgacc19h)
#endif

/* RPGACC19 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc19l;
	SFR_UNSIGNED_SHORT_INT	rpgacc19h;
}SFR_BYTE_RPGACC19;

typedef union{
	SFR_BYTE_RPGACC19	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC19;

SFR_GLOBAL	SFR_RPGACC19	rpgacc19;

#ifdef __RL78__
#else
	#define	RPGACC19	(rpgacc19.ALL)
#endif

/* RPGACC20L */
#ifdef __RL78__
#else
	#define	RPGACC20L	(rpgacc20.BYTE.rpgacc20l)
#endif

/* RPGACC20H */
#ifdef __RL78__
#else
	#define	RPGACC20H	(rpgacc20.BYTE.rpgacc20h)
#endif

/* RPGACC20 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc20l;
	SFR_UNSIGNED_SHORT_INT	rpgacc20h;
}SFR_BYTE_RPGACC20;

typedef union{
	SFR_BYTE_RPGACC20	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC20;

SFR_GLOBAL	SFR_RPGACC20	rpgacc20;

#ifdef __RL78__
#else
	#define	RPGACC20	(rpgacc20.ALL)
#endif

/* RPGACC21L */
#ifdef __RL78__
#else
	#define	RPGACC21L	(rpgacc21.BYTE.rpgacc21l)
#endif

/* RPGACC21H */
#ifdef __RL78__
#else
	#define	RPGACC21H	(rpgacc21.BYTE.rpgacc21h)
#endif

/* RPGACC21 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc21l;
	SFR_UNSIGNED_SHORT_INT	rpgacc21h;
}SFR_BYTE_RPGACC21;

typedef union{
	SFR_BYTE_RPGACC21	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC21;

SFR_GLOBAL	SFR_RPGACC21	rpgacc21;

#ifdef __RL78__
#else
	#define	RPGACC21	(rpgacc21.ALL)
#endif

/* RPGACC22L */
#ifdef __RL78__
#else
	#define	RPGACC22L	(rpgacc22.BYTE.rpgacc22l)
#endif

/* RPGACC22H */
#ifdef __RL78__
#else
	#define	RPGACC22H	(rpgacc22.BYTE.rpgacc22h)
#endif

/* RPGACC22 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc22l;
	SFR_UNSIGNED_SHORT_INT	rpgacc22h;
}SFR_BYTE_RPGACC22;

typedef union{
	SFR_BYTE_RPGACC22	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC22;

SFR_GLOBAL	SFR_RPGACC22	rpgacc22;

#ifdef __RL78__
#else
	#define	RPGACC22	(rpgacc22.ALL)
#endif

/* RPGACC23L */
#ifdef __RL78__
#else
	#define	RPGACC23L	(rpgacc23.BYTE.rpgacc23l)
#endif

/* RPGACC23H */
#ifdef __RL78__
#else
	#define	RPGACC23H	(rpgacc23.BYTE.rpgacc23h)
#endif

/* RPGACC23 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc23l;
	SFR_UNSIGNED_SHORT_INT	rpgacc23h;
}SFR_BYTE_RPGACC23;

typedef union{
	SFR_BYTE_RPGACC23	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC23;

SFR_GLOBAL	SFR_RPGACC23	rpgacc23;

#ifdef __RL78__
#else
	#define	RPGACC23	(rpgacc23.ALL)
#endif

/* RPGACC24L */
#ifdef __RL78__
#else
	#define	RPGACC24L	(rpgacc24.BYTE.rpgacc24l)
#endif

/* RPGACC24H */
#ifdef __RL78__
#else
	#define	RPGACC24H	(rpgacc24.BYTE.rpgacc24h)
#endif

/* RPGACC24 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc24l;
	SFR_UNSIGNED_SHORT_INT	rpgacc24h;
}SFR_BYTE_RPGACC24;

typedef union{
	SFR_BYTE_RPGACC24	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC24;

SFR_GLOBAL	SFR_RPGACC24	rpgacc24;

#ifdef __RL78__
#else
	#define	RPGACC24	(rpgacc24.ALL)
#endif

/* RPGACC25L */
#ifdef __RL78__
#else
	#define	RPGACC25L	(rpgacc25.BYTE.rpgacc25l)
#endif

/* RPGACC25H */
#ifdef __RL78__
#else
	#define	RPGACC25H	(rpgacc25.BYTE.rpgacc25h)
#endif

