turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC25 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc25l;
	SFR_UNSIGNED_SHORT_INT	rpgacc25h;
}SFR_BYTE_RPGACC25;

typedef union{
	SFR_BYTE_RPGACC25	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC25;

SFR_GLOBAL	SFR_RPGACC25	rpgacc25;

#ifdef __RL78__
#else
	#define	RPGACC25	(rpgacc25.ALL)
#endif

/* RPGACC26L */
#ifdef __RL78__
#else
	#define	RPGACC26L	(rpgacc26.BYTE.rpgacc26l)
#endif

/* RPGACC26H */
#ifdef __RL78__
#else
	#define	RPGACC26H	(rpgacc26.BYTE.rpgacc26h)
#endif

/* RPGACC26 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc26l;
	SFR_UNSIGNED_SHORT_INT	rpgacc26h;
}SFR_BYTE_RPGACC26;

typedef union{
	SFR_BYTE_RPGACC26	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC26;

SFR_GLOBAL	SFR_RPGACC26	rpgacc26;

#ifdef __RL78__
#else
	#define	RPGACC26	(rpgacc26.ALL)
#endif

/* RPGACC27L */
#ifdef __RL78__
#else
	#define	RPGACC27L	(rpgacc27.BYTE.rpgacc27l)
#endif

/* RPGACC27H */
#ifdef __RL78__
#else
	#define	RPGACC27H	(rpgacc27.BYTE.rpgacc27h)
#endif

/* RPGACC27 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc27l;
	SFR_UNSIGNED_SHORT_INT	rpgacc27h;
}SFR_BYTE_RPGACC27;

typedef union{
	SFR_BYTE_RPGACC27	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC27;

SFR_GLOBAL	SFR_RPGACC27	rpgacc27;

#ifdef __RL78__
#else
	#define	RPGACC27	(rpgacc27.ALL)
#endif

/* RPGACC28L */
#ifdef __RL78__
#else
	#define	RPGACC28L	(rpgacc28.BYTE.rpgacc28l)
#endif

/* RPGACC28H */
#ifdef __RL78__
#else
	#define	RPGACC28H	(rpgacc28.BYTE.rpgacc28h)
#endif

/* RPGACC28 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc28l;
	SFR_UNSIGNED_SHORT_INT	rpgacc28h;
}SFR_BYTE_RPGACC28;

typedef union{
	SFR_BYTE_RPGACC28	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC28;

SFR_GLOBAL	SFR_RPGACC28	rpgacc28;

#ifdef __RL78__
#else
	#define	RPGACC28	(rpgacc28.ALL)
#endif

/* RPGACC29L */
#ifdef __RL78__
#else
	#define	RPGACC29L	(rpgacc29.BYTE.rpgacc29l)
#endif

/* RPGACC29H */
#ifdef __RL78__
#else
	#define	RPGACC29H	(rpgacc29.BYTE.rpgacc29h)
#endif

/* RPGACC29 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc29l;
	SFR_UNSIGNED_SHORT_INT	rpgacc29h;
}SFR_BYTE_RPGACC29;

typedef union{
	SFR_BYTE_RPGACC29	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC29;

SFR_GLOBAL	SFR_RPGACC29	rpgacc29;

#ifdef __RL78__
#else
	#define	RPGACC29	(rpgacc29.ALL)
#endif

/* RPGACC30L */
#ifdef __RL78__
#else
	#define	RPGACC30L	(rpgacc30.BYTE.rpgacc30l)
#endif

/* RPGACC30H */
#ifdef __RL78__
#else
	#define	RPGACC30H	(rpgacc30.BYTE.rpgacc30h)
#endif

/* RPGACC30 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc30l;
	SFR_UNSIGNED_SHORT_INT	rpgacc30h;
}SFR_BYTE_RPGACC30;

typedef union{
	SFR_BYTE_RPGACC30	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC30;

SFR_GLOBAL	SFR_RPGACC30	rpgacc30;

#ifdef __RL78__
#else
	#define	RPGACC30	(rpgacc30.ALL)
#endif

/* RPGACC31L */
#ifdef __RL78__
#else
	#define	RPGACC31L	(rpgacc31.BYTE.rpgacc31l)
#endif

/* RPGACC31H */
#ifdef __RL78__
#else
	#define	RPGACC31H	(rpgacc31.BYTE.rpgacc31h)
#endif

/* RPGACC31 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc31l;
	SFR_UNSIGNED_SHORT_INT	rpgacc31h;
}SFR_BYTE_RPGACC31;

typedef union{
	SFR_BYTE_RPGACC31	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC31;

SFR_GLOBAL	SFR_RPGACC31	rpgacc31;

#ifdef __RL78__
#else
	#define	RPGACC31	(rpgacc31.ALL)
#endif

/* RPGACC32L */
#ifdef __RL78__
#else
	#define	RPGACC32L	(rpgacc32.BYTE.rpgacc32l)
#endif

/* RPGACC32H */
#ifdef __RL78__
#else
	#define	RPGACC32H	(rpgacc32.BYTE.rpgacc32h)
#endif

/* RPGACC32 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc32l;
	SFR_UNSIGNED_SHORT_INT	rpgacc32h;
}SFR_BYTE_RPGACC32;

typedef union{
	SFR_BYTE_RPGACC32	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC32;

SFR_GLOBAL	SFR_RPGACC32	rpgacc32;

#ifdef __RL78__
#else
	#define	RPGACC32	(rpgacc32.ALL)
#endif

/* RPGACC33L */
#ifdef __RL78__
#else
	#define	RPGACC33L	(rpgacc33.BYTE.rpgacc33l)
#endif

/* RPGACC33H */
#ifdef __RL78__
#else
	#define	RPGACC33H	(rpgacc33.BYTE.rpgacc33h)
#endif

/* RPGACC33 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc33l;
	SFR_UNSIGNED_SHORT_INT	rpgacc33h;
}SFR_BYTE_RPGACC33;

typedef union{
	SFR_BYTE_RPGACC33	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC33;

SFR_GLOBAL	SFR_RPGACC33	rpgacc33;

#ifdef __RL78__
#else
	#define	RPGACC33	(rpgacc33.ALL)
#endif

/* RPGACC34L */
#ifdef __RL78__
#else
	#define	RPGACC34L	(rpgacc34.BYTE.rpgacc34l)
#endif

/* RPGACC34H */
#ifdef __RL78__
#else
	#define	RPGACC34H	(rpgacc34.BYTE.rpgacc34h)
#endif

/* RPGACC34 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc34l;
	SFR_UNSIGNED_SHORT_INT	rpgacc34h;
}SFR_BYTE_RPGACC34;

typedef union{
	SFR_BYTE_RPGACC34	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC34;

SFR_GLOBAL	SFR_RPGACC34	rpgacc34;

#ifdef __RL78__
#else
	#define	RPGACC34	(rpgacc34.ALL)
#endif

/* RPGACC35L */
#ifdef __RL78__
#else
	#define	RPGACC35L	(rpgacc35.BYTE.rpgacc35l)
#endif

/* RPGACC35H */
#ifdef __RL78__
#else
	#define	RPGACC35H	(rpgacc35.BYTE.rpgacc35h)
#endif

/* RPGACC35 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc35l;
	SFR_UNSIGNED_SHORT_INT	rpgacc35h;
}SFR_BYTE_RPGACC35;

typedef union{
	SFR_BYTE_RPGACC35	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC35;

SFR_GLOBAL	SFR_RPGACC35	rpgacc35;

#ifdef __RL78__
#else
	#define	RPGACC35	(rpgacc35.ALL)
#endif

/* RPGACC36L */
#ifdef __RL78__
#else
	#define	RPGACC36L	(rpgacc36.BYTE.rpgacc36l)
#endif

/* RPGACC36H */
#ifdef __RL78__
#else
	#define	RPGACC36H	(rpgacc36.BYTE.rpgacc36h)
#endif

/* RPGACC36 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc36l;
	SFR_UNSIGNED_SHORT_INT	rpgacc36h;
}SFR_BYTE_RPGACC36;

typedef union{
	SFR_BYTE_RPGACC36	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC36;

SFR_GLOBAL	SFR_RPGACC36	rpgacc36;

#ifdef __RL78__
#else
	#define	RPGACC36	(rpgacc36.ALL)
#endif

/* RPGACC37L */
#ifdef __RL78__
#else
	#define	RPGACC37L	(rpgacc37.BYTE.rpgacc37l)
#endif

