turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC37H */
#ifdef __RL78__
#else
	#define	RPGACC37H	(rpgacc37.BYTE.rpgacc37h)
#endif

/* RPGACC37 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc37l;
	SFR_UNSIGNED_SHORT_INT	rpgacc37h;
}SFR_BYTE_RPGACC37;

typedef union{
	SFR_BYTE_RPGACC37	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC37;

SFR_GLOBAL	SFR_RPGACC37	rpgacc37;

#ifdef __RL78__
#else
	#define	RPGACC37	(rpgacc37.ALL)
#endif

/* RPGACC38L */
#ifdef __RL78__
#else
	#define	RPGACC38L	(rpgacc38.BYTE.rpgacc38l)
#endif

/* RPGACC38H */
#ifdef __RL78__
#else
	#define	RPGACC38H	(rpgacc38.BYTE.rpgacc38h)
#endif

/* RPGACC38 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc38l;
	SFR_UNSIGNED_SHORT_INT	rpgacc38h;
}SFR_BYTE_RPGACC38;

typedef union{
	SFR_BYTE_RPGACC38	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC38;

SFR_GLOBAL	SFR_RPGACC38	rpgacc38;

#ifdef __RL78__
#else
	#define	RPGACC38	(rpgacc38.ALL)
#endif

/* RPGACC39L */
#ifdef __RL78__
#else
	#define	RPGACC39L	(rpgacc39.BYTE.rpgacc39l)
#endif

/* RPGACC39H */
#ifdef __RL78__
#else
	#define	RPGACC39H	(rpgacc39.BYTE.rpgacc39h)
#endif

/* RPGACC39 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc39l;
	SFR_UNSIGNED_SHORT_INT	rpgacc39h;
}SFR_BYTE_RPGACC39;

typedef union{
	SFR_BYTE_RPGACC39	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC39;

SFR_GLOBAL	SFR_RPGACC39	rpgacc39;

#ifdef __RL78__
#else
	#define	RPGACC39	(rpgacc39.ALL)
#endif

/* RPGACC40L */
#ifdef __RL78__
#else
	#define	RPGACC40L	(rpgacc40.BYTE.rpgacc40l)
#endif

/* RPGACC40H */
#ifdef __RL78__
#else
	#define	RPGACC40H	(rpgacc40.BYTE.rpgacc40h)
#endif

/* RPGACC40 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc40l;
	SFR_UNSIGNED_SHORT_INT	rpgacc40h;
}SFR_BYTE_RPGACC40;

typedef union{
	SFR_BYTE_RPGACC40	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC40;

SFR_GLOBAL	SFR_RPGACC40	rpgacc40;

#ifdef __RL78__
#else
	#define	RPGACC40	(rpgacc40.ALL)
#endif

/* RPGACC41L */
#ifdef __RL78__
#else
	#define	RPGACC41L	(rpgacc41.BYTE.rpgacc41l)
#endif

/* RPGACC41H */
#ifdef __RL78__
#else
	#define	RPGACC41H	(rpgacc41.BYTE.rpgacc41h)
#endif

/* RPGACC41 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc41l;
	SFR_UNSIGNED_SHORT_INT	rpgacc41h;
}SFR_BYTE_RPGACC41;

typedef union{
	SFR_BYTE_RPGACC41	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC41;

SFR_GLOBAL	SFR_RPGACC41	rpgacc41;

#ifdef __RL78__
#else
	#define	RPGACC41	(rpgacc41.ALL)
#endif

/* RPGACC42L */
#ifdef __RL78__
#else
	#define	RPGACC42L	(rpgacc42.BYTE.rpgacc42l)
#endif

/* RPGACC42H */
#ifdef __RL78__
#else
	#define	RPGACC42H	(rpgacc42.BYTE.rpgacc42h)
#endif

/* RPGACC42 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc42l;
	SFR_UNSIGNED_SHORT_INT	rpgacc42h;
}SFR_BYTE_RPGACC42;

typedef union{
	SFR_BYTE_RPGACC42	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC42;

SFR_GLOBAL	SFR_RPGACC42	rpgacc42;

#ifdef __RL78__
#else
	#define	RPGACC42	(rpgacc42.ALL)
#endif

/* RPGACC43L */
#ifdef __RL78__
#else
	#define	RPGACC43L	(rpgacc43.BYTE.rpgacc43l)
#endif

/* RPGACC43H */
#ifdef __RL78__
#else
	#define	RPGACC43H	(rpgacc43.BYTE.rpgacc43h)
#endif

/* RPGACC43 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc43l;
	SFR_UNSIGNED_SHORT_INT	rpgacc43h;
}SFR_BYTE_RPGACC43;

typedef union{
	SFR_BYTE_RPGACC43	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC43;

SFR_GLOBAL	SFR_RPGACC43	rpgacc43;

#ifdef __RL78__
#else
	#define	RPGACC43	(rpgacc43.ALL)
#endif

/* RPGACC44L */
#ifdef __RL78__
#else
	#define	RPGACC44L	(rpgacc44.BYTE.rpgacc44l)
#endif

/* RPGACC44H */
#ifdef __RL78__
#else
	#define	RPGACC44H	(rpgacc44.BYTE.rpgacc44h)
#endif

/* RPGACC44 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc44l;
	SFR_UNSIGNED_SHORT_INT	rpgacc44h;
}SFR_BYTE_RPGACC44;

typedef union{
	SFR_BYTE_RPGACC44	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC44;

SFR_GLOBAL	SFR_RPGACC44	rpgacc44;

#ifdef __RL78__
#else
	#define	RPGACC44	(rpgacc44.ALL)
#endif

/* RPGACC45L */
#ifdef __RL78__
#else
	#define	RPGACC45L	(rpgacc45.BYTE.rpgacc45l)
#endif

/* RPGACC45H */
#ifdef __RL78__
#else
	#define	RPGACC45H	(rpgacc45.BYTE.rpgacc45h)
#endif

/* RPGACC45 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc45l;
	SFR_UNSIGNED_SHORT_INT	rpgacc45h;
}SFR_BYTE_RPGACC45;

typedef union{
	SFR_BYTE_RPGACC45	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC45;

SFR_GLOBAL	SFR_RPGACC45	rpgacc45;

#ifdef __RL78__
#else
	#define	RPGACC45	(rpgacc45.ALL)
#endif

/* RPGACC46L */
#ifdef __RL78__
#else
	#define	RPGACC46L	(rpgacc46.BYTE.rpgacc46l)
#endif

/* RPGACC46H */
#ifdef __RL78__
#else
	#define	RPGACC46H	(rpgacc46.BYTE.rpgacc46h)
#endif

/* RPGACC46 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc46l;
	SFR_UNSIGNED_SHORT_INT	rpgacc46h;
}SFR_BYTE_RPGACC46;

typedef union{
	SFR_BYTE_RPGACC46	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC46;

SFR_GLOBAL	SFR_RPGACC46	rpgacc46;

#ifdef __RL78__
#else
	#define	RPGACC46	(rpgacc46.ALL)
#endif

/* RPGACC47L */
#ifdef __RL78__
#else
	#define	RPGACC47L	(rpgacc47.BYTE.rpgacc47l)
#endif

/* RPGACC47H */
#ifdef __RL78__
#else
	#define	RPGACC47H	(rpgacc47.BYTE.rpgacc47h)
#endif

/* RPGACC47 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc47l;
	SFR_UNSIGNED_SHORT_INT	rpgacc47h;
}SFR_BYTE_RPGACC47;

typedef union{
	SFR_BYTE_RPGACC47	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC47;

SFR_GLOBAL	SFR_RPGACC47	rpgacc47;

#ifdef __RL78__
#else
	#define	RPGACC47	(rpgacc47.ALL)
#endif

/* RPGACC48L */
#ifdef __RL78__
#else
	#define	RPGACC48L	(rpgacc48.BYTE.rpgacc48l)
#endif

/* RPGACC48H */
#ifdef __RL78__
#else
	#define	RPGACC48H	(rpgacc48.BYTE.rpgacc48h)
#endif

/* RPGACC48 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc48l;
	SFR_UNSIGNED_SHORT_INT	rpgacc48h;
}SFR_BYTE_RPGACC48;

typedef union{
	SFR_BYTE_RPGACC48	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC48;

SFR_GLOBAL	SFR_RPGACC48	rpgacc48;

#ifdef __RL78__
#else
	#define	RPGACC48	(rpgacc48.ALL)
#endif

/* RPGACC49L */
#ifdef __RL78__
#else
	#define	RPGACC49L	(rpgacc49.BYTE.rpgacc49l)
#endif

/* RPGACC49H */
#ifdef __RL78__
#else
	#define	RPGACC49H	(rpgacc49.BYTE.rpgacc49h)
#endif

