turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC49 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc49l;
	SFR_UNSIGNED_SHORT_INT	rpgacc49h;
}SFR_BYTE_RPGACC49;

typedef union{
	SFR_BYTE_RPGACC49	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC49;

SFR_GLOBAL	SFR_RPGACC49	rpgacc49;

#ifdef __RL78__
#else
	#define	RPGACC49	(rpgacc49.ALL)
#endif

/* RPGACC50L */
#ifdef __RL78__
#else
	#define	RPGACC50L	(rpgacc50.BYTE.rpgacc50l)
#endif

/* RPGACC50H */
#ifdef __RL78__
#else
	#define	RPGACC50H	(rpgacc50.BYTE.rpgacc50h)
#endif

/* RPGACC50 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc50l;
	SFR_UNSIGNED_SHORT_INT	rpgacc50h;
}SFR_BYTE_RPGACC50;

typedef union{
	SFR_BYTE_RPGACC50	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC50;

SFR_GLOBAL	SFR_RPGACC50	rpgacc50;

#ifdef __RL78__
#else
	#define	RPGACC50	(rpgacc50.ALL)
#endif

/* RPGACC51L */
#ifdef __RL78__
#else
	#define	RPGACC51L	(rpgacc51.BYTE.rpgacc51l)
#endif

/* RPGACC51H */
#ifdef __RL78__
#else
	#define	RPGACC51H	(rpgacc51.BYTE.rpgacc51h)
#endif

/* RPGACC51 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc51l;
	SFR_UNSIGNED_SHORT_INT	rpgacc51h;
}SFR_BYTE_RPGACC51;

typedef union{
	SFR_BYTE_RPGACC51	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC51;

SFR_GLOBAL	SFR_RPGACC51	rpgacc51;

#ifdef __RL78__
#else
	#define	RPGACC51	(rpgacc51.ALL)
#endif

/* RPGACC52L */
#ifdef __RL78__
#else
	#define	RPGACC52L	(rpgacc52.BYTE.rpgacc52l)
#endif

/* RPGACC52H */
#ifdef __RL78__
#else
	#define	RPGACC52H	(rpgacc52.BYTE.rpgacc52h)
#endif

/* RPGACC52 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc52l;
	SFR_UNSIGNED_SHORT_INT	rpgacc52h;
}SFR_BYTE_RPGACC52;

typedef union{
	SFR_BYTE_RPGACC52	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC52;

SFR_GLOBAL	SFR_RPGACC52	rpgacc52;

#ifdef __RL78__
#else
	#define	RPGACC52	(rpgacc52.ALL)
#endif

/* RPGACC53L */
#ifdef __RL78__
#else
	#define	RPGACC53L	(rpgacc53.BYTE.rpgacc53l)
#endif

/* RPGACC53H */
#ifdef __RL78__
#else
	#define	RPGACC53H	(rpgacc53.BYTE.rpgacc53h)
#endif

/* RPGACC53 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc53l;
	SFR_UNSIGNED_SHORT_INT	rpgacc53h;
}SFR_BYTE_RPGACC53;

typedef union{
	SFR_BYTE_RPGACC53	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC53;

SFR_GLOBAL	SFR_RPGACC53	rpgacc53;

#ifdef __RL78__
#else
	#define	RPGACC53	(rpgacc53.ALL)
#endif

/* RPGACC54L */
#ifdef __RL78__
#else
	#define	RPGACC54L	(rpgacc54.BYTE.rpgacc54l)
#endif

/* RPGACC54H */
#ifdef __RL78__
#else
	#define	RPGACC54H	(rpgacc54.BYTE.rpgacc54h)
#endif

/* RPGACC54 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc54l;
	SFR_UNSIGNED_SHORT_INT	rpgacc54h;
}SFR_BYTE_RPGACC54;

typedef union{
	SFR_BYTE_RPGACC54	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC54;

SFR_GLOBAL	SFR_RPGACC54	rpgacc54;

#ifdef __RL78__
#else
	#define	RPGACC54	(rpgacc54.ALL)
#endif

/* RPGACC55L */
#ifdef __RL78__
#else
	#define	RPGACC55L	(rpgacc55.BYTE.rpgacc55l)
#endif

/* RPGACC55H */
#ifdef __RL78__
#else
	#define	RPGACC55H	(rpgacc55.BYTE.rpgacc55h)
#endif

/* RPGACC55 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc55l;
	SFR_UNSIGNED_SHORT_INT	rpgacc55h;
}SFR_BYTE_RPGACC55;

typedef union{
	SFR_BYTE_RPGACC55	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC55;

SFR_GLOBAL	SFR_RPGACC55	rpgacc55;

#ifdef __RL78__
#else
	#define	RPGACC55	(rpgacc55.ALL)
#endif

/* RPGACC56L */
#ifdef __RL78__
#else
	#define	RPGACC56L	(rpgacc56.BYTE.rpgacc56l)
#endif

/* RPGACC56H */
#ifdef __RL78__
#else
	#define	RPGACC56H	(rpgacc56.BYTE.rpgacc56h)
#endif

/* RPGACC56 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc56l;
	SFR_UNSIGNED_SHORT_INT	rpgacc56h;
}SFR_BYTE_RPGACC56;

typedef union{
	SFR_BYTE_RPGACC56	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC56;

SFR_GLOBAL	SFR_RPGACC56	rpgacc56;

#ifdef __RL78__
#else
	#define	RPGACC56	(rpgacc56.ALL)
#endif

/* RPGACC57L */
#ifdef __RL78__
#else
	#define	RPGACC57L	(rpgacc57.BYTE.rpgacc57l)
#endif

/* RPGACC57H */
#ifdef __RL78__
#else
	#define	RPGACC57H	(rpgacc57.BYTE.rpgacc57h)
#endif

/* RPGACC57 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc57l;
	SFR_UNSIGNED_SHORT_INT	rpgacc57h;
}SFR_BYTE_RPGACC57;

typedef union{
	SFR_BYTE_RPGACC57	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC57;

SFR_GLOBAL	SFR_RPGACC57	rpgacc57;

#ifdef __RL78__
#else
	#define	RPGACC57	(rpgacc57.ALL)
#endif

/* RPGACC58L */
#ifdef __RL78__
#else
	#define	RPGACC58L	(rpgacc58.BYTE.rpgacc58l)
#endif

/* RPGACC58H */
#ifdef __RL78__
#else
	#define	RPGACC58H	(rpgacc58.BYTE.rpgacc58h)
#endif

/* RPGACC58 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc58l;
	SFR_UNSIGNED_SHORT_INT	rpgacc58h;
}SFR_BYTE_RPGACC58;

typedef union{
	SFR_BYTE_RPGACC58	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC58;

SFR_GLOBAL	SFR_RPGACC58	rpgacc58;

#ifdef __RL78__
#else
	#define	RPGACC58	(rpgacc58.ALL)
#endif

/* RPGACC59L */
#ifdef __RL78__
#else
	#define	RPGACC59L	(rpgacc59.BYTE.rpgacc59l)
#endif

/* RPGACC59H */
#ifdef __RL78__
#else
	#define	RPGACC59H	(rpgacc59.BYTE.rpgacc59h)
#endif

/* RPGACC59 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc59l;
	SFR_UNSIGNED_SHORT_INT	rpgacc59h;
}SFR_BYTE_RPGACC59;

typedef union{
	SFR_BYTE_RPGACC59	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC59;

SFR_GLOBAL	SFR_RPGACC59	rpgacc59;

#ifdef __RL78__
#else
	#define	RPGACC59	(rpgacc59.ALL)
#endif

/* RPGACC60L */
#ifdef __RL78__
#else
	#define	RPGACC60L	(rpgacc60.BYTE.rpgacc60l)
#endif

/* RPGACC60H */
#ifdef __RL78__
#else
	#define	RPGACC60H	(rpgacc60.BYTE.rpgacc60h)
#endif

/* RPGACC60 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc60l;
	SFR_UNSIGNED_SHORT_INT	rpgacc60h;
}SFR_BYTE_RPGACC60;

typedef union{
	SFR_BYTE_RPGACC60	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC60;

SFR_GLOBAL	SFR_RPGACC60	rpgacc60;

#ifdef __RL78__
#else
	#define	RPGACC60	(rpgacc60.ALL)
#endif

