turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC61L */
#ifdef __RL78__
#else
	#define	RPGACC61L	(rpgacc61.BYTE.rpgacc61l)
#endif

/* RPGACC61H */
#ifdef __RL78__
#else
	#define	RPGACC61H	(rpgacc61.BYTE.rpgacc61h)
#endif

/* RPGACC61 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc61l;
	SFR_UNSIGNED_SHORT_INT	rpgacc61h;
}SFR_BYTE_RPGACC61;

typedef union{
	SFR_BYTE_RPGACC61	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC61;

SFR_GLOBAL	SFR_RPGACC61	rpgacc61;

#ifdef __RL78__
#else
	#define	RPGACC61	(rpgacc61.ALL)
#endif

/* RPGACC62L */
#ifdef __RL78__
#else
	#define	RPGACC62L	(rpgacc62.BYTE.rpgacc62l)
#endif

/* RPGACC62H */
#ifdef __RL78__
#else
	#define	RPGACC62H	(rpgacc62.BYTE.rpgacc62h)
#endif

/* RPGACC62 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc62l;
	SFR_UNSIGNED_SHORT_INT	rpgacc62h;
}SFR_BYTE_RPGACC62;

typedef union{
	SFR_BYTE_RPGACC62	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC62;

SFR_GLOBAL	SFR_RPGACC62	rpgacc62;

#ifdef __RL78__
#else
	#define	RPGACC62	(rpgacc62.ALL)
#endif

/* RPGACC63L */
#ifdef __RL78__
#else
	#define	RPGACC63L	(rpgacc63.BYTE.rpgacc63l)
#endif

/* RPGACC63H */
#ifdef __RL78__
#else
	#define	RPGACC63H	(rpgacc63.BYTE.rpgacc63h)
#endif

/* RPGACC63 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc63l;
	SFR_UNSIGNED_SHORT_INT	rpgacc63h;
}SFR_BYTE_RPGACC63;

typedef union{
	SFR_BYTE_RPGACC63	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC63;

SFR_GLOBAL	SFR_RPGACC63	rpgacc63;

#ifdef __RL78__
#else
	#define	RPGACC63	(rpgacc63.ALL)
#endif

/* RPGACC64L */
#ifdef __RL78__
#else
	#define	RPGACC64L	(rpgacc64.BYTE.rpgacc64l)
#endif

/* RPGACC64H */
#ifdef __RL78__
#else
	#define	RPGACC64H	(rpgacc64.BYTE.rpgacc64h)
#endif

/* RPGACC64 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc64l;
	SFR_UNSIGNED_SHORT_INT	rpgacc64h;
}SFR_BYTE_RPGACC64;

typedef union{
	SFR_BYTE_RPGACC64	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC64;

SFR_GLOBAL	SFR_RPGACC64	rpgacc64;

#ifdef __RL78__
#else
	#define	RPGACC64	(rpgacc64.ALL)
#endif

/* RPGACC65L */
#ifdef __RL78__
#else
	#define	RPGACC65L	(rpgacc65.BYTE.rpgacc65l)
#endif

/* RPGACC65H */
#ifdef __RL78__
#else
	#define	RPGACC65H	(rpgacc65.BYTE.rpgacc65h)
#endif

/* RPGACC65 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc65l;
	SFR_UNSIGNED_SHORT_INT	rpgacc65h;
}SFR_BYTE_RPGACC65;

typedef union{
	SFR_BYTE_RPGACC65	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC65;

SFR_GLOBAL	SFR_RPGACC65	rpgacc65;

#ifdef __RL78__
#else
	#define	RPGACC65	(rpgacc65.ALL)
#endif

/* RPGACC66L */
#ifdef __RL78__
#else
	#define	RPGACC66L	(rpgacc66.BYTE.rpgacc66l)
#endif

/* RPGACC66H */
#ifdef __RL78__
#else
	#define	RPGACC66H	(rpgacc66.BYTE.rpgacc66h)
#endif

/* RPGACC66 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc66l;
	SFR_UNSIGNED_SHORT_INT	rpgacc66h;
}SFR_BYTE_RPGACC66;

typedef union{
	SFR_BYTE_RPGACC66	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC66;

SFR_GLOBAL	SFR_RPGACC66	rpgacc66;

#ifdef __RL78__
#else
	#define	RPGACC66	(rpgacc66.ALL)
#endif

/* RPGACC67L */
#ifdef __RL78__
#else
	#define	RPGACC67L	(rpgacc67.BYTE.rpgacc67l)
#endif

/* RPGACC67H */
#ifdef __RL78__
#else
	#define	RPGACC67H	(rpgacc67.BYTE.rpgacc67h)
#endif

/* RPGACC67 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc67l;
	SFR_UNSIGNED_SHORT_INT	rpgacc67h;
}SFR_BYTE_RPGACC67;

typedef union{
	SFR_BYTE_RPGACC67	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC67;

SFR_GLOBAL	SFR_RPGACC67	rpgacc67;

#ifdef __RL78__
#else
	#define	RPGACC67	(rpgacc67.ALL)
#endif

/* RPGACC68L */
#ifdef __RL78__
#else
	#define	RPGACC68L	(rpgacc68.BYTE.rpgacc68l)
#endif

/* RPGACC68H */
#ifdef __RL78__
#else
	#define	RPGACC68H	(rpgacc68.BYTE.rpgacc68h)
#endif

/* RPGACC68 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc68l;
	SFR_UNSIGNED_SHORT_INT	rpgacc68h;
}SFR_BYTE_RPGACC68;

typedef union{
	SFR_BYTE_RPGACC68	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC68;

SFR_GLOBAL	SFR_RPGACC68	rpgacc68;

#ifdef __RL78__
#else
	#define	RPGACC68	(rpgacc68.ALL)
#endif

/* RPGACC69L */
#ifdef __RL78__
#else
	#define	RPGACC69L	(rpgacc69.BYTE.rpgacc69l)
#endif

/* RPGACC69H */
#ifdef __RL78__
#else
	#define	RPGACC69H	(rpgacc69.BYTE.rpgacc69h)
#endif

/* RPGACC69 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc69l;
	SFR_UNSIGNED_SHORT_INT	rpgacc69h;
}SFR_BYTE_RPGACC69;

typedef union{
	SFR_BYTE_RPGACC69	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC69;

SFR_GLOBAL	SFR_RPGACC69	rpgacc69;

#ifdef __RL78__
#else
	#define	RPGACC69	(rpgacc69.ALL)
#endif

/* RPGACC70L */
#ifdef __RL78__
#else
	#define	RPGACC70L	(rpgacc70.BYTE.rpgacc70l)
#endif

/* RPGACC70H */
#ifdef __RL78__
#else
	#define	RPGACC70H	(rpgacc70.BYTE.rpgacc70h)
#endif

/* RPGACC70 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc70l;
	SFR_UNSIGNED_SHORT_INT	rpgacc70h;
}SFR_BYTE_RPGACC70;

typedef union{
	SFR_BYTE_RPGACC70	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC70;

SFR_GLOBAL	SFR_RPGACC70	rpgacc70;

#ifdef __RL78__
#else
	#define	RPGACC70	(rpgacc70.ALL)
#endif

/* RPGACC71L */
#ifdef __RL78__
#else
	#define	RPGACC71L	(rpgacc71.BYTE.rpgacc71l)
#endif

/* RPGACC71H */
#ifdef __RL78__
#else
	#define	RPGACC71H	(rpgacc71.BYTE.rpgacc71h)
#endif

/* RPGACC71 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc71l;
	SFR_UNSIGNED_SHORT_INT	rpgacc71h;
}SFR_BYTE_RPGACC71;

typedef union{
	SFR_BYTE_RPGACC71	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC71;

SFR_GLOBAL	SFR_RPGACC71	rpgacc71;

#ifdef __RL78__
#else
	#define	RPGACC71	(rpgacc71.ALL)
#endif

/* RPGACC72L */
#ifdef __RL78__
#else
	#define	RPGACC72L	(rpgacc72.BYTE.rpgacc72l)
#endif

/* RPGACC72H */
#ifdef __RL78__
#else
	#define	RPGACC72H	(rpgacc72.BYTE.rpgacc72h)
#endif

/* RPGACC72 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc72l;
	SFR_UNSIGNED_SHORT_INT	rpgacc72h;
}SFR_BYTE_RPGACC72;

typedef union{
	SFR_BYTE_RPGACC72	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC72;

SFR_GLOBAL	SFR_RPGACC72	rpgacc72;

#ifdef __RL78__
#else
	#define	RPGACC72	(rpgacc72.ALL)
#endif

/* RPGACC73L */
#ifdef __RL78__
#else
	#define	RPGACC73L	(rpgacc73.BYTE.rpgacc73l)
#endif

/* RPGACC73H */
#ifdef __RL78__
#else
	#define	RPGACC73H	(rpgacc73.BYTE.rpgacc73h)
#endif

