turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC73 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc73l;
	SFR_UNSIGNED_SHORT_INT	rpgacc73h;
}SFR_BYTE_RPGACC73;

typedef union{
	SFR_BYTE_RPGACC73	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC73;

SFR_GLOBAL	SFR_RPGACC73	rpgacc73;

#ifdef __RL78__
#else
	#define	RPGACC73	(rpgacc73.ALL)
#endif

/* RPGACC74L */
#ifdef __RL78__
#else
	#define	RPGACC74L	(rpgacc74.BYTE.rpgacc74l)
#endif

/* RPGACC74H */
#ifdef __RL78__
#else
	#define	RPGACC74H	(rpgacc74.BYTE.rpgacc74h)
#endif

/* RPGACC74 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc74l;
	SFR_UNSIGNED_SHORT_INT	rpgacc74h;
}SFR_BYTE_RPGACC74;

typedef union{
	SFR_BYTE_RPGACC74	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC74;

SFR_GLOBAL	SFR_RPGACC74	rpgacc74;

#ifdef __RL78__
#else
	#define	RPGACC74	(rpgacc74.ALL)
#endif

/* RPGACC75L */
#ifdef __RL78__
#else
	#define	RPGACC75L	(rpgacc75.BYTE.rpgacc75l)
#endif

/* RPGACC75H */
#ifdef __RL78__
#else
	#define	RPGACC75H	(rpgacc75.BYTE.rpgacc75h)
#endif

/* RPGACC75 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc75l;
	SFR_UNSIGNED_SHORT_INT	rpgacc75h;
}SFR_BYTE_RPGACC75;

typedef union{
	SFR_BYTE_RPGACC75	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC75;

SFR_GLOBAL	SFR_RPGACC75	rpgacc75;

#ifdef __RL78__
#else
	#define	RPGACC75	(rpgacc75.ALL)
#endif

/* RPGACC76L */
#ifdef __RL78__
#else
	#define	RPGACC76L	(rpgacc76.BYTE.rpgacc76l)
#endif

/* RPGACC76H */
#ifdef __RL78__
#else
	#define	RPGACC76H	(rpgacc76.BYTE.rpgacc76h)
#endif

/* RPGACC76 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc76l;
	SFR_UNSIGNED_SHORT_INT	rpgacc76h;
}SFR_BYTE_RPGACC76;

typedef union{
	SFR_BYTE_RPGACC76	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC76;

SFR_GLOBAL	SFR_RPGACC76	rpgacc76;

#ifdef __RL78__
#else
	#define	RPGACC76	(rpgacc76.ALL)
#endif

/* RPGACC77L */
#ifdef __RL78__
#else
	#define	RPGACC77L	(rpgacc77.BYTE.rpgacc77l)
#endif

/* RPGACC77H */
#ifdef __RL78__
#else
	#define	RPGACC77H	(rpgacc77.BYTE.rpgacc77h)
#endif

/* RPGACC77 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc77l;
	SFR_UNSIGNED_SHORT_INT	rpgacc77h;
}SFR_BYTE_RPGACC77;

typedef union{
	SFR_BYTE_RPGACC77	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC77;

SFR_GLOBAL	SFR_RPGACC77	rpgacc77;

#ifdef __RL78__
#else
	#define	RPGACC77	(rpgacc77.ALL)
#endif

/* RPGACC78L */
#ifdef __RL78__
#else
	#define	RPGACC78L	(rpgacc78.BYTE.rpgacc78l)
#endif

/* RPGACC78H */
#ifdef __RL78__
#else
	#define	RPGACC78H	(rpgacc78.BYTE.rpgacc78h)
#endif

/* RPGACC78 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc78l;
	SFR_UNSIGNED_SHORT_INT	rpgacc78h;
}SFR_BYTE_RPGACC78;

typedef union{
	SFR_BYTE_RPGACC78	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC78;

SFR_GLOBAL	SFR_RPGACC78	rpgacc78;

#ifdef __RL78__
#else
	#define	RPGACC78	(rpgacc78.ALL)
#endif

/* RPGACC79L */
#ifdef __RL78__
#else
	#define	RPGACC79L	(rpgacc79.BYTE.rpgacc79l)
#endif

/* RPGACC79H */
#ifdef __RL78__
#else
	#define	RPGACC79H	(rpgacc79.BYTE.rpgacc79h)
#endif

/* RPGACC79 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc79l;
	SFR_UNSIGNED_SHORT_INT	rpgacc79h;
}SFR_BYTE_RPGACC79;

typedef union{
	SFR_BYTE_RPGACC79	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC79;

SFR_GLOBAL	SFR_RPGACC79	rpgacc79;

#ifdef __RL78__
#else
	#define	RPGACC79	(rpgacc79.ALL)
#endif

/* RPGACC80L */
#ifdef __RL78__
#else
	#define	RPGACC80L	(rpgacc80.BYTE.rpgacc80l)
#endif

/* RPGACC80H */
#ifdef __RL78__
#else
	#define	RPGACC80H	(rpgacc80.BYTE.rpgacc80h)
#endif

/* RPGACC80 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc80l;
	SFR_UNSIGNED_SHORT_INT	rpgacc80h;
}SFR_BYTE_RPGACC80;

typedef union{
	SFR_BYTE_RPGACC80	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC80;

SFR_GLOBAL	SFR_RPGACC80	rpgacc80;

#ifdef __RL78__
#else
	#define	RPGACC80	(rpgacc80.ALL)
#endif

/* RPGACC81L */
#ifdef __RL78__
#else
	#define	RPGACC81L	(rpgacc81.BYTE.rpgacc81l)
#endif

/* RPGACC81H */
#ifdef __RL78__
#else
	#define	RPGACC81H	(rpgacc81.BYTE.rpgacc81h)
#endif

/* RPGACC81 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc81l;
	SFR_UNSIGNED_SHORT_INT	rpgacc81h;
}SFR_BYTE_RPGACC81;

typedef union{
	SFR_BYTE_RPGACC81	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC81;

SFR_GLOBAL	SFR_RPGACC81	rpgacc81;

#ifdef __RL78__
#else
	#define	RPGACC81	(rpgacc81.ALL)
#endif

/* RPGACC82L */
#ifdef __RL78__
#else
	#define	RPGACC82L	(rpgacc82.BYTE.rpgacc82l)
#endif

/* RPGACC82H */
#ifdef __RL78__
#else
	#define	RPGACC82H	(rpgacc82.BYTE.rpgacc82h)
#endif

/* RPGACC82 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc82l;
	SFR_UNSIGNED_SHORT_INT	rpgacc82h;
}SFR_BYTE_RPGACC82;

typedef union{
	SFR_BYTE_RPGACC82	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC82;

SFR_GLOBAL	SFR_RPGACC82	rpgacc82;

#ifdef __RL78__
#else
	#define	RPGACC82	(rpgacc82.ALL)
#endif

/* RPGACC83L */
#ifdef __RL78__
#else
	#define	RPGACC83L	(rpgacc83.BYTE.rpgacc83l)
#endif

/* RPGACC83H */
#ifdef __RL78__
#else
	#define	RPGACC83H	(rpgacc83.BYTE.rpgacc83h)
#endif

/* RPGACC83 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc83l;
	SFR_UNSIGNED_SHORT_INT	rpgacc83h;
}SFR_BYTE_RPGACC83;

typedef union{
	SFR_BYTE_RPGACC83	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC83;

SFR_GLOBAL	SFR_RPGACC83	rpgacc83;

#ifdef __RL78__
#else
	#define	RPGACC83	(rpgacc83.ALL)
#endif

/* RPGACC84L */
#ifdef __RL78__
#else
	#define	RPGACC84L	(rpgacc84.BYTE.rpgacc84l)
#endif

/* RPGACC84H */
#ifdef __RL78__
#else
	#define	RPGACC84H	(rpgacc84.BYTE.rpgacc84h)
#endif

/* RPGACC84 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc84l;
	SFR_UNSIGNED_SHORT_INT	rpgacc84h;
}SFR_BYTE_RPGACC84;

typedef union{
	SFR_BYTE_RPGACC84	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC84;

SFR_GLOBAL	SFR_RPGACC84	rpgacc84;

#ifdef __RL78__
#else
	#define	RPGACC84	(rpgacc84.ALL)
#endif

