turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC85L */
#ifdef __RL78__
#else
	#define	RPGACC85L	(rpgacc85.BYTE.rpgacc85l)
#endif

/* RPGACC85H */
#ifdef __RL78__
#else
	#define	RPGACC85H	(rpgacc85.BYTE.rpgacc85h)
#endif

/* RPGACC85 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc85l;
	SFR_UNSIGNED_SHORT_INT	rpgacc85h;
}SFR_BYTE_RPGACC85;

typedef union{
	SFR_BYTE_RPGACC85	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC85;

SFR_GLOBAL	SFR_RPGACC85	rpgacc85;

#ifdef __RL78__
#else
	#define	RPGACC85	(rpgacc85.ALL)
#endif

/* RPGACC86L */
#ifdef __RL78__
#else
	#define	RPGACC86L	(rpgacc86.BYTE.rpgacc86l)
#endif

/* RPGACC86H */
#ifdef __RL78__
#else
	#define	RPGACC86H	(rpgacc86.BYTE.rpgacc86h)
#endif

/* RPGACC86 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc86l;
	SFR_UNSIGNED_SHORT_INT	rpgacc86h;
}SFR_BYTE_RPGACC86;

typedef union{
	SFR_BYTE_RPGACC86	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC86;

SFR_GLOBAL	SFR_RPGACC86	rpgacc86;

#ifdef __RL78__
#else
	#define	RPGACC86	(rpgacc86.ALL)
#endif

/* RPGACC87L */
#ifdef __RL78__
#else
	#define	RPGACC87L	(rpgacc87.BYTE.rpgacc87l)
#endif

/* RPGACC87H */
#ifdef __RL78__
#else
	#define	RPGACC87H	(rpgacc87.BYTE.rpgacc87h)
#endif

/* RPGACC87 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc87l;
	SFR_UNSIGNED_SHORT_INT	rpgacc87h;
}SFR_BYTE_RPGACC87;

typedef union{
	SFR_BYTE_RPGACC87	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC87;

SFR_GLOBAL	SFR_RPGACC87	rpgacc87;

#ifdef __RL78__
#else
	#define	RPGACC87	(rpgacc87.ALL)
#endif

/* RPGACC88L */
#ifdef __RL78__
#else
	#define	RPGACC88L	(rpgacc88.BYTE.rpgacc88l)
#endif

/* RPGACC88H */
#ifdef __RL78__
#else
	#define	RPGACC88H	(rpgacc88.BYTE.rpgacc88h)
#endif

/* RPGACC88 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc88l;
	SFR_UNSIGNED_SHORT_INT	rpgacc88h;
}SFR_BYTE_RPGACC88;

typedef union{
	SFR_BYTE_RPGACC88	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC88;

SFR_GLOBAL	SFR_RPGACC88	rpgacc88;

#ifdef __RL78__
#else
	#define	RPGACC88	(rpgacc88.ALL)
#endif

/* RPGACC89L */
#ifdef __RL78__
#else
	#define	RPGACC89L	(rpgacc89.BYTE.rpgacc89l)
#endif

/* RPGACC89H */
#ifdef __RL78__
#else
	#define	RPGACC89H	(rpgacc89.BYTE.rpgacc89h)
#endif

/* RPGACC89 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc89l;
	SFR_UNSIGNED_SHORT_INT	rpgacc89h;
}SFR_BYTE_RPGACC89;

typedef union{
	SFR_BYTE_RPGACC89	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC89;

SFR_GLOBAL	SFR_RPGACC89	rpgacc89;

#ifdef __RL78__
#else
	#define	RPGACC89	(rpgacc89.ALL)
#endif

/* RPGACC90L */
#ifdef __RL78__
#else
	#define	RPGACC90L	(rpgacc90.BYTE.rpgacc90l)
#endif

/* RPGACC90H */
#ifdef __RL78__
#else
	#define	RPGACC90H	(rpgacc90.BYTE.rpgacc90h)
#endif

/* RPGACC90 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc90l;
	SFR_UNSIGNED_SHORT_INT	rpgacc90h;
}SFR_BYTE_RPGACC90;

typedef union{
	SFR_BYTE_RPGACC90	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC90;

SFR_GLOBAL	SFR_RPGACC90	rpgacc90;

#ifdef __RL78__
#else
	#define	RPGACC90	(rpgacc90.ALL)
#endif

/* RPGACC91L */
#ifdef __RL78__
#else
	#define	RPGACC91L	(rpgacc91.BYTE.rpgacc91l)
#endif

/* RPGACC91H */
#ifdef __RL78__
#else
	#define	RPGACC91H	(rpgacc91.BYTE.rpgacc91h)
#endif

/* RPGACC91 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc91l;
	SFR_UNSIGNED_SHORT_INT	rpgacc91h;
}SFR_BYTE_RPGACC91;

typedef union{
	SFR_BYTE_RPGACC91	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC91;

SFR_GLOBAL	SFR_RPGACC91	rpgacc91;

#ifdef __RL78__
#else
	#define	RPGACC91	(rpgacc91.ALL)
#endif

/* RPGACC92L */
#ifdef __RL78__
#else
	#define	RPGACC92L	(rpgacc92.BYTE.rpgacc92l)
#endif

/* RPGACC92H */
#ifdef __RL78__
#else
	#define	RPGACC92H	(rpgacc92.BYTE.rpgacc92h)
#endif

/* RPGACC92 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc92l;
	SFR_UNSIGNED_SHORT_INT	rpgacc92h;
}SFR_BYTE_RPGACC92;

typedef union{
	SFR_BYTE_RPGACC92	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC92;

SFR_GLOBAL	SFR_RPGACC92	rpgacc92;

#ifdef __RL78__
#else
	#define	RPGACC92	(rpgacc92.ALL)
#endif

/* RPGACC93L */
#ifdef __RL78__
#else
	#define	RPGACC93L	(rpgacc93.BYTE.rpgacc93l)
#endif

/* RPGACC93H */
#ifdef __RL78__
#else
	#define	RPGACC93H	(rpgacc93.BYTE.rpgacc93h)
#endif

/* RPGACC93 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc93l;
	SFR_UNSIGNED_SHORT_INT	rpgacc93h;
}SFR_BYTE_RPGACC93;

typedef union{
	SFR_BYTE_RPGACC93	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC93;

SFR_GLOBAL	SFR_RPGACC93	rpgacc93;

#ifdef __RL78__
#else
	#define	RPGACC93	(rpgacc93.ALL)
#endif

/* RPGACC94L */
#ifdef __RL78__
#else
	#define	RPGACC94L	(rpgacc94.BYTE.rpgacc94l)
#endif

/* RPGACC94H */
#ifdef __RL78__
#else
	#define	RPGACC94H	(rpgacc94.BYTE.rpgacc94h)
#endif

/* RPGACC94 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc94l;
	SFR_UNSIGNED_SHORT_INT	rpgacc94h;
}SFR_BYTE_RPGACC94;

typedef union{
	SFR_BYTE_RPGACC94	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC94;

SFR_GLOBAL	SFR_RPGACC94	rpgacc94;

#ifdef __RL78__
#else
	#define	RPGACC94	(rpgacc94.ALL)
#endif

/* RPGACC95L */
#ifdef __RL78__
#else
	#define	RPGACC95L	(rpgacc95.BYTE.rpgacc95l)
#endif

/* RPGACC95H */
#ifdef __RL78__
#else
	#define	RPGACC95H	(rpgacc95.BYTE.rpgacc95h)
#endif

/* RPGACC95 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc95l;
	SFR_UNSIGNED_SHORT_INT	rpgacc95h;
}SFR_BYTE_RPGACC95;

typedef union{
	SFR_BYTE_RPGACC95	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC95;

SFR_GLOBAL	SFR_RPGACC95	rpgacc95;

#ifdef __RL78__
#else
	#define	RPGACC95	(rpgacc95.ALL)
#endif

/* RPGACC96L */
#ifdef __RL78__
#else
	#define	RPGACC96L	(rpgacc96.BYTE.rpgacc96l)
#endif

/* RPGACC96H */
#ifdef __RL78__
#else
	#define	RPGACC96H	(rpgacc96.BYTE.rpgacc96h)
#endif

/* RPGACC96 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc96l;
	SFR_UNSIGNED_SHORT_INT	rpgacc96h;
}SFR_BYTE_RPGACC96;

typedef union{
	SFR_BYTE_RPGACC96	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC96;

SFR_GLOBAL	SFR_RPGACC96	rpgacc96;

#ifdef __RL78__
#else
	#define	RPGACC96	(rpgacc96.ALL)
#endif

/* RPGACC97L */
#ifdef __RL78__
#else
	#define	RPGACC97L	(rpgacc97.BYTE.rpgacc97l)
#endif

/* RPGACC97H */
#ifdef __RL78__
#else
	#define	RPGACC97H	(rpgacc97.BYTE.rpgacc97h)
#endif

/* RPGACC97 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc97l;
	SFR_UNSIGNED_SHORT_INT	rpgacc97h;
}SFR_BYTE_RPGACC97;

typedef union{
	SFR_BYTE_RPGACC97	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC97;

SFR_GLOBAL	SFR_RPGACC97	rpgacc97;

#ifdef __RL78__
#else
	#define	RPGACC97	(rpgacc97.ALL)
#endif

