turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC98L */
#ifdef __RL78__
#else
	#define	RPGACC98L	(rpgacc98.BYTE.rpgacc98l)
#endif

/* RPGACC98H */
#ifdef __RL78__
#else
	#define	RPGACC98H	(rpgacc98.BYTE.rpgacc98h)
#endif

/* RPGACC98 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc98l;
	SFR_UNSIGNED_SHORT_INT	rpgacc98h;
}SFR_BYTE_RPGACC98;

typedef union{
	SFR_BYTE_RPGACC98	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC98;

SFR_GLOBAL	SFR_RPGACC98	rpgacc98;

#ifdef __RL78__
#else
	#define	RPGACC98	(rpgacc98.ALL)
#endif

/* RPGACC99L */
#ifdef __RL78__
#else
	#define	RPGACC99L	(rpgacc99.BYTE.rpgacc99l)
#endif

/* RPGACC99H */
#ifdef __RL78__
#else
	#define	RPGACC99H	(rpgacc99.BYTE.rpgacc99h)
#endif

/* RPGACC99 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc99l;
	SFR_UNSIGNED_SHORT_INT	rpgacc99h;
}SFR_BYTE_RPGACC99;

typedef union{
	SFR_BYTE_RPGACC99	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC99;

SFR_GLOBAL	SFR_RPGACC99	rpgacc99;

#ifdef __RL78__
#else
	#define	RPGACC99	(rpgacc99.ALL)
#endif

/* RPGACC100L */
#ifdef __RL78__
#else
	#define	RPGACC100L	(rpgacc100.BYTE.rpgacc100l)
#endif

/* RPGACC100H */
#ifdef __RL78__
#else
	#define	RPGACC100H	(rpgacc100.BYTE.rpgacc100h)
#endif

/* RPGACC100 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc100l;
	SFR_UNSIGNED_SHORT_INT	rpgacc100h;
}SFR_BYTE_RPGACC100;

typedef union{
	SFR_BYTE_RPGACC100	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC100;

SFR_GLOBAL	SFR_RPGACC100	rpgacc100;

#ifdef __RL78__
#else
	#define	RPGACC100	(rpgacc100.ALL)
#endif

/* RPGACC101L */
#ifdef __RL78__
#else
	#define	RPGACC101L	(rpgacc101.BYTE.rpgacc101l)
#endif

/* RPGACC101H */
#ifdef __RL78__
#else
	#define	RPGACC101H	(rpgacc101.BYTE.rpgacc101h)
#endif

/* RPGACC101 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc101l;
	SFR_UNSIGNED_SHORT_INT	rpgacc101h;
}SFR_BYTE_RPGACC101;

typedef union{
	SFR_BYTE_RPGACC101	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC101;

SFR_GLOBAL	SFR_RPGACC101	rpgacc101;

#ifdef __RL78__
#else
	#define	RPGACC101	(rpgacc101.ALL)
#endif

/* RPGACC102L */
#ifdef __RL78__
#else
	#define	RPGACC102L	(rpgacc102.BYTE.rpgacc102l)
#endif

/* RPGACC102H */
#ifdef __RL78__
#else
	#define	RPGACC102H	(rpgacc102.BYTE.rpgacc102h)
#endif

/* RPGACC102 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc102l;
	SFR_UNSIGNED_SHORT_INT	rpgacc102h;
}SFR_BYTE_RPGACC102;

typedef union{
	SFR_BYTE_RPGACC102	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC102;

SFR_GLOBAL	SFR_RPGACC102	rpgacc102;

#ifdef __RL78__
#else
	#define	RPGACC102	(rpgacc102.ALL)
#endif

/* RPGACC103L */
#ifdef __RL78__
#else
	#define	RPGACC103L	(rpgacc103.BYTE.rpgacc103l)
#endif

/* RPGACC103H */
#ifdef __RL78__
#else
	#define	RPGACC103H	(rpgacc103.BYTE.rpgacc103h)
#endif

/* RPGACC103 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc103l;
	SFR_UNSIGNED_SHORT_INT	rpgacc103h;
}SFR_BYTE_RPGACC103;

typedef union{
	SFR_BYTE_RPGACC103	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC103;

SFR_GLOBAL	SFR_RPGACC103	rpgacc103;

#ifdef __RL78__
#else
	#define	RPGACC103	(rpgacc103.ALL)
#endif

/* RPGACC104L */
#ifdef __RL78__
#else
	#define	RPGACC104L	(rpgacc104.BYTE.rpgacc104l)
#endif

/* RPGACC104H */
#ifdef __RL78__
#else
	#define	RPGACC104H	(rpgacc104.BYTE.rpgacc104h)
#endif

/* RPGACC104 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc104l;
	SFR_UNSIGNED_SHORT_INT	rpgacc104h;
}SFR_BYTE_RPGACC104;

typedef union{
	SFR_BYTE_RPGACC104	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC104;

SFR_GLOBAL	SFR_RPGACC104	rpgacc104;

#ifdef __RL78__
#else
	#define	RPGACC104	(rpgacc104.ALL)
#endif

/* RPGACC105L */
#ifdef __RL78__
#else
	#define	RPGACC105L	(rpgacc105.BYTE.rpgacc105l)
#endif

/* RPGACC105H */
#ifdef __RL78__
#else
	#define	RPGACC105H	(rpgacc105.BYTE.rpgacc105h)
#endif

/* RPGACC105 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc105l;
	SFR_UNSIGNED_SHORT_INT	rpgacc105h;
}SFR_BYTE_RPGACC105;

typedef union{
	SFR_BYTE_RPGACC105	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC105;

SFR_GLOBAL	SFR_RPGACC105	rpgacc105;

#ifdef __RL78__
#else
	#define	RPGACC105	(rpgacc105.ALL)
#endif

/* RPGACC106L */
#ifdef __RL78__
#else
	#define	RPGACC106L	(rpgacc106.BYTE.rpgacc106l)
#endif

/* RPGACC106H */
#ifdef __RL78__
#else
	#define	RPGACC106H	(rpgacc106.BYTE.rpgacc106h)
#endif

/* RPGACC106 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc106l;
	SFR_UNSIGNED_SHORT_INT	rpgacc106h;
}SFR_BYTE_RPGACC106;

typedef union{
	SFR_BYTE_RPGACC106	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC106;

SFR_GLOBAL	SFR_RPGACC106	rpgacc106;

#ifdef __RL78__
#else
	#define	RPGACC106	(rpgacc106.ALL)
#endif

/* RPGACC107L */
#ifdef __RL78__
#else
	#define	RPGACC107L	(rpgacc107.BYTE.rpgacc107l)
#endif

/* RPGACC107H */
#ifdef __RL78__
#else
	#define	RPGACC107H	(rpgacc107.BYTE.rpgacc107h)
#endif

/* RPGACC107 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc107l;
	SFR_UNSIGNED_SHORT_INT	rpgacc107h;
}SFR_BYTE_RPGACC107;

typedef union{
	SFR_BYTE_RPGACC107	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC107;

SFR_GLOBAL	SFR_RPGACC107	rpgacc107;

#ifdef __RL78__
#else
	#define	RPGACC107	(rpgacc107.ALL)
#endif

/* RPGACC108L */
#ifdef __RL78__
#else
	#define	RPGACC108L	(rpgacc108.BYTE.rpgacc108l)
#endif

/* RPGACC108H */
#ifdef __RL78__
#else
	#define	RPGACC108H	(rpgacc108.BYTE.rpgacc108h)
#endif

/* RPGACC108 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc108l;
	SFR_UNSIGNED_SHORT_INT	rpgacc108h;
}SFR_BYTE_RPGACC108;

typedef union{
	SFR_BYTE_RPGACC108	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC108;

SFR_GLOBAL	SFR_RPGACC108	rpgacc108;

#ifdef __RL78__
#else
	#define	RPGACC108	(rpgacc108.ALL)
#endif

/* RPGACC109L */
#ifdef __RL78__
#else
	#define	RPGACC109L	(rpgacc109.BYTE.rpgacc109l)
#endif

/* RPGACC109H */
#ifdef __RL78__
#else
	#define	RPGACC109H	(rpgacc109.BYTE.rpgacc109h)
#endif

/* RPGACC109 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc109l;
	SFR_UNSIGNED_SHORT_INT	rpgacc109h;
}SFR_BYTE_RPGACC109;

typedef union{
	SFR_BYTE_RPGACC109	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC109;

SFR_GLOBAL	SFR_RPGACC109	rpgacc109;

#ifdef __RL78__
#else
	#define	RPGACC109	(rpgacc109.ALL)
#endif

/* RPGACC110L */
#ifdef __RL78__
#else
	#define	RPGACC110L	(rpgacc110.BYTE.rpgacc110l)
#endif

/* RPGACC110H */
#ifdef __RL78__
#else
	#define	RPGACC110H	(rpgacc110.BYTE.rpgacc110h)
#endif

