turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC110 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc110l;
	SFR_UNSIGNED_SHORT_INT	rpgacc110h;
}SFR_BYTE_RPGACC110;

typedef union{
	SFR_BYTE_RPGACC110	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC110;

SFR_GLOBAL	SFR_RPGACC110	rpgacc110;

#ifdef __RL78__
#else
	#define	RPGACC110	(rpgacc110.ALL)
#endif

/* RPGACC111L */
#ifdef __RL78__
#else
	#define	RPGACC111L	(rpgacc111.BYTE.rpgacc111l)
#endif

/* RPGACC111H */
#ifdef __RL78__
#else
	#define	RPGACC111H	(rpgacc111.BYTE.rpgacc111h)
#endif

/* RPGACC111 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc111l;
	SFR_UNSIGNED_SHORT_INT	rpgacc111h;
}SFR_BYTE_RPGACC111;

typedef union{
	SFR_BYTE_RPGACC111	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC111;

SFR_GLOBAL	SFR_RPGACC111	rpgacc111;

#ifdef __RL78__
#else
	#define	RPGACC111	(rpgacc111.ALL)
#endif

/* RPGACC112L */
#ifdef __RL78__
#else
	#define	RPGACC112L	(rpgacc112.BYTE.rpgacc112l)
#endif

/* RPGACC112H */
#ifdef __RL78__
#else
	#define	RPGACC112H	(rpgacc112.BYTE.rpgacc112h)
#endif

/* RPGACC112 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc112l;
	SFR_UNSIGNED_SHORT_INT	rpgacc112h;
}SFR_BYTE_RPGACC112;

typedef union{
	SFR_BYTE_RPGACC112	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC112;

SFR_GLOBAL	SFR_RPGACC112	rpgacc112;

#ifdef __RL78__
#else
	#define	RPGACC112	(rpgacc112.ALL)
#endif

/* RPGACC113L */
#ifdef __RL78__
#else
	#define	RPGACC113L	(rpgacc113.BYTE.rpgacc113l)
#endif

/* RPGACC113H */
#ifdef __RL78__
#else
	#define	RPGACC113H	(rpgacc113.BYTE.rpgacc113h)
#endif

/* RPGACC113 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc113l;
	SFR_UNSIGNED_SHORT_INT	rpgacc113h;
}SFR_BYTE_RPGACC113;

typedef union{
	SFR_BYTE_RPGACC113	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC113;

SFR_GLOBAL	SFR_RPGACC113	rpgacc113;

#ifdef __RL78__
#else
	#define	RPGACC113	(rpgacc113.ALL)
#endif

/* RPGACC114L */
#ifdef __RL78__
#else
	#define	RPGACC114L	(rpgacc114.BYTE.rpgacc114l)
#endif

/* RPGACC114H */
#ifdef __RL78__
#else
	#define	RPGACC114H	(rpgacc114.BYTE.rpgacc114h)
#endif

/* RPGACC114 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc114l;
	SFR_UNSIGNED_SHORT_INT	rpgacc114h;
}SFR_BYTE_RPGACC114;

typedef union{
	SFR_BYTE_RPGACC114	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC114;

SFR_GLOBAL	SFR_RPGACC114	rpgacc114;

#ifdef __RL78__
#else
	#define	RPGACC114	(rpgacc114.ALL)
#endif

/* RPGACC115L */
#ifdef __RL78__
#else
	#define	RPGACC115L	(rpgacc115.BYTE.rpgacc115l)
#endif

/* RPGACC115H */
#ifdef __RL78__
#else
	#define	RPGACC115H	(rpgacc115.BYTE.rpgacc115h)
#endif

/* RPGACC115 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc115l;
	SFR_UNSIGNED_SHORT_INT	rpgacc115h;
}SFR_BYTE_RPGACC115;

typedef union{
	SFR_BYTE_RPGACC115	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC115;

SFR_GLOBAL	SFR_RPGACC115	rpgacc115;

#ifdef __RL78__
#else
	#define	RPGACC115	(rpgacc115.ALL)
#endif

/* RPGACC116L */
#ifdef __RL78__
#else
	#define	RPGACC116L	(rpgacc116.BYTE.rpgacc116l)
#endif

/* RPGACC116H */
#ifdef __RL78__
#else
	#define	RPGACC116H	(rpgacc116.BYTE.rpgacc116h)
#endif

/* RPGACC116 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc116l;
	SFR_UNSIGNED_SHORT_INT	rpgacc116h;
}SFR_BYTE_RPGACC116;

typedef union{
	SFR_BYTE_RPGACC116	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC116;

SFR_GLOBAL	SFR_RPGACC116	rpgacc116;

#ifdef __RL78__
#else
	#define	RPGACC116	(rpgacc116.ALL)
#endif

/* RPGACC117L */
#ifdef __RL78__
#else
	#define	RPGACC117L	(rpgacc117.BYTE.rpgacc117l)
#endif

/* RPGACC117H */
#ifdef __RL78__
#else
	#define	RPGACC117H	(rpgacc117.BYTE.rpgacc117h)
#endif

/* RPGACC117 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc117l;
	SFR_UNSIGNED_SHORT_INT	rpgacc117h;
}SFR_BYTE_RPGACC117;

typedef union{
	SFR_BYTE_RPGACC117	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC117;

SFR_GLOBAL	SFR_RPGACC117	rpgacc117;

#ifdef __RL78__
#else
	#define	RPGACC117	(rpgacc117.ALL)
#endif

/* RPGACC118L */
#ifdef __RL78__
#else
	#define	RPGACC118L	(rpgacc118.BYTE.rpgacc118l)
#endif

/* RPGACC118H */
#ifdef __RL78__
#else
	#define	RPGACC118H	(rpgacc118.BYTE.rpgacc118h)
#endif

/* RPGACC118 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc118l;
	SFR_UNSIGNED_SHORT_INT	rpgacc118h;
}SFR_BYTE_RPGACC118;

typedef union{
	SFR_BYTE_RPGACC118	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC118;

SFR_GLOBAL	SFR_RPGACC118	rpgacc118;

#ifdef __RL78__
#else
	#define	RPGACC118	(rpgacc118.ALL)
#endif

/* RPGACC119L */
#ifdef __RL78__
#else
	#define	RPGACC119L	(rpgacc119.BYTE.rpgacc119l)
#endif

/* RPGACC119H */
#ifdef __RL78__
#else
	#define	RPGACC119H	(rpgacc119.BYTE.rpgacc119h)
#endif

/* RPGACC119 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc119l;
	SFR_UNSIGNED_SHORT_INT	rpgacc119h;
}SFR_BYTE_RPGACC119;

typedef union{
	SFR_BYTE_RPGACC119	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC119;

SFR_GLOBAL	SFR_RPGACC119	rpgacc119;

#ifdef __RL78__
#else
	#define	RPGACC119	(rpgacc119.ALL)
#endif

/* RPGACC120L */
#ifdef __RL78__
#else
	#define	RPGACC120L	(rpgacc120.BYTE.rpgacc120l)
#endif

/* RPGACC120H */
#ifdef __RL78__
#else
	#define	RPGACC120H	(rpgacc120.BYTE.rpgacc120h)
#endif

/* RPGACC120 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc120l;
	SFR_UNSIGNED_SHORT_INT	rpgacc120h;
}SFR_BYTE_RPGACC120;

typedef union{
	SFR_BYTE_RPGACC120	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC120;

SFR_GLOBAL	SFR_RPGACC120	rpgacc120;

#ifdef __RL78__
#else
	#define	RPGACC120	(rpgacc120.ALL)
#endif

/* RPGACC121L */
#ifdef __RL78__
#else
	#define	RPGACC121L	(rpgacc121.BYTE.rpgacc121l)
#endif

/* RPGACC121H */
#ifdef __RL78__
#else
	#define	RPGACC121H	(rpgacc121.BYTE.rpgacc121h)
#endif

/* RPGACC121 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc121l;
	SFR_UNSIGNED_SHORT_INT	rpgacc121h;
}SFR_BYTE_RPGACC121;

typedef union{
	SFR_BYTE_RPGACC121	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC121;

SFR_GLOBAL	SFR_RPGACC121	rpgacc121;

#ifdef __RL78__
#else
	#define	RPGACC121	(rpgacc121.ALL)
#endif

