turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RPGACC122L */
#ifdef __RL78__
#else
	#define	RPGACC122L	(rpgacc122.BYTE.rpgacc122l)
#endif

/* RPGACC122H */
#ifdef __RL78__
#else
	#define	RPGACC122H	(rpgacc122.BYTE.rpgacc122h)
#endif

/* RPGACC122 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc122l;
	SFR_UNSIGNED_SHORT_INT	rpgacc122h;
}SFR_BYTE_RPGACC122;

typedef union{
	SFR_BYTE_RPGACC122	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC122;

SFR_GLOBAL	SFR_RPGACC122	rpgacc122;

#ifdef __RL78__
#else
	#define	RPGACC122	(rpgacc122.ALL)
#endif

/* RPGACC123L */
#ifdef __RL78__
#else
	#define	RPGACC123L	(rpgacc123.BYTE.rpgacc123l)
#endif

/* RPGACC123H */
#ifdef __RL78__
#else
	#define	RPGACC123H	(rpgacc123.BYTE.rpgacc123h)
#endif

/* RPGACC123 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc123l;
	SFR_UNSIGNED_SHORT_INT	rpgacc123h;
}SFR_BYTE_RPGACC123;

typedef union{
	SFR_BYTE_RPGACC123	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC123;

SFR_GLOBAL	SFR_RPGACC123	rpgacc123;

#ifdef __RL78__
#else
	#define	RPGACC123	(rpgacc123.ALL)
#endif

/* RPGACC124L */
#ifdef __RL78__
#else
	#define	RPGACC124L	(rpgacc124.BYTE.rpgacc124l)
#endif

/* RPGACC124H */
#ifdef __RL78__
#else
	#define	RPGACC124H	(rpgacc124.BYTE.rpgacc124h)
#endif

/* RPGACC124 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc124l;
	SFR_UNSIGNED_SHORT_INT	rpgacc124h;
}SFR_BYTE_RPGACC124;

typedef union{
	SFR_BYTE_RPGACC124	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC124;

SFR_GLOBAL	SFR_RPGACC124	rpgacc124;

#ifdef __RL78__
#else
	#define	RPGACC124	(rpgacc124.ALL)
#endif

/* RPGACC125L */
#ifdef __RL78__
#else
	#define	RPGACC125L	(rpgacc125.BYTE.rpgacc125l)
#endif

/* RPGACC125H */
#ifdef __RL78__
#else
	#define	RPGACC125H	(rpgacc125.BYTE.rpgacc125h)
#endif

/* RPGACC125 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc125l;
	SFR_UNSIGNED_SHORT_INT	rpgacc125h;
}SFR_BYTE_RPGACC125;

typedef union{
	SFR_BYTE_RPGACC125	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC125;

SFR_GLOBAL	SFR_RPGACC125	rpgacc125;

#ifdef __RL78__
#else
	#define	RPGACC125	(rpgacc125.ALL)
#endif

/* RPGACC126L */
#ifdef __RL78__
#else
	#define	RPGACC126L	(rpgacc126.BYTE.rpgacc126l)
#endif

/* RPGACC126H */
#ifdef __RL78__
#else
	#define	RPGACC126H	(rpgacc126.BYTE.rpgacc126h)
#endif

/* RPGACC126 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc126l;
	SFR_UNSIGNED_SHORT_INT	rpgacc126h;
}SFR_BYTE_RPGACC126;

typedef union{
	SFR_BYTE_RPGACC126	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC126;

SFR_GLOBAL	SFR_RPGACC126	rpgacc126;

#ifdef __RL78__
#else
	#define	RPGACC126	(rpgacc126.ALL)
#endif

/* RPGACC127L */
#ifdef __RL78__
#else
	#define	RPGACC127L	(rpgacc127.BYTE.rpgacc127l)
#endif

/* RPGACC127H */
#ifdef __RL78__
#else
	#define	RPGACC127H	(rpgacc127.BYTE.rpgacc127h)
#endif

/* RPGACC127 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rpgacc127l;
	SFR_UNSIGNED_SHORT_INT	rpgacc127h;
}SFR_BYTE_RPGACC127;

typedef union{
	SFR_BYTE_RPGACC127	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RPGACC127;

SFR_GLOBAL	SFR_RPGACC127	rpgacc127;

#ifdef __RL78__
#else
	#define	RPGACC127	(rpgacc127.ALL)
#endif
/* CAN用RAMテスト・レジスタここまで */

/* CAN受信FIFOアクセス・レジスタここから */
/* RFIDL0L */
#ifdef __RL78__
#else
	#define	RFIDL0L	(rfidl0.BYTE.rfidl0l)
#endif

/* RFIDL0H */
#ifdef __RL78__
#else
	#define	RFIDL0H	(rfidl0.BYTE.rfidl0h)
#endif

/* RFIDL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfidl0l;
	SFR_UNSIGNED_SHORT_INT	rfidl0h;
}SFR_BYTE_RFIDL0;

typedef union{
	SFR_BYTE_RFIDL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFIDL0;

SFR_GLOBAL	SFR_RFIDL0	rfidl0;

#ifdef __RL78__
#else
	#define	RFIDL0	(rfidl0.ALL)
#endif

/* RFIDH0L */
#ifdef __RL78__
#else
	#define	RFIDH0L	(rfidh0.BYTE.rfidh0l)
#endif

/* RFIDH0H */
#ifdef __RL78__
#else
	#define	RFIDH0H	(rfidh0.BYTE.rfidh0h)
#endif

/* RFIDH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfidh0l;
	SFR_UNSIGNED_SHORT_INT	rfidh0h;
}SFR_BYTE_RFIDH0;

typedef union{
	SFR_BYTE_RFIDH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFIDH0;

SFR_GLOBAL	SFR_RFIDH0	rfidh0;

#ifdef __RL78__
#else
	#define	RFIDH0	(rfidh0.ALL)
#endif

/* RFTS0L */
#ifdef __RL78__
#else
	#define	RFTS0L	(rfts0.BYTE.rfts0l)
#endif

/* RFTS0H */
#ifdef __RL78__
#else
	#define	RFTS0H	(rfts0.BYTE.rfts0h)
#endif

/* RFTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfts0l;
	SFR_UNSIGNED_SHORT_INT	rfts0h;
}SFR_BYTE_RFTS0;

typedef union{
	SFR_BYTE_RFTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFTS0;

SFR_GLOBAL	SFR_RFTS0	rfts0;

#ifdef __RL78__
#else
	#define	RFTS0	(rfts0.ALL)
#endif

/* RFPTR0L */
#ifdef __RL78__
#else
	#define	RFPTR0L	(rfptr0.BYTE.rfptr0l)
#endif

/* RFPTR0H */
#ifdef __RL78__
#else
	#define	RFPTR0H	(rfptr0.BYTE.rfptr0h)
#endif

/* RFPTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfptr0l;
	SFR_UNSIGNED_SHORT_INT	rfptr0h;
}SFR_BYTE_RFPTR0;

typedef union{
	SFR_BYTE_RFPTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFPTR0;

SFR_GLOBAL	SFR_RFPTR0	rfptr0;

#ifdef __RL78__
#else
	#define	RFPTR0	(rfptr0.ALL)
#endif

/* RFDF00L */
#ifdef __RL78__
#else
	#define	RFDF00L	(rfdf00.BYTE.rfdf00l)
#endif

/* RFDF00H */
#ifdef __RL78__
#else
	#define	RFDF00H	(rfdf00.BYTE.rfdf00h)
#endif

/* RFDF00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf00l;
	SFR_UNSIGNED_SHORT_INT	rfdf00h;
}SFR_BYTE_RFDF00;

typedef union{
	SFR_BYTE_RFDF00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF00;

SFR_GLOBAL	SFR_RFDF00	rfdf00;

#ifdef __RL78__
#else
	#define	RFDF00	(rfdf00.ALL)
#endif

/* RFDF10L */
#ifdef __RL78__
#else
	#define	RFDF10L	(rfdf10.BYTE.rfdf10l)
#endif

/* RFDF10H */
#ifdef __RL78__
#else
	#define	RFDF10H	(rfdf10.BYTE.rfdf10h)
#endif

/* RFDF10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf10l;
	SFR_UNSIGNED_SHORT_INT	rfdf10h;
}SFR_BYTE_RFDF10;

typedef union{
	SFR_BYTE_RFDF10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF10;

SFR_GLOBAL	SFR_RFDF10	rfdf10;

#ifdef __RL78__
#else
	#define	RFDF10	(rfdf10.ALL)
#endif

