turatsamar/DRV8889/src/rl78_ca78k0r.h
/* RFDF20L */
#ifdef __RL78__
#else
	#define	RFDF20L	(rfdf20.BYTE.rfdf20l)
#endif

/* RFDF20H */
#ifdef __RL78__
#else
	#define	RFDF20H	(rfdf20.BYTE.rfdf20h)
#endif

/* RFDF20 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf20l;
	SFR_UNSIGNED_SHORT_INT	rfdf20h;
}SFR_BYTE_RFDF20;

typedef union{
	SFR_BYTE_RFDF20	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF20;

SFR_GLOBAL	SFR_RFDF20	rfdf20;

#ifdef __RL78__
#else
	#define	RFDF20	(rfdf20.ALL)
#endif

/* RFDF30L */
#ifdef __RL78__
#else
	#define	RFDF30L	(rfdf30.BYTE.rfdf30l)
#endif

/* RFDF30H */
#ifdef __RL78__
#else
	#define	RFDF30H	(rfdf30.BYTE.rfdf30h)
#endif

/* RFDF30 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf30l;
	SFR_UNSIGNED_SHORT_INT	rfdf30h;
}SFR_BYTE_RFDF30;

typedef union{
	SFR_BYTE_RFDF30	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF30;

SFR_GLOBAL	SFR_RFDF30	rfdf30;

#ifdef __RL78__
#else
	#define	RFDF30	(rfdf30.ALL)
#endif

/* RFIDL1L */
#ifdef __RL78__
#else
	#define	RFIDL1L	(rfidl1.BYTE.rfidl1l)
#endif

/* RFIDL1H */
#ifdef __RL78__
#else
	#define	RFIDL1H	(rfidl1.BYTE.rfidl1h)
#endif

/* RFIDL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfidl1l;
	SFR_UNSIGNED_SHORT_INT	rfidl1h;
}SFR_BYTE_RFIDL1;

typedef union{
	SFR_BYTE_RFIDL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFIDL1;

SFR_GLOBAL	SFR_RFIDL1	rfidl1;

#ifdef __RL78__
#else
	#define	RFIDL1	(rfidl1.ALL)
#endif

/* RFIDH1L */
#ifdef __RL78__
#else
	#define	RFIDH1L	(rfidh1.BYTE.rfidh1l)
#endif

/* RFIDH1H */
#ifdef __RL78__
#else
	#define	RFIDH1H	(rfidh1.BYTE.rfidh1h)
#endif

/* RFIDH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfidh1l;
	SFR_UNSIGNED_SHORT_INT	rfidh1h;
}SFR_BYTE_RFIDH1;

typedef union{
	SFR_BYTE_RFIDH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFIDH1;

SFR_GLOBAL	SFR_RFIDH1	rfidh1;

#ifdef __RL78__
#else
	#define	RFIDH1	(rfidh1.ALL)
#endif

/* RFTS1L */
#ifdef __RL78__
#else
	#define	RFTS1L	(rfts1.BYTE.rfts1l)
#endif

/* RFTS1H */
#ifdef __RL78__
#else
	#define	RFTS1H	(rfts1.BYTE.rfts1h)
#endif

/* RFTS1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfts1l;
	SFR_UNSIGNED_SHORT_INT	rfts1h;
}SFR_BYTE_RFTS1;

typedef union{
	SFR_BYTE_RFTS1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFTS1;

SFR_GLOBAL	SFR_RFTS1	rfts1;

#ifdef __RL78__
#else
	#define	RFTS1	(rfts1.ALL)
#endif

/* RFPTR1L */
#ifdef __RL78__
#else
	#define	RFPTR1L	(rfptr1.BYTE.rfptr1l)
#endif

/* RFPTR1H */
#ifdef __RL78__
#else
	#define	RFPTR1H	(rfptr1.BYTE.rfptr1h)
#endif

/* RFPTR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfptr1l;
	SFR_UNSIGNED_SHORT_INT	rfptr1h;
}SFR_BYTE_RFPTR1;

typedef union{
	SFR_BYTE_RFPTR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFPTR1;

SFR_GLOBAL	SFR_RFPTR1	rfptr1;

#ifdef __RL78__
#else
	#define	RFPTR1	(rfptr1.ALL)
#endif

/* RFDF01L */
#ifdef __RL78__
#else
	#define	RFDF01L	(rfdf01.BYTE.rfdf01l)
#endif

/* RFDF01H */
#ifdef __RL78__
#else
	#define	RFDF01H	(rfdf01.BYTE.rfdf01h)
#endif

/* RFDF01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf01l;
	SFR_UNSIGNED_SHORT_INT	rfdf01h;
}SFR_BYTE_RFDF01;

typedef union{
	SFR_BYTE_RFDF01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF01;

SFR_GLOBAL	SFR_RFDF01	rfdf01;

#ifdef __RL78__
#else
	#define	RFDF01	(rfdf01.ALL)
#endif

/* RFDF11L */
#ifdef __RL78__
#else
	#define	RFDF11L	(rfdf11.BYTE.rfdf11l)
#endif

/* RFDF11H */
#ifdef __RL78__
#else
	#define	RFDF11H	(rfdf11.BYTE.rfdf11h)
#endif

/* RFDF11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf11l;
	SFR_UNSIGNED_SHORT_INT	rfdf11h;
}SFR_BYTE_RFDF11;

typedef union{
	SFR_BYTE_RFDF11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF11;

SFR_GLOBAL	SFR_RFDF11	rfdf11;

#ifdef __RL78__
#else
	#define	RFDF11	(rfdf11.ALL)
#endif

/* RFDF21L */
#ifdef __RL78__
#else
	#define	RFDF21L	(rfdf21.BYTE.rfdf21l)
#endif

/* RFDF21H */
#ifdef __RL78__
#else
	#define	RFDF21H	(rfdf21.BYTE.rfdf21h)
#endif

/* RFDF21 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf21l;
	SFR_UNSIGNED_SHORT_INT	rfdf21h;
}SFR_BYTE_RFDF21;

typedef union{
	SFR_BYTE_RFDF21	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF21;

SFR_GLOBAL	SFR_RFDF21	rfdf21;

#ifdef __RL78__
#else
	#define	RFDF21	(rfdf21.ALL)
#endif

/* RFDF31L */
#ifdef __RL78__
#else
	#define	RFDF31L	(rfdf31.BYTE.rfdf31l)
#endif

/* RFDF31H */
#ifdef __RL78__
#else
	#define	RFDF31H	(rfdf31.BYTE.rfdf31h)
#endif

/* RFDF31 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	rfdf31l;
	SFR_UNSIGNED_SHORT_INT	rfdf31h;
}SFR_BYTE_RFDF31;

typedef union{
	SFR_BYTE_RFDF31	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_RFDF31;

SFR_GLOBAL	SFR_RFDF31	rfdf31;

#ifdef __RL78__
#else
	#define	RFDF31	(rfdf31.ALL)
#endif
/* CAN受信FIFOアクセス・レジスタここまで */

/* CAN0送受信FIFOアクセス・レジスタここから */
/* CFIDL0L */
#ifdef __RL78__
#else
	#define	CFIDL0L	(cfidl0.BYTE.cfidl0l)
#endif

/* CFIDL0H */
#ifdef __RL78__
#else
	#define	CFIDL0H	(cfidl0.BYTE.cfidl0h)
#endif

/* CFIDL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfidl0l;
	SFR_UNSIGNED_SHORT_INT	cfidl0h;
}SFR_BYTE_CFIDL0;

typedef union{
	SFR_BYTE_CFIDL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFIDL0;

SFR_GLOBAL	SFR_CFIDL0	cfidl0;

#ifdef __RL78__
#else
	#define	CFIDL0	(cfidl0.ALL)
#endif

/* CFIDH0L */
#ifdef __RL78__
#else
	#define	CFIDH0L	(cfidh0.BYTE.cfidh0l)
#endif

/* CFIDH0H */
#ifdef __RL78__
#else
	#define	CFIDH0H	(cfidh0.BYTE.cfidh0h)
#endif

/* CFIDH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfidh0l;
	SFR_UNSIGNED_SHORT_INT	cfidh0h;
}SFR_BYTE_CFIDH0;

typedef union{
	SFR_BYTE_CFIDH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFIDH0;

SFR_GLOBAL	SFR_CFIDH0	cfidh0;

#ifdef __RL78__
#else
	#define	CFIDH0	(cfidh0.ALL)
#endif

/* CFTS0L */
#ifdef __RL78__
#else
	#define	CFTS0L	(cfts0.BYTE.cfts0l)
#endif

/* CFTS0H */
#ifdef __RL78__
#else
	#define	CFTS0H	(cfts0.BYTE.cfts0h)
#endif

/* CFTS0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfts0l;
	SFR_UNSIGNED_SHORT_INT	cfts0h;
}SFR_BYTE_CFTS0;

typedef union{
	SFR_BYTE_CFTS0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFTS0;

