turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_CFTS0	cfts0;

#ifdef __RL78__
#else
	#define	CFTS0	(cfts0.ALL)
#endif

/* CFPTR0L */
#ifdef __RL78__
#else
	#define	CFPTR0L	(cfptr0.BYTE.cfptr0l)
#endif

/* CFPTR0H */
#ifdef __RL78__
#else
	#define	CFPTR0H	(cfptr0.BYTE.cfptr0h)
#endif

/* CFPTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfptr0l;
	SFR_UNSIGNED_SHORT_INT	cfptr0h;
}SFR_BYTE_CFPTR0;

typedef union{
	SFR_BYTE_CFPTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFPTR0;

SFR_GLOBAL	SFR_CFPTR0	cfptr0;

#ifdef __RL78__
#else
	#define	CFPTR0	(cfptr0.ALL)
#endif

/* CFDF00L */
#ifdef __RL78__
#else
	#define	CFDF00L	(cfdf00.BYTE.cfdf00l)
#endif

/* CFDF00H */
#ifdef __RL78__
#else
	#define	CFDF00H	(cfdf00.BYTE.cfdf00h)
#endif

/* CFDF00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfdf00l;
	SFR_UNSIGNED_SHORT_INT	cfdf00h;
}SFR_BYTE_CFDF00;

typedef union{
	SFR_BYTE_CFDF00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFDF00;

SFR_GLOBAL	SFR_CFDF00	cfdf00;

#ifdef __RL78__
#else
	#define	CFDF00	(cfdf00.ALL)
#endif

/* CFDF10L */
#ifdef __RL78__
#else
	#define	CFDF10L	(cfdf10.BYTE.cfdf10l)
#endif

/* CFDF10H */
#ifdef __RL78__
#else
	#define	CFDF10H	(cfdf10.BYTE.cfdf10h)
#endif

/* CFDF10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfdf10l;
	SFR_UNSIGNED_SHORT_INT	cfdf10h;
}SFR_BYTE_CFDF10;

typedef union{
	SFR_BYTE_CFDF10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFDF10;

SFR_GLOBAL	SFR_CFDF10	cfdf10;

#ifdef __RL78__
#else
	#define	CFDF10	(cfdf10.ALL)
#endif

/* CFDF20L */
#ifdef __RL78__
#else
	#define	CFDF20L	(cfdf20.BYTE.cfdf20l)
#endif

/* CFDF20H */
#ifdef __RL78__
#else
	#define	CFDF20H	(cfdf20.BYTE.cfdf20h)
#endif

/* CFDF20 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfdf20l;
	SFR_UNSIGNED_SHORT_INT	cfdf20h;
}SFR_BYTE_CFDF20;

typedef union{
	SFR_BYTE_CFDF20	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFDF20;

SFR_GLOBAL	SFR_CFDF20	cfdf20;

#ifdef __RL78__
#else
	#define	CFDF20	(cfdf20.ALL)
#endif

/* CFDF30L */
#ifdef __RL78__
#else
	#define	CFDF30L	(cfdf30.BYTE.cfdf30l)
#endif

/* CFDF30H */
#ifdef __RL78__
#else
	#define	CFDF30H	(cfdf30.BYTE.cfdf30h)
#endif

/* CFDF30 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	cfdf30l;
	SFR_UNSIGNED_SHORT_INT	cfdf30h;
}SFR_BYTE_CFDF30;

typedef union{
	SFR_BYTE_CFDF30	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_CFDF30;

SFR_GLOBAL	SFR_CFDF30	cfdf30;

#ifdef __RL78__
#else
	#define	CFDF30	(cfdf30.ALL)
#endif
/* CAN0送受信FIFOアクセス・レジスタここまで */

/* CAN0送信バッファ・レジスタここから */
/* TMIDL0L */
#ifdef __RL78__
#else
	#define	TMIDL0L	(tmidl0.BYTE.tmidl0l)
#endif

/* TMIDL0H */
#ifdef __RL78__
#else
	#define	TMIDL0H	(tmidl0.BYTE.tmidl0h)
#endif

/* TMIDL0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidl0l;
	SFR_UNSIGNED_SHORT_INT	tmidl0h;
}SFR_BYTE_TMIDL0;

typedef union{
	SFR_BYTE_TMIDL0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDL0;

SFR_GLOBAL	SFR_TMIDL0	tmidl0;

#ifdef __RL78__
#else
	#define	TMIDL0	(tmidl0.ALL)
#endif

/* TMIDH0L */
#ifdef __RL78__
#else
	#define	TMIDH0L	(tmidh0.BYTE.tmidh0l)
#endif

/* TMIDH0H */
#ifdef __RL78__
#else
	#define	TMIDH0H	(tmidh0.BYTE.tmidh0h)
#endif

/* TMIDH0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidh0l;
	SFR_UNSIGNED_SHORT_INT	tmidh0h;
}SFR_BYTE_TMIDH0;

typedef union{
	SFR_BYTE_TMIDH0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDH0;

SFR_GLOBAL	SFR_TMIDH0	tmidh0;

#ifdef __RL78__
#else
	#define	TMIDH0	(tmidh0.ALL)
#endif

/* TMPTR0L */
#ifdef __RL78__
#else
	#define	TMPTR0L	(tmptr0.BYTE.tmptr0l)
#endif

/* TMPTR0H */
#ifdef __RL78__
#else
	#define	TMPTR0H	(tmptr0.BYTE.tmptr0h)
#endif

/* TMPTR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmptr0l;
	SFR_UNSIGNED_SHORT_INT	tmptr0h;
}SFR_BYTE_TMPTR0;

typedef union{
	SFR_BYTE_TMPTR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMPTR0;

SFR_GLOBAL	SFR_TMPTR0	tmptr0;

#ifdef __RL78__
#else
	#define	TMPTR0	(tmptr0.ALL)
#endif

/* TMDF00L */
#ifdef __RL78__
#else
	#define	TMDF00L	(tmdf00.BYTE.tmdf00l)
#endif

/* TMDF00H */
#ifdef __RL78__
#else
	#define	TMDF00H	(tmdf00.BYTE.tmdf00h)
#endif

/* TMDF00 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf00l;
	SFR_UNSIGNED_SHORT_INT	tmdf00h;
}SFR_BYTE_TMDF00;

typedef union{
	SFR_BYTE_TMDF00	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF00;

SFR_GLOBAL	SFR_TMDF00	tmdf00;

#ifdef __RL78__
#else
	#define	TMDF00	(tmdf00.ALL)
#endif

/* TMDF10L */
#ifdef __RL78__
#else
	#define	TMDF10L	(tmdf10.BYTE.tmdf10l)
#endif

/* TMDF10H */
#ifdef __RL78__
#else
	#define	TMDF10H	(tmdf10.BYTE.tmdf10h)
#endif

/* TMDF10 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf10l;
	SFR_UNSIGNED_SHORT_INT	tmdf10h;
}SFR_BYTE_TMDF10;

typedef union{
	SFR_BYTE_TMDF10	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF10;

SFR_GLOBAL	SFR_TMDF10	tmdf10;

#ifdef __RL78__
#else
	#define	TMDF10	(tmdf10.ALL)
#endif

/* TMDF20L */
#ifdef __RL78__
#else
	#define	TMDF20L	(tmdf20.BYTE.tmdf20l)
#endif

/* TMDF20H */
#ifdef __RL78__
#else
	#define	TMDF20H	(tmdf20.BYTE.tmdf20h)
#endif

/* TMDF20 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf20l;
	SFR_UNSIGNED_SHORT_INT	tmdf20h;
}SFR_BYTE_TMDF20;

typedef union{
	SFR_BYTE_TMDF20	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF20;

SFR_GLOBAL	SFR_TMDF20	tmdf20;

#ifdef __RL78__
#else
	#define	TMDF20	(tmdf20.ALL)
#endif

/* TMDF30L */
#ifdef __RL78__
#else
	#define	TMDF30L	(tmdf30.BYTE.tmdf30l)
#endif

/* TMDF30H */
#ifdef __RL78__
#else
	#define	TMDF30H	(tmdf30.BYTE.tmdf30h)
#endif

/* TMDF30 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf30l;
	SFR_UNSIGNED_SHORT_INT	tmdf30h;
}SFR_BYTE_TMDF30;

typedef union{
	SFR_BYTE_TMDF30	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF30;

SFR_GLOBAL	SFR_TMDF30	tmdf30;

#ifdef __RL78__
#else
	#define	TMDF30	(tmdf30.ALL)
#endif

/* TMIDL1L */
#ifdef __RL78__
#else
	#define	TMIDL1L	(tmidl1.BYTE.tmidl1l)
#endif

