turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TMIDL1H */
#ifdef __RL78__
#else
	#define	TMIDL1H	(tmidl1.BYTE.tmidl1h)
#endif

/* TMIDL1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidl1l;
	SFR_UNSIGNED_SHORT_INT	tmidl1h;
}SFR_BYTE_TMIDL1;

typedef union{
	SFR_BYTE_TMIDL1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDL1;

SFR_GLOBAL	SFR_TMIDL1	tmidl1;

#ifdef __RL78__
#else
	#define	TMIDL1	(tmidl1.ALL)
#endif

/* TMIDH1L */
#ifdef __RL78__
#else
	#define	TMIDH1L	(tmidh1.BYTE.tmidh1l)
#endif

/* TMIDH1H */
#ifdef __RL78__
#else
	#define	TMIDH1H	(tmidh1.BYTE.tmidh1h)
#endif

/* TMIDH1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidh1l;
	SFR_UNSIGNED_SHORT_INT	tmidh1h;
}SFR_BYTE_TMIDH1;

typedef union{
	SFR_BYTE_TMIDH1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDH1;

SFR_GLOBAL	SFR_TMIDH1	tmidh1;

#ifdef __RL78__
#else
	#define	TMIDH1	(tmidh1.ALL)
#endif

/* TMPTR1L */
#ifdef __RL78__
#else
	#define	TMPTR1L	(tmptr1.BYTE.tmptr1l)
#endif

/* TMPTR1H */
#ifdef __RL78__
#else
	#define	TMPTR1H	(tmptr1.BYTE.tmptr1h)
#endif

/* TMPTR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmptr1l;
	SFR_UNSIGNED_SHORT_INT	tmptr1h;
}SFR_BYTE_TMPTR1;

typedef union{
	SFR_BYTE_TMPTR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMPTR1;

SFR_GLOBAL	SFR_TMPTR1	tmptr1;

#ifdef __RL78__
#else
	#define	TMPTR1	(tmptr1.ALL)
#endif

/* TMDF01L */
#ifdef __RL78__
#else
	#define	TMDF01L	(tmdf01.BYTE.tmdf01l)
#endif

/* TMDF01H */
#ifdef __RL78__
#else
	#define	TMDF01H	(tmdf01.BYTE.tmdf01h)
#endif

/* TMDF01 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf01l;
	SFR_UNSIGNED_SHORT_INT	tmdf01h;
}SFR_BYTE_TMDF01;

typedef union{
	SFR_BYTE_TMDF01	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF01;

SFR_GLOBAL	SFR_TMDF01	tmdf01;

#ifdef __RL78__
#else
	#define	TMDF01	(tmdf01.ALL)
#endif

/* TMDF11L */
#ifdef __RL78__
#else
	#define	TMDF11L	(tmdf11.BYTE.tmdf11l)
#endif

/* TMDF11H */
#ifdef __RL78__
#else
	#define	TMDF11H	(tmdf11.BYTE.tmdf11h)
#endif

/* TMDF11 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf11l;
	SFR_UNSIGNED_SHORT_INT	tmdf11h;
}SFR_BYTE_TMDF11;

typedef union{
	SFR_BYTE_TMDF11	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF11;

SFR_GLOBAL	SFR_TMDF11	tmdf11;

#ifdef __RL78__
#else
	#define	TMDF11	(tmdf11.ALL)
#endif

/* TMDF21L */
#ifdef __RL78__
#else
	#define	TMDF21L	(tmdf21.BYTE.tmdf21l)
#endif

/* TMDF21H */
#ifdef __RL78__
#else
	#define	TMDF21H	(tmdf21.BYTE.tmdf21h)
#endif

/* TMDF21 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf21l;
	SFR_UNSIGNED_SHORT_INT	tmdf21h;
}SFR_BYTE_TMDF21;

typedef union{
	SFR_BYTE_TMDF21	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF21;

SFR_GLOBAL	SFR_TMDF21	tmdf21;

#ifdef __RL78__
#else
	#define	TMDF21	(tmdf21.ALL)
#endif

/* TMDF31L */
#ifdef __RL78__
#else
	#define	TMDF31L	(tmdf31.BYTE.tmdf31l)
#endif

/* TMDF31H */
#ifdef __RL78__
#else
	#define	TMDF31H	(tmdf31.BYTE.tmdf31h)
#endif

/* TMDF31 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf31l;
	SFR_UNSIGNED_SHORT_INT	tmdf31h;
}SFR_BYTE_TMDF31;

typedef union{
	SFR_BYTE_TMDF31	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF31;

SFR_GLOBAL	SFR_TMDF31	tmdf31;

#ifdef __RL78__
#else
	#define	TMDF31	(tmdf31.ALL)
#endif

/* TMIDL2L */
#ifdef __RL78__
#else
	#define	TMIDL2L	(tmidl2.BYTE.tmidl2l)
#endif

/* TMIDL2H */
#ifdef __RL78__
#else
	#define	TMIDL2H	(tmidl2.BYTE.tmidl2h)
#endif

/* TMIDL2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidl2l;
	SFR_UNSIGNED_SHORT_INT	tmidl2h;
}SFR_BYTE_TMIDL2;

typedef union{
	SFR_BYTE_TMIDL2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDL2;

SFR_GLOBAL	SFR_TMIDL2	tmidl2;

#ifdef __RL78__
#else
	#define	TMIDL2	(tmidl2.ALL)
#endif

/* TMIDH2L */
#ifdef __RL78__
#else
	#define	TMIDH2L	(tmidh2.BYTE.tmidh2l)
#endif

/* TMIDH2H */
#ifdef __RL78__
#else
	#define	TMIDH2H	(tmidh2.BYTE.tmidh2h)
#endif

/* TMIDH2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidh2l;
	SFR_UNSIGNED_SHORT_INT	tmidh2h;
}SFR_BYTE_TMIDH2;

typedef union{
	SFR_BYTE_TMIDH2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDH2;

SFR_GLOBAL	SFR_TMIDH2	tmidh2;

#ifdef __RL78__
#else
	#define	TMIDH2	(tmidh2.ALL)
#endif

/* TMPTR2L */
#ifdef __RL78__
#else
	#define	TMPTR2L	(tmptr2.BYTE.tmptr2l)
#endif

/* TMPTR2H */
#ifdef __RL78__
#else
	#define	TMPTR2H	(tmptr2.BYTE.tmptr2h)
#endif

/* TMPTR2 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmptr2l;
	SFR_UNSIGNED_SHORT_INT	tmptr2h;
}SFR_BYTE_TMPTR2;

typedef union{
	SFR_BYTE_TMPTR2	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMPTR2;

SFR_GLOBAL	SFR_TMPTR2	tmptr2;

#ifdef __RL78__
#else
	#define	TMPTR2	(tmptr2.ALL)
#endif

/* TMDF02L */
#ifdef __RL78__
#else
	#define	TMDF02L	(tmdf02.BYTE.tmdf02l)
#endif

/* TMDF02H */
#ifdef __RL78__
#else
	#define	TMDF02H	(tmdf02.BYTE.tmdf02h)
#endif

/* TMDF02 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf02l;
	SFR_UNSIGNED_SHORT_INT	tmdf02h;
}SFR_BYTE_TMDF02;

typedef union{
	SFR_BYTE_TMDF02	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF02;

SFR_GLOBAL	SFR_TMDF02	tmdf02;

#ifdef __RL78__
#else
	#define	TMDF02	(tmdf02.ALL)
#endif

/* TMDF12L */
#ifdef __RL78__
#else
	#define	TMDF12L	(tmdf12.BYTE.tmdf12l)
#endif

/* TMDF12H */
#ifdef __RL78__
#else
	#define	TMDF12H	(tmdf12.BYTE.tmdf12h)
#endif

/* TMDF12 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf12l;
	SFR_UNSIGNED_SHORT_INT	tmdf12h;
}SFR_BYTE_TMDF12;

typedef union{
	SFR_BYTE_TMDF12	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF12;

SFR_GLOBAL	SFR_TMDF12	tmdf12;

#ifdef __RL78__
#else
	#define	TMDF12	(tmdf12.ALL)
#endif

/* TMDF22L */
#ifdef __RL78__
#else
	#define	TMDF22L	(tmdf22.BYTE.tmdf22l)
#endif

/* TMDF22H */
#ifdef __RL78__
#else
	#define	TMDF22H	(tmdf22.BYTE.tmdf22h)
#endif

/* TMDF22 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf22l;
	SFR_UNSIGNED_SHORT_INT	tmdf22h;
}SFR_BYTE_TMDF22;

typedef union{
	SFR_BYTE_TMDF22	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF22;

SFR_GLOBAL	SFR_TMDF22	tmdf22;

#ifdef __RL78__
#else
	#define	TMDF22	(tmdf22.ALL)
#endif

/* TMDF32L */
#ifdef __RL78__
#else
	#define	TMDF32L	(tmdf32.BYTE.tmdf32l)
#endif

