turatsamar/DRV8889/src/rl78_ca78k0r.h
/* TMDF32H */
#ifdef __RL78__
#else
	#define	TMDF32H	(tmdf32.BYTE.tmdf32h)
#endif

/* TMDF32 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf32l;
	SFR_UNSIGNED_SHORT_INT	tmdf32h;
}SFR_BYTE_TMDF32;

typedef union{
	SFR_BYTE_TMDF32	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF32;

SFR_GLOBAL	SFR_TMDF32	tmdf32;

#ifdef __RL78__
#else
	#define	TMDF32	(tmdf32.ALL)
#endif

/* TMIDL3L */
#ifdef __RL78__
#else
	#define	TMIDL3L	(tmidl3.BYTE.tmidl3l)
#endif

/* TMIDL3H */
#ifdef __RL78__
#else
	#define	TMIDL3H	(tmidl3.BYTE.tmidl3h)
#endif

/* TMIDL3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidl3l;
	SFR_UNSIGNED_SHORT_INT	tmidl3h;
}SFR_BYTE_TMIDL3;

typedef union{
	SFR_BYTE_TMIDL3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDL3;

SFR_GLOBAL	SFR_TMIDL3	tmidl3;

#ifdef __RL78__
#else
	#define	TMIDL3	(tmidl3.ALL)
#endif

/* TMIDH3L */
#ifdef __RL78__
#else
	#define	TMIDH3L	(tmidh3.BYTE.tmidh3l)
#endif

/* TMIDH3H */
#ifdef __RL78__
#else
	#define	TMIDH3H	(tmidh3.BYTE.tmidh3h)
#endif

/* TMIDH3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmidh3l;
	SFR_UNSIGNED_SHORT_INT	tmidh3h;
}SFR_BYTE_TMIDH3;

typedef union{
	SFR_BYTE_TMIDH3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMIDH3;

SFR_GLOBAL	SFR_TMIDH3	tmidh3;

#ifdef __RL78__
#else
	#define	TMIDH3	(tmidh3.ALL)
#endif

/* TMPTR3L */
#ifdef __RL78__
#else
	#define	TMPTR3L	(tmptr3.BYTE.tmptr3l)
#endif

/* TMPTR3H */
#ifdef __RL78__
#else
	#define	TMPTR3H	(tmptr3.BYTE.tmptr3h)
#endif

/* TMPTR3 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmptr3l;
	SFR_UNSIGNED_SHORT_INT	tmptr3h;
}SFR_BYTE_TMPTR3;

typedef union{
	SFR_BYTE_TMPTR3	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMPTR3;

SFR_GLOBAL	SFR_TMPTR3	tmptr3;

#ifdef __RL78__
#else
	#define	TMPTR3	(tmptr3.ALL)
#endif

/* TMDF03L */
#ifdef __RL78__
#else
	#define	TMDF03L	(tmdf03.BYTE.tmdf03l)
#endif

/* TMDF03H */
#ifdef __RL78__
#else
	#define	TMDF03H	(tmdf03.BYTE.tmdf03h)
#endif

/* TMDF03 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf03l;
	SFR_UNSIGNED_SHORT_INT	tmdf03h;
}SFR_BYTE_TMDF03;

typedef union{
	SFR_BYTE_TMDF03	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF03;

SFR_GLOBAL	SFR_TMDF03	tmdf03;

#ifdef __RL78__
#else
	#define	TMDF03	(tmdf03.ALL)
#endif

/* TMDF13L */
#ifdef __RL78__
#else
	#define	TMDF13L	(tmdf13.BYTE.tmdf13l)
#endif

/* TMDF13H */
#ifdef __RL78__
#else
	#define	TMDF13H	(tmdf13.BYTE.tmdf13h)
#endif

/* TMDF13 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf13l;
	SFR_UNSIGNED_SHORT_INT	tmdf13h;
}SFR_BYTE_TMDF13;

typedef union{
	SFR_BYTE_TMDF13	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF13;

SFR_GLOBAL	SFR_TMDF13	tmdf13;

#ifdef __RL78__
#else
	#define	TMDF13	(tmdf13.ALL)
#endif

/* TMDF23L */
#ifdef __RL78__
#else
	#define	TMDF23L	(tmdf23.BYTE.tmdf23l)
#endif

/* TMDF23H */
#ifdef __RL78__
#else
	#define	TMDF23H	(tmdf23.BYTE.tmdf23h)
#endif

/* TMDF23 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf23l;
	SFR_UNSIGNED_SHORT_INT	tmdf23h;
}SFR_BYTE_TMDF23;

typedef union{
	SFR_BYTE_TMDF23	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF23;

SFR_GLOBAL	SFR_TMDF23	tmdf23;

#ifdef __RL78__
#else
	#define	TMDF23	(tmdf23.ALL)
#endif

/* TMDF33L */
#ifdef __RL78__
#else
	#define	TMDF33L	(tmdf33.BYTE.tmdf33l)
#endif

/* TMDF33H */
#ifdef __RL78__
#else
	#define	TMDF33H	(tmdf33.BYTE.tmdf33h)
#endif

/* TMDF33 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	tmdf33l;
	SFR_UNSIGNED_SHORT_INT	tmdf33h;
}SFR_BYTE_TMDF33;

typedef union{
	SFR_BYTE_TMDF33	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_TMDF33;

SFR_GLOBAL	SFR_TMDF33	tmdf33;

#ifdef __RL78__
#else
	#define	TMDF33	(tmdf33.ALL)
#endif
/* CAN0送信バッファ・レジスタここまで */

/* THLACC0L */
#ifdef __RL78__
#else
	#define	THLACC0L	(thlacc0.BYTE.thlacc0l)
#endif

/* THLACC0H */
#ifdef __RL78__
#else
	#define	THLACC0H	(thlacc0.BYTE.thlacc0h)
#endif

/* THLACC0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	thlacc0l;
	SFR_UNSIGNED_SHORT_INT	thlacc0h;
}SFR_BYTE_THLACC0;

typedef union{
	SFR_BYTE_THLACC0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_THLACC0;

SFR_GLOBAL	SFR_THLACC0	thlacc0;

#ifdef __RL78__
#else
	#define	THLACC0	(thlacc0.ALL)
#endif

/* LWBR0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lwbr0;

#ifdef __RL78__
#else
	#define	LWBR0	(lwbr0)
#endif

/* LWBR1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lwbr1;

#ifdef __RL78__
#else
	#define	LWBR1	(lwbr1)
#endif

/* LBRP00 */
#ifdef __RL78__
#else
	#define	LBRP00	(lbrp0.BYTE.lbrp00)
#endif

/* LBRP01 */
#ifdef __RL78__
#else
	#define	LBRP01	(lbrp0.BYTE.lbrp01)
#endif

/* LBRP0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lbrp00;
	SFR_UNSIGNED_SHORT_INT	lbrp01;
}SFR_BYTE_LBRP0;

typedef union{
	SFR_BYTE_LBRP0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LBRP0;

SFR_GLOBAL	SFR_LBRP0	lbrp0;

#ifdef __RL78__
#else
	#define	LBRP0	(lbrp0.ALL)
#endif

/* LBRP10 */
#ifdef __RL78__
#else
	#define	LBRP10	(lbrp1.BYTE.lbrp10)
#endif

/* LBRP11 */
#ifdef __RL78__
#else
	#define	LBRP11	(lbrp1.BYTE.lbrp11)
#endif

/* LBRP1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lbrp10;
	SFR_UNSIGNED_SHORT_INT	lbrp11;
}SFR_BYTE_LBRP1;

typedef union{
	SFR_BYTE_LBRP0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LBRP1;

SFR_GLOBAL	SFR_LBRP1	lbrp1;

#ifdef __RL78__
#else
	#define	LBRP1	(lbrp1.ALL)
#endif

/* LSTC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lstc0;

#ifdef __RL78__
#else
	#define	LSTC0	(lstc0)
#endif

/* LSTC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lstc1;

#ifdef __RL78__
#else
	#define	LSTC1	(lstc1)
#endif

/* LUSC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lusc0;

#ifdef __RL78__
#else
	#define	LUSC0	(lusc0)
#endif

/* LUSC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lusc1;

#ifdef __RL78__
#else
	#define	LUSC1	(lusc1)
#endif

/* LMD0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lmd0;

#ifdef __RL78__
#else
	#define	LMD0	(lmd0)
#endif

/* LMD1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lmd1;

#ifdef __RL78__
#else
	#define	LMD1	(lmd1)
#endif

/* LBFC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lbfc0;

#ifdef __RL78__
#else
	#define	LBFC0	(lbfc0)
#endif

