turatsamar/DRV8889/src/rl78_ca78k0r.h
/* LBFC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lbfc1;

#ifdef __RL78__
#else
	#define	LBFC1	(lbfc1)
#endif

/* LSC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lsc0;

#ifdef __RL78__
#else
	#define	LSC0	(lsc0)
#endif

/* LSC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lsc1;

#ifdef __RL78__
#else
	#define	LSC1	(lsc1)
#endif

/* LWUP0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lwup0;

#ifdef __RL78__
#else
	#define	LWUP0	(lwup0)
#endif

/* LWUP1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lwup1;

#ifdef __RL78__
#else
	#define	LWUP1	(lwup1)
#endif

/* LIE0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lie0;

#ifdef __RL78__
#else
	#define	LIE0	(lie0)
#endif

/* LIE1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lie1;

#ifdef __RL78__
#else
	#define	LIE1	(lie1)
#endif

/* LEDE0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lede0;

#ifdef __RL78__
#else
	#define	LEDE0	(lede0)
#endif

/* LEDE1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lede1;

#ifdef __RL78__
#else
	#define	LEDE1	(lede1)
#endif

/* LCUC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lcuc0;

#ifdef __RL78__
#else
	#define	LCUC0	(lcuc0)
#endif

/* LCUC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lcuc1;

#ifdef __RL78__
#else
	#define	LCUC1	(lcuc1)
#endif

/* LTRC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ltrc0;

#ifdef __RL78__
#else
	#define	LTRC0	(ltrc0)
#endif

/* LTRC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ltrc1;

#ifdef __RL78__
#else
	#define	LTRC1	(ltrc1)
#endif

/* LMST0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lmst0;

#ifdef __RL78__
#else
	#define	LMST0	(lmst0)
#endif

/* LMST1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lmst1;

#ifdef __RL78__
#else
	#define	LMST1	(lmst1)
#endif

/* LST0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lst0;

#ifdef __RL78__
#else
	#define	LST0	(lst0)
#endif

/* LST1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lst1;

#ifdef __RL78__
#else
	#define	LST1	(lst1)
#endif

/* LEST0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lest0;

#ifdef __RL78__
#else
	#define	LEST0	(lest0)
#endif

/* LEST1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lest1;

#ifdef __RL78__
#else
	#define	LEST1	(lest1)
#endif

/* LDFC0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldfc0;

#ifdef __RL78__
#else
	#define	LDFC0	(ldfc0)
#endif

/* LDFC1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldfc1;

#ifdef __RL78__
#else
	#define	LDFC1	(ldfc1)
#endif

/* LIDB0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lidb0;

#ifdef __RL78__
#else
	#define	LIDB0	(lidb0)
#endif

/* LIDB1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lidb1;

#ifdef __RL78__
#else
	#define	LIDB1	(lidb1)
#endif

/* LCBR0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lcbr0;

#ifdef __RL78__
#else
	#define	LCBR0	(lcbr0)
#endif

/* LCBR1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	lcbr1;

#ifdef __RL78__
#else
	#define	LCBR1	(lcbr1)
#endif

/* LUDB00 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ludb00;

#ifdef __RL78__
#else
	#define	LUDB00	(ludb00)
#endif

/* LUDB10 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ludb10;

#ifdef __RL78__
#else
	#define	LUDB10	(ludb10)
#endif

/* LDB01 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb01;

#ifdef __RL78__
#else
	#define	LDB01	(ldb01)
#endif

/* LDB11 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb11;

#ifdef __RL78__
#else
	#define	LDB11	(ldb11)
#endif

/* LDB02 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb02;

#ifdef __RL78__
#else
	#define	LDB02	(ldb02)
#endif

/* LDB12 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb12;

#ifdef __RL78__
#else
	#define	LDB12	(ldb12)
#endif

/* LDB03 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb03;

#ifdef __RL78__
#else
	#define	LDB03	(ldb03)
#endif

/* LDB13 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb13;

#ifdef __RL78__
#else
	#define	LDB13	(ldb13)
#endif

/* LDB04 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb04;

#ifdef __RL78__
#else
	#define	LDB04	(ldb04)
#endif

/* LDB14 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb14;

#ifdef __RL78__
#else
	#define	LDB14	(ldb14)
#endif

/* LDB05 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb05;

#ifdef __RL78__
#else
	#define	LDB05	(ldb05)
#endif

/* LDB15 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb15;

#ifdef __RL78__
#else
	#define	LDB15	(ldb15)
#endif

/* LDB06 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb06;

#ifdef __RL78__
#else
	#define	LDB06	(ldb06)
#endif

/* LDB16 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb16;

#ifdef __RL78__
#else
	#define	LDB16	(ldb16)
#endif

/* LDB07 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb07;

#ifdef __RL78__
#else
	#define	LDB07	(ldb07)
#endif

/* LDB17 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb17;

#ifdef __RL78__
#else
	#define	LDB17	(ldb17)
#endif

/* LDB08 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb08;

#ifdef __RL78__
#else
	#define	LDB08	(ldb08)
#endif

/* LDB18 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	ldb18;

#ifdef __RL78__
#else
	#define	LDB18	(ldb18)
#endif

/* LUOER0 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	luoer0;

#ifdef __RL78__
#else
	#define	LUOER0	(luoer0)
#endif

/* LUOER1 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	luoer1;

#ifdef __RL78__
#else
	#define	LUOER1	(luoer1)
#endif

/* LUOR01 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	luor01;

#ifdef __RL78__
#else
	#define	LUOR01	(luor01)
#endif

/* LUOR11 */
SFR_GLOBAL	SFR_UNSIGNED_CHAR	luor11;

#ifdef __RL78__
#else
	#define	LUOR11	(luor11)
#endif

/* LUTDR0L */
#ifdef __RL78__
#else
	#define	LUTDR0L	(lutdr0.BYTE.lutdr0l)
#endif

/* LUTDR0H */
#ifdef __RL78__
#else
	#define	LUTDR0H	(lutdr0.BYTE.lutdr0h)
#endif

/* LUTDR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lutdr0l;
	SFR_UNSIGNED_SHORT_INT	lutdr0h;
}SFR_BYTE_LUTDR0;

typedef union{
	SFR_BYTE_LUTDR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LUTDR0;

SFR_GLOBAL	SFR_LUTDR0	lutdr0;

#ifdef __RL78__
#else
	#define	LUTDR0	(lutdr0.ALL)
#endif

/* LUTDR1L */
#ifdef __RL78__
#else
	#define	LUTDR1L	(lutdr1.BYTE.lutdr1l)
#endif

/* LUTDR1H */
#ifdef __RL78__
#else
	#define	LUTDR1H	(lutdr1.BYTE.lutdr1h)
#endif

/* LUTDR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lutdr1l;
	SFR_UNSIGNED_SHORT_INT	lutdr1h;
}SFR_BYTE_LUTDR1;

typedef union{
	SFR_BYTE_LUTDR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LUTDR1;

SFR_GLOBAL	SFR_LUTDR1	lutdr1;

#ifdef __RL78__
#else
	#define	LUTDR1	(lutdr1.ALL)
#endif

