turatsamar/DRV8889/src/rl78_ca78k0r.h
/* LURDR0L */
#ifdef __RL78__
#else
	#define	LURDR0L	(lurdr0.BYTE.lurdr0l)
#endif

/* LURDR0H */
#ifdef __RL78__
#else
	#define	LURDR0H	(lurdr0.BYTE.lurdr0h)
#endif

/* LURDR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lurdr0l;
	SFR_UNSIGNED_SHORT_INT	lurdr0h;
}SFR_BYTE_LURDR0;

typedef union{
	SFR_BYTE_LURDR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LURDR0;

SFR_GLOBAL	SFR_LURDR0	lurdr0;

#ifdef __RL78__
#else
	#define	LURDR0	(lurdr0.ALL)
#endif

/* LURDR1L */
#ifdef __RL78__
#else
	#define	LURDR1L	(lurdr1.BYTE.lurdr1l)
#endif

/* LURDR1H */
#ifdef __RL78__
#else
	#define	LURDR1H	(lurdr1.BYTE.lurdr1h)
#endif

/* LURDR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	lurdr1l;
	SFR_UNSIGNED_SHORT_INT	lurdr1h;
}SFR_BYTE_LURDR1;

typedef union{
	SFR_BYTE_LURDR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LURDR1;

SFR_GLOBAL	SFR_LURDR1	lurdr1;

#ifdef __RL78__
#else
	#define	LURDR1	(lurdr1.ALL)
#endif

/* LUWTDR0L */
#ifdef __RL78__
#else
	#define	LUWTDR0L	(luwtdr0.BYTE.luwtdr0l)
#endif

/* LUWTDR0H */
#ifdef __RL78__
#else
	#define	LUWTDR0H	(luwtdr0.BYTE.luwtdr0h)
#endif

/* LUWTDR0 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	luwtdr0l;
	SFR_UNSIGNED_SHORT_INT	luwtdr0h;
}SFR_BYTE_LUWTDR0;

typedef union{
	SFR_BYTE_LUWTDR0	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LUWTDR0;

SFR_GLOBAL	SFR_LUWTDR0	luwtdr0;

#ifdef __RL78__
#else
	#define	LUWTDR0	(luwtdr0.ALL)
#endif

/* LUWTDR1L */
#ifdef __RL78__
#else
	#define	LUWTDR1L	(luwtdr1.BYTE.luwtdr1l)
#endif

/* LUWTDR1H */
#ifdef __RL78__
#else
	#define	LUWTDR1H	(luwtdr1.BYTE.luwtdr1h)
#endif

/* LUWTDR1 */
typedef struct{
	SFR_UNSIGNED_SHORT_INT	luwtdr1l;
	SFR_UNSIGNED_SHORT_INT	luwtdr1h;
}SFR_BYTE_LUWTDR1;

typedef union{
	SFR_BYTE_LUWTDR1	BYTE;
	SFR_UNSIGNED_SHORT_INT	ALL;
}SFR_LUWTDR1;

SFR_GLOBAL	SFR_LUWTDR1	luwtdr1;

#ifdef __RL78__
#else
	#define	LUWTDR1	(luwtdr1.ALL)
#endif

/*TRJ0*/
SFR_GLOBAL SFR_UNSIGNED_SHORT_INT trj0;
#ifdef __RL78__
#else
	#define	TRJ0	(trj0)
#endif

/* ELSELR00 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR00;

SFR_GLOBAL	SFR_ELSELR00	elselr00;

#ifdef __RL78__
	#define	ELSELR00_0	(ELSELR00.0)
	#define	ELSELR00_1	(ELSELR00.1)
	#define	ELSELR00_2	(ELSELR00.2)
	#define	ELSELR00_3	(ELSELR00.3)
	#define	ELSELR00_4	(ELSELR00.4)
	#define	ELSELR00_5	(ELSELR00.5)
	#define	ELSELR00_6	(ELSELR00.6)
	#define	ELSELR00_7	(ELSELR00.7)
#else
	#define	ELSELR00_0	(elselr00.BIT_NUMBER.bit0)
	#define	ELSELR00_1	(elselr00.BIT_NUMBER.bit1)
	#define	ELSELR00_2	(elselr00.BIT_NUMBER.bit2)
	#define	ELSELR00_3	(elselr00.BIT_NUMBER.bit3)
	#define	ELSELR00_4	(elselr00.BIT_NUMBER.bit4)
	#define	ELSELR00_5	(elselr00.BIT_NUMBER.bit5)
	#define	ELSELR00_6	(elselr00.BIT_NUMBER.bit6)
	#define	ELSELR00_7	(elselr00.BIT_NUMBER.bit7)
	#define	ELSELR00	(elselr00.ALL)
#endif

/* ELSELR01 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR01;

SFR_GLOBAL	SFR_ELSELR01	elselr01;

#ifdef __RL78__
	#define	ELSELR01_0	(ELSELR01.0)
	#define	ELSELR01_1	(ELSELR01.1)
	#define	ELSELR01_2	(ELSELR01.2)
	#define	ELSELR01_3	(ELSELR01.3)
	#define	ELSELR01_4	(ELSELR01.4)
	#define	ELSELR01_5	(ELSELR01.5)
	#define	ELSELR01_6	(ELSELR01.6)
	#define	ELSELR01_7	(ELSELR01.7)
#else
	#define	ELSELR01_0	(elselr01.BIT_NUMBER.bit0)
	#define	ELSELR01_1	(elselr01.BIT_NUMBER.bit1)
	#define	ELSELR01_2	(elselr01.BIT_NUMBER.bit2)
	#define	ELSELR01_3	(elselr01.BIT_NUMBER.bit3)
	#define	ELSELR01_4	(elselr01.BIT_NUMBER.bit4)
	#define	ELSELR01_5	(elselr01.BIT_NUMBER.bit5)
	#define	ELSELR01_6	(elselr01.BIT_NUMBER.bit6)
	#define	ELSELR01_7	(elselr01.BIT_NUMBER.bit7)
	#define	ELSELR01	(elselr01.ALL)
#endif

/* ELSELR02 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR02;

SFR_GLOBAL	SFR_ELSELR02	elselr02;

#ifdef __RL78__
	#define	ELSELR02_0	(ELSELR02.0)
	#define	ELSELR02_1	(ELSELR02.1)
	#define	ELSELR02_2	(ELSELR02.2)
	#define	ELSELR02_3	(ELSELR02.3)
	#define	ELSELR02_4	(ELSELR02.4)
	#define	ELSELR02_5	(ELSELR02.5)
	#define	ELSELR02_6	(ELSELR02.6)
	#define	ELSELR02_7	(ELSELR02.7)
#else
	#define	ELSELR02_0	(elselr02.BIT_NUMBER.bit0)
	#define	ELSELR02_1	(elselr02.BIT_NUMBER.bit1)
	#define	ELSELR02_2	(elselr02.BIT_NUMBER.bit2)
	#define	ELSELR02_3	(elselr02.BIT_NUMBER.bit3)
	#define	ELSELR02_4	(elselr02.BIT_NUMBER.bit4)
	#define	ELSELR02_5	(elselr02.BIT_NUMBER.bit5)
	#define	ELSELR02_6	(elselr02.BIT_NUMBER.bit6)
	#define	ELSELR02_7	(elselr02.BIT_NUMBER.bit7)
	#define	ELSELR02	(elselr02.ALL)
#endif

/* ELSELR03 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR03;

SFR_GLOBAL	SFR_ELSELR03	elselr03;

#ifdef __RL78__
	#define	ELSELR03_0	(ELSELR03.0)
	#define	ELSELR03_1	(ELSELR03.1)
	#define	ELSELR03_2	(ELSELR03.2)
	#define	ELSELR03_3	(ELSELR03.3)
	#define	ELSELR03_4	(ELSELR03.4)
	#define	ELSELR03_5	(ELSELR03.5)
	#define	ELSELR03_6	(ELSELR03.6)
	#define	ELSELR03_7	(ELSELR03.7)
#else
	#define	ELSELR03_0	(elselr03.BIT_NUMBER.bit0)
	#define	ELSELR03_1	(elselr03.BIT_NUMBER.bit1)
	#define	ELSELR03_2	(elselr03.BIT_NUMBER.bit2)
	#define	ELSELR03_3	(elselr03.BIT_NUMBER.bit3)
	#define	ELSELR03_4	(elselr03.BIT_NUMBER.bit4)
	#define	ELSELR03_5	(elselr03.BIT_NUMBER.bit5)
	#define	ELSELR03_6	(elselr03.BIT_NUMBER.bit6)
	#define	ELSELR03_7	(elselr03.BIT_NUMBER.bit7)
	#define	ELSELR03	(elselr03.ALL)
#endif

/* ELSELR04 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR04;

SFR_GLOBAL	SFR_ELSELR04	elselr04;

#ifdef __RL78__
	#define	ELSELR04_0	(ELSELR04.0)
	#define	ELSELR04_1	(ELSELR04.1)
	#define	ELSELR04_2	(ELSELR04.2)
	#define	ELSELR04_3	(ELSELR04.3)
	#define	ELSELR04_4	(ELSELR04.4)
	#define	ELSELR04_5	(ELSELR04.5)
	#define	ELSELR04_6	(ELSELR04.6)
	#define	ELSELR04_7	(ELSELR04.7)
#else
	#define	ELSELR04_0	(elselr04.BIT_NUMBER.bit0)
	#define	ELSELR04_1	(elselr04.BIT_NUMBER.bit1)
	#define	ELSELR04_2	(elselr04.BIT_NUMBER.bit2)
	#define	ELSELR04_3	(elselr04.BIT_NUMBER.bit3)
	#define	ELSELR04_4	(elselr04.BIT_NUMBER.bit4)
	#define	ELSELR04_5	(elselr04.BIT_NUMBER.bit5)
	#define	ELSELR04_6	(elselr04.BIT_NUMBER.bit6)
	#define	ELSELR04_7	(elselr04.BIT_NUMBER.bit7)
	#define	ELSELR04	(elselr04.ALL)
#endif

/* ELSELR05 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR05;

