turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_ELSELR05	elselr05;

#ifdef __RL78__
	#define	ELSELR05_0	(ELSELR05.0)
	#define	ELSELR05_1	(ELSELR05.1)
	#define	ELSELR05_2	(ELSELR05.2)
	#define	ELSELR05_3	(ELSELR05.3)
	#define	ELSELR05_4	(ELSELR05.4)
	#define	ELSELR05_5	(ELSELR05.5)
	#define	ELSELR05_6	(ELSELR05.6)
	#define	ELSELR05_7	(ELSELR05.7)
#else
	#define	ELSELR05_0	(elselr05.BIT_NUMBER.bit0)
	#define	ELSELR05_1	(elselr05.BIT_NUMBER.bit1)
	#define	ELSELR05_2	(elselr05.BIT_NUMBER.bit2)
	#define	ELSELR05_3	(elselr05.BIT_NUMBER.bit3)
	#define	ELSELR05_4	(elselr05.BIT_NUMBER.bit4)
	#define	ELSELR05_5	(elselr05.BIT_NUMBER.bit5)
	#define	ELSELR05_6	(elselr05.BIT_NUMBER.bit6)
	#define	ELSELR05_7	(elselr05.BIT_NUMBER.bit7)
	#define	ELSELR05	(elselr05.ALL)
#endif

/* ELSELR06 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR06;

SFR_GLOBAL	SFR_ELSELR06	elselr06;

#ifdef __RL78__
	#define	ELSELR06_0	(ELSELR06.0)
	#define	ELSELR06_1	(ELSELR06.1)
	#define	ELSELR06_2	(ELSELR06.2)
	#define	ELSELR06_3	(ELSELR06.3)
	#define	ELSELR06_4	(ELSELR06.4)
	#define	ELSELR06_5	(ELSELR06.5)
	#define	ELSELR06_6	(ELSELR06.6)
	#define	ELSELR06_7	(ELSELR06.7)
#else
	#define	ELSELR06_0	(elselr06.BIT_NUMBER.bit0)
	#define	ELSELR06_1	(elselr06.BIT_NUMBER.bit1)
	#define	ELSELR06_2	(elselr06.BIT_NUMBER.bit2)
	#define	ELSELR06_3	(elselr06.BIT_NUMBER.bit3)
	#define	ELSELR06_4	(elselr06.BIT_NUMBER.bit4)
	#define	ELSELR06_5	(elselr06.BIT_NUMBER.bit5)
	#define	ELSELR06_6	(elselr06.BIT_NUMBER.bit6)
	#define	ELSELR06_7	(elselr06.BIT_NUMBER.bit7)
	#define	ELSELR06	(elselr06.ALL)
#endif

/* ELSELR07 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR07;

SFR_GLOBAL	SFR_ELSELR07	elselr07;

#ifdef __RL78__
	#define	ELSELR07_0	(ELSELR07.0)
	#define	ELSELR07_1	(ELSELR07.1)
	#define	ELSELR07_2	(ELSELR07.2)
	#define	ELSELR07_3	(ELSELR07.3)
	#define	ELSELR07_4	(ELSELR07.4)
	#define	ELSELR07_5	(ELSELR07.5)
	#define	ELSELR07_6	(ELSELR07.6)
	#define	ELSELR07_7	(ELSELR07.7)
#else
	#define	ELSELR07_0	(elselr07.BIT_NUMBER.bit0)
	#define	ELSELR07_1	(elselr07.BIT_NUMBER.bit1)
	#define	ELSELR07_2	(elselr07.BIT_NUMBER.bit2)
	#define	ELSELR07_3	(elselr07.BIT_NUMBER.bit3)
	#define	ELSELR07_4	(elselr07.BIT_NUMBER.bit4)
	#define	ELSELR07_5	(elselr07.BIT_NUMBER.bit5)
	#define	ELSELR07_6	(elselr07.BIT_NUMBER.bit6)
	#define	ELSELR07_7	(elselr07.BIT_NUMBER.bit7)
	#define	ELSELR07	(elselr07.ALL)
#endif

/* ELSELR08 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR08;

SFR_GLOBAL	SFR_ELSELR08	elselr08;

#ifdef __RL78__
	#define	ELSELR08_0	(ELSELR08.0)
	#define	ELSELR08_1	(ELSELR08.1)
	#define	ELSELR08_2	(ELSELR08.2)
	#define	ELSELR08_3	(ELSELR08.3)
	#define	ELSELR08_4	(ELSELR08.4)
	#define	ELSELR08_5	(ELSELR08.5)
	#define	ELSELR08_6	(ELSELR08.6)
	#define	ELSELR08_7	(ELSELR08.7)
#else
	#define	ELSELR08_0	(elselr08.BIT_NUMBER.bit0)
	#define	ELSELR08_1	(elselr08.BIT_NUMBER.bit1)
	#define	ELSELR08_2	(elselr08.BIT_NUMBER.bit2)
	#define	ELSELR08_3	(elselr08.BIT_NUMBER.bit3)
	#define	ELSELR08_4	(elselr08.BIT_NUMBER.bit4)
	#define	ELSELR08_5	(elselr08.BIT_NUMBER.bit5)
	#define	ELSELR08_6	(elselr08.BIT_NUMBER.bit6)
	#define	ELSELR08_7	(elselr08.BIT_NUMBER.bit7)
	#define	ELSELR08	(elselr08.ALL)
#endif

/* ELSELR09 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR09;

SFR_GLOBAL	SFR_ELSELR09	elselr09;

#ifdef __RL78__
	#define	ELSELR09_0	(ELSELR09.0)
	#define	ELSELR09_1	(ELSELR09.1)
	#define	ELSELR09_2	(ELSELR09.2)
	#define	ELSELR09_3	(ELSELR09.3)
	#define	ELSELR09_4	(ELSELR09.4)
	#define	ELSELR09_5	(ELSELR09.5)
	#define	ELSELR09_6	(ELSELR09.6)
	#define	ELSELR09_7	(ELSELR09.7)
#else
	#define	ELSELR09_0	(elselr09.BIT_NUMBER.bit0)
	#define	ELSELR09_1	(elselr09.BIT_NUMBER.bit1)
	#define	ELSELR09_2	(elselr09.BIT_NUMBER.bit2)
	#define	ELSELR09_3	(elselr09.BIT_NUMBER.bit3)
	#define	ELSELR09_4	(elselr09.BIT_NUMBER.bit4)
	#define	ELSELR09_5	(elselr09.BIT_NUMBER.bit5)
	#define	ELSELR09_6	(elselr09.BIT_NUMBER.bit6)
	#define	ELSELR09_7	(elselr09.BIT_NUMBER.bit7)
	#define	ELSELR09	(elselr09.ALL)
#endif

/* ADTRGS0 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADTRGS0;

SFR_GLOBAL	SFR_ADTRGS0	adtrgs0;

#ifdef __RL78__
	#define	ADTRGS0_0	(ADTRGS0.0)
	#define	ADTRGS0_1	(ADTRGS0.1)
	#define	ADTRGS0_2	(ADTRGS0.2)
	#define	ADTRGS0_3	(ADTRGS0.3)
	#define	ADTRGS0_4	(ADTRGS0.4)
	#define	ADTRGS0_5	(ADTRGS0.5)
	#define	ADTRGS0_6	(ADTRGS0.6)
	#define	ADTRGS0_7	(ADTRGS0.7)
#else
	#define	ADTRGS0_0	(adtrgs0.BIT_NUMBER.bit0)
	#define	ADTRGS0_1	(adtrgs0.BIT_NUMBER.bit1)
	#define	ADTRGS0_2	(adtrgs0.BIT_NUMBER.bit2)
	#define	ADTRGS0_3	(adtrgs0.BIT_NUMBER.bit3)
	#define	ADTRGS0_4	(adtrgs0.BIT_NUMBER.bit4)
	#define	ADTRGS0_5	(adtrgs0.BIT_NUMBER.bit5)
	#define	ADTRGS0_6	(adtrgs0.BIT_NUMBER.bit6)
	#define	ADTRGS0_7	(adtrgs0.BIT_NUMBER.bit7)
	#define	ADTRGS0	(adtrgs0.ALL)
#endif

/* ELSELR10 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR10;

SFR_GLOBAL	SFR_ELSELR10	elselr10;

#ifdef __RL78__
	#define	ELSELR10_0	(ELSELR10.0)
	#define	ELSELR10_1	(ELSELR10.1)
	#define	ELSELR10_2	(ELSELR10.2)
	#define	ELSELR10_3	(ELSELR10.3)
	#define	ELSELR10_4	(ELSELR10.4)
	#define	ELSELR10_5	(ELSELR10.5)
	#define	ELSELR10_6	(ELSELR10.6)
	#define	ELSELR10_7	(ELSELR10.7)
#else
	#define	ELSELR10_0	(elselr10.BIT_NUMBER.bit0)
	#define	ELSELR10_1	(elselr10.BIT_NUMBER.bit1)
	#define	ELSELR10_2	(elselr10.BIT_NUMBER.bit2)
	#define	ELSELR10_3	(elselr10.BIT_NUMBER.bit3)
	#define	ELSELR10_4	(elselr10.BIT_NUMBER.bit4)
	#define	ELSELR10_5	(elselr10.BIT_NUMBER.bit5)
	#define	ELSELR10_6	(elselr10.BIT_NUMBER.bit6)
	#define	ELSELR10_7	(elselr10.BIT_NUMBER.bit7)
	#define	ELSELR10	(elselr10.ALL)
#endif

/* ELSELR11 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR11;

SFR_GLOBAL	SFR_ELSELR11	elselr11;

#ifdef __RL78__
	#define	ELSELR11_0	(ELSELR11.0)
	#define	ELSELR11_1	(ELSELR11.1)
	#define	ELSELR11_2	(ELSELR11.2)
	#define	ELSELR11_3	(ELSELR11.3)
	#define	ELSELR11_4	(ELSELR11.4)
	#define	ELSELR11_5	(ELSELR11.5)
	#define	ELSELR11_6	(ELSELR11.6)
	#define	ELSELR11_7	(ELSELR11.7)
#else
	#define	ELSELR11_0	(elselr11.BIT_NUMBER.bit0)
	#define	ELSELR11_1	(elselr11.BIT_NUMBER.bit1)
	#define	ELSELR11_2	(elselr11.BIT_NUMBER.bit2)
	#define	ELSELR11_3	(elselr11.BIT_NUMBER.bit3)
	#define	ELSELR11_4	(elselr11.BIT_NUMBER.bit4)
	#define	ELSELR11_5	(elselr11.BIT_NUMBER.bit5)
	#define	ELSELR11_6	(elselr11.BIT_NUMBER.bit6)
	#define	ELSELR11_7	(elselr11.BIT_NUMBER.bit7)
	#define	ELSELR11	(elselr11.ALL)
#endif

/* ELSELR12 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR12;

