turatsamar/DRV8889/src/rl78_ca78k0r.h
SFR_GLOBAL	SFR_ELSELR12	elselr12;

#ifdef __RL78__
	#define	ELSELR12_0	(ELSELR12.0)
	#define	ELSELR12_1	(ELSELR12.1)
	#define	ELSELR12_2	(ELSELR12.2)
	#define	ELSELR12_3	(ELSELR12.3)
	#define	ELSELR12_4	(ELSELR12.4)
	#define	ELSELR12_5	(ELSELR12.5)
	#define	ELSELR12_6	(ELSELR12.6)
	#define	ELSELR12_7	(ELSELR12.7)
#else
	#define	ELSELR12_0	(elselr12.BIT_NUMBER.bit0)
	#define	ELSELR12_1	(elselr12.BIT_NUMBER.bit1)
	#define	ELSELR12_2	(elselr12.BIT_NUMBER.bit2)
	#define	ELSELR12_3	(elselr12.BIT_NUMBER.bit3)
	#define	ELSELR12_4	(elselr12.BIT_NUMBER.bit4)
	#define	ELSELR12_5	(elselr12.BIT_NUMBER.bit5)
	#define	ELSELR12_6	(elselr12.BIT_NUMBER.bit6)
	#define	ELSELR12_7	(elselr12.BIT_NUMBER.bit7)
	#define	ELSELR12	(elselr12.ALL)
#endif

/* ELSELR13 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR13;

SFR_GLOBAL	SFR_ELSELR13	elselr13;

#ifdef __RL78__
	#define	ELSELR13_0	(ELSELR13.0)
	#define	ELSELR13_1	(ELSELR13.1)
	#define	ELSELR13_2	(ELSELR13.2)
	#define	ELSELR13_3	(ELSELR13.3)
	#define	ELSELR13_4	(ELSELR13.4)
	#define	ELSELR13_5	(ELSELR13.5)
	#define	ELSELR13_6	(ELSELR13.6)
	#define	ELSELR13_7	(ELSELR13.7)
#else
	#define	ELSELR13_0	(elselr13.BIT_NUMBER.bit0)
	#define	ELSELR13_1	(elselr13.BIT_NUMBER.bit1)
	#define	ELSELR13_2	(elselr13.BIT_NUMBER.bit2)
	#define	ELSELR13_3	(elselr13.BIT_NUMBER.bit3)
	#define	ELSELR13_4	(elselr13.BIT_NUMBER.bit4)
	#define	ELSELR13_5	(elselr13.BIT_NUMBER.bit5)
	#define	ELSELR13_6	(elselr13.BIT_NUMBER.bit6)
	#define	ELSELR13_7	(elselr13.BIT_NUMBER.bit7)
	#define	ELSELR13	(elselr13.ALL)
#endif

/* ADTRGS1 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ADTRGS1;

SFR_GLOBAL	SFR_ADTRGS1	adtrgs1;

#ifdef __RL78__
	#define	ADTRGS1_0	(ADTRGS1.0)
	#define	ADTRGS1_1	(ADTRGS1.1)
	#define	ADTRGS1_2	(ADTRGS1.2)
	#define	ADTRGS1_3	(ADTRGS1.3)
	#define	ADTRGS1_4	(ADTRGS1.4)
	#define	ADTRGS1_5	(ADTRGS1.5)
	#define	ADTRGS1_6	(ADTRGS1.6)
	#define	ADTRGS1_7	(ADTRGS1.7)
#else
	#define	ADTRGS1_0	(adtrgs1.BIT_NUMBER.bit0)
	#define	ADTRGS1_1	(adtrgs1.BIT_NUMBER.bit1)
	#define	ADTRGS1_2	(adtrgs1.BIT_NUMBER.bit2)
	#define	ADTRGS1_3	(adtrgs1.BIT_NUMBER.bit3)
	#define	ADTRGS1_4	(adtrgs1.BIT_NUMBER.bit4)
	#define	ADTRGS1_5	(adtrgs1.BIT_NUMBER.bit5)
	#define	ADTRGS1_6	(adtrgs1.BIT_NUMBER.bit6)
	#define	ADTRGS1_7	(adtrgs1.BIT_NUMBER.bit7)
	#define	ADTRGS1	(adtrgs1.ALL)
#endif

/* ELSELR14 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR14;

SFR_GLOBAL	SFR_ELSELR14	elselr14;

#ifdef __RL78__
	#define	ELSELR14_0	(ELSELR14.0)
	#define	ELSELR14_1	(ELSELR14.1)
	#define	ELSELR14_2	(ELSELR14.2)
	#define	ELSELR14_3	(ELSELR14.3)
	#define	ELSELR14_4	(ELSELR14.4)
	#define	ELSELR14_5	(ELSELR14.5)
	#define	ELSELR14_6	(ELSELR14.6)
	#define	ELSELR14_7	(ELSELR14.7)
#else
	#define	ELSELR14_0	(elselr14.BIT_NUMBER.bit0)
	#define	ELSELR14_1	(elselr14.BIT_NUMBER.bit1)
	#define	ELSELR14_2	(elselr14.BIT_NUMBER.bit2)
	#define	ELSELR14_3	(elselr14.BIT_NUMBER.bit3)
	#define	ELSELR14_4	(elselr14.BIT_NUMBER.bit4)
	#define	ELSELR14_5	(elselr14.BIT_NUMBER.bit5)
	#define	ELSELR14_6	(elselr14.BIT_NUMBER.bit6)
	#define	ELSELR14_7	(elselr14.BIT_NUMBER.bit7)
	#define	ELSELR14	(elselr14.ALL)
#endif

/* ELSELR15 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR15;

SFR_GLOBAL	SFR_ELSELR15	elselr15;

#ifdef __RL78__
	#define	ELSELR15_0	(ELSELR15.0)
	#define	ELSELR15_1	(ELSELR15.1)
	#define	ELSELR15_2	(ELSELR15.2)
	#define	ELSELR15_3	(ELSELR15.3)
	#define	ELSELR15_4	(ELSELR15.4)
	#define	ELSELR15_5	(ELSELR15.5)
	#define	ELSELR15_6	(ELSELR15.6)
	#define	ELSELR15_7	(ELSELR15.7)
#else
	#define	ELSELR15_0	(elselr15.BIT_NUMBER.bit0)
	#define	ELSELR15_1	(elselr15.BIT_NUMBER.bit1)
	#define	ELSELR15_2	(elselr15.BIT_NUMBER.bit2)
	#define	ELSELR15_3	(elselr15.BIT_NUMBER.bit3)
	#define	ELSELR15_4	(elselr15.BIT_NUMBER.bit4)
	#define	ELSELR15_5	(elselr15.BIT_NUMBER.bit5)
	#define	ELSELR15_6	(elselr15.BIT_NUMBER.bit6)
	#define	ELSELR15_7	(elselr15.BIT_NUMBER.bit7)
	#define	ELSELR15	(elselr15.ALL)
#endif

/* ELSELR16 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR16;

SFR_GLOBAL	SFR_ELSELR16	elselr16;

#ifdef __RL78__
	#define	ELSELR16_0	(ELSELR16.0)
	#define	ELSELR16_1	(ELSELR16.1)
	#define	ELSELR16_2	(ELSELR16.2)
	#define	ELSELR16_3	(ELSELR16.3)
	#define	ELSELR16_4	(ELSELR16.4)
	#define	ELSELR16_5	(ELSELR16.5)
	#define	ELSELR16_6	(ELSELR16.6)
	#define	ELSELR16_7	(ELSELR16.7)
#else
	#define	ELSELR16_0	(elselr16.BIT_NUMBER.bit0)
	#define	ELSELR16_1	(elselr16.BIT_NUMBER.bit1)
	#define	ELSELR16_2	(elselr16.BIT_NUMBER.bit2)
	#define	ELSELR16_3	(elselr16.BIT_NUMBER.bit3)
	#define	ELSELR16_4	(elselr16.BIT_NUMBER.bit4)
	#define	ELSELR16_5	(elselr16.BIT_NUMBER.bit5)
	#define	ELSELR16_6	(elselr16.BIT_NUMBER.bit6)
	#define	ELSELR16_7	(elselr16.BIT_NUMBER.bit7)
	#define	ELSELR16	(elselr16.ALL)
#endif

/* ELSELR17 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR17;

SFR_GLOBAL	SFR_ELSELR17	elselr17;

#ifdef __RL78__
	#define	ELSELR17_0	(ELSELR17.0)
	#define	ELSELR17_1	(ELSELR17.1)
	#define	ELSELR17_2	(ELSELR17.2)
	#define	ELSELR17_3	(ELSELR17.3)
	#define	ELSELR17_4	(ELSELR17.4)
	#define	ELSELR17_5	(ELSELR17.5)
	#define	ELSELR17_6	(ELSELR17.6)
	#define	ELSELR17_7	(ELSELR17.7)
#else
	#define	ELSELR17_0	(elselr17.BIT_NUMBER.bit0)
	#define	ELSELR17_1	(elselr17.BIT_NUMBER.bit1)
	#define	ELSELR17_2	(elselr17.BIT_NUMBER.bit2)
	#define	ELSELR17_3	(elselr17.BIT_NUMBER.bit3)
	#define	ELSELR17_4	(elselr17.BIT_NUMBER.bit4)
	#define	ELSELR17_5	(elselr17.BIT_NUMBER.bit5)
	#define	ELSELR17_6	(elselr17.BIT_NUMBER.bit6)
	#define	ELSELR17_7	(elselr17.BIT_NUMBER.bit7)
	#define	ELSELR17	(elselr17.ALL)
#endif

/* ELSELR18 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR18;

SFR_GLOBAL	SFR_ELSELR18	elselr18;

#ifdef __RL78__
	#define	ELSELR18_0	(ELSELR18.0)
	#define	ELSELR18_1	(ELSELR18.1)
	#define	ELSELR18_2	(ELSELR18.2)
	#define	ELSELR18_3	(ELSELR18.3)
	#define	ELSELR18_4	(ELSELR18.4)
	#define	ELSELR18_5	(ELSELR18.5)
	#define	ELSELR18_6	(ELSELR18.6)
	#define	ELSELR18_7	(ELSELR18.7)
#else
	#define	ELSELR18_0	(elselr18.BIT_NUMBER.bit0)
	#define	ELSELR18_1	(elselr18.BIT_NUMBER.bit1)
	#define	ELSELR18_2	(elselr18.BIT_NUMBER.bit2)
	#define	ELSELR18_3	(elselr18.BIT_NUMBER.bit3)
	#define	ELSELR18_4	(elselr18.BIT_NUMBER.bit4)
	#define	ELSELR18_5	(elselr18.BIT_NUMBER.bit5)
	#define	ELSELR18_6	(elselr18.BIT_NUMBER.bit6)
	#define	ELSELR18_7	(elselr18.BIT_NUMBER.bit7)
	#define	ELSELR18	(elselr18.ALL)
#endif

/* ELSELR19 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR19;

SFR_GLOBAL	SFR_ELSELR19	elselr19;

#ifdef __RL78__
	#define	ELSELR19_0	(ELSELR19.0)
	#define	ELSELR19_1	(ELSELR19.1)
	#define	ELSELR19_2	(ELSELR19.2)
	#define	ELSELR19_3	(ELSELR19.3)
	#define	ELSELR19_4	(ELSELR19.4)
	#define	ELSELR19_5	(ELSELR19.5)
	#define	ELSELR19_6	(ELSELR19.6)
	#define	ELSELR19_7	(ELSELR19.7)
#else
	#define	ELSELR19_0	(elselr19.BIT_NUMBER.bit0)
	#define	ELSELR19_1	(elselr19.BIT_NUMBER.bit1)
	#define	ELSELR19_2	(elselr19.BIT_NUMBER.bit2)
	#define	ELSELR19_3	(elselr19.BIT_NUMBER.bit3)
	#define	ELSELR19_4	(elselr19.BIT_NUMBER.bit4)
	#define	ELSELR19_5	(elselr19.BIT_NUMBER.bit5)
	#define	ELSELR19_6	(elselr19.BIT_NUMBER.bit6)
	#define	ELSELR19_7	(elselr19.BIT_NUMBER.bit7)
	#define	ELSELR19	(elselr19.ALL)
#endif

