turatsamar/DRV8889/src/rl78_ca78k0r.h
/* ELSELR20 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR20;

SFR_GLOBAL	SFR_ELSELR20	elselr20;

#ifdef __RL78__
	#define	ELSELR20_0	(ELSELR20.0)
	#define	ELSELR20_1	(ELSELR20.1)
	#define	ELSELR20_2	(ELSELR20.2)
	#define	ELSELR20_3	(ELSELR20.3)
	#define	ELSELR20_4	(ELSELR20.4)
	#define	ELSELR20_5	(ELSELR20.5)
	#define	ELSELR20_6	(ELSELR20.6)
	#define	ELSELR20_7	(ELSELR20.7)
#else
	#define	ELSELR20_0	(elselr20.BIT_NUMBER.bit0)
	#define	ELSELR20_1	(elselr20.BIT_NUMBER.bit1)
	#define	ELSELR20_2	(elselr20.BIT_NUMBER.bit2)
	#define	ELSELR20_3	(elselr20.BIT_NUMBER.bit3)
	#define	ELSELR20_4	(elselr20.BIT_NUMBER.bit4)
	#define	ELSELR20_5	(elselr20.BIT_NUMBER.bit5)
	#define	ELSELR20_6	(elselr20.BIT_NUMBER.bit6)
	#define	ELSELR20_7	(elselr20.BIT_NUMBER.bit7)
	#define	ELSELR20	(elselr20.ALL)
#endif

/* ELSELR21 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR21;

SFR_GLOBAL	SFR_ELSELR21	elselr21;

#ifdef __RL78__
	#define	ELSELR21_0	(ELSELR21.0)
	#define	ELSELR21_1	(ELSELR21.1)
	#define	ELSELR21_2	(ELSELR21.2)
	#define	ELSELR21_3	(ELSELR21.3)
	#define	ELSELR21_4	(ELSELR21.4)
	#define	ELSELR21_5	(ELSELR21.5)
	#define	ELSELR21_6	(ELSELR21.6)
	#define	ELSELR21_7	(ELSELR21.7)
#else
	#define	ELSELR21_0	(elselr21.BIT_NUMBER.bit0)
	#define	ELSELR21_1	(elselr21.BIT_NUMBER.bit1)
	#define	ELSELR21_2	(elselr21.BIT_NUMBER.bit2)
	#define	ELSELR21_3	(elselr21.BIT_NUMBER.bit3)
	#define	ELSELR21_4	(elselr21.BIT_NUMBER.bit4)
	#define	ELSELR21_5	(elselr21.BIT_NUMBER.bit5)
	#define	ELSELR21_6	(elselr21.BIT_NUMBER.bit6)
	#define	ELSELR21_7	(elselr21.BIT_NUMBER.bit7)
	#define	ELSELR21	(elselr21.ALL)
#endif

/* ELSELR22 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR22;

SFR_GLOBAL	SFR_ELSELR22	elselr22;

#ifdef __RL78__
	#define	ELSELR22_0	(ELSELR22.0)
	#define	ELSELR22_1	(ELSELR22.1)
	#define	ELSELR22_2	(ELSELR22.2)
	#define	ELSELR22_3	(ELSELR22.3)
	#define	ELSELR22_4	(ELSELR22.4)
	#define	ELSELR22_5	(ELSELR22.5)
	#define	ELSELR22_6	(ELSELR22.6)
	#define	ELSELR22_7	(ELSELR22.7)
#else
	#define	ELSELR22_0	(elselr22.BIT_NUMBER.bit0)
	#define	ELSELR22_1	(elselr22.BIT_NUMBER.bit1)
	#define	ELSELR22_2	(elselr22.BIT_NUMBER.bit2)
	#define	ELSELR22_3	(elselr22.BIT_NUMBER.bit3)
	#define	ELSELR22_4	(elselr22.BIT_NUMBER.bit4)
	#define	ELSELR22_5	(elselr22.BIT_NUMBER.bit5)
	#define	ELSELR22_6	(elselr22.BIT_NUMBER.bit6)
	#define	ELSELR22_7	(elselr22.BIT_NUMBER.bit7)
	#define	ELSELR22	(elselr22.ALL)
#endif

/* ELSELR23 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR23;

SFR_GLOBAL	SFR_ELSELR23	elselr23;

#ifdef __RL78__
	#define	ELSELR23_0	(ELSELR23.0)
	#define	ELSELR23_1	(ELSELR23.1)
	#define	ELSELR23_2	(ELSELR23.2)
	#define	ELSELR23_3	(ELSELR23.3)
	#define	ELSELR23_4	(ELSELR23.4)
	#define	ELSELR23_5	(ELSELR23.5)
	#define	ELSELR23_6	(ELSELR23.6)
	#define	ELSELR23_7	(ELSELR23.7)
#else
	#define	ELSELR23_0	(elselr23.BIT_NUMBER.bit0)
	#define	ELSELR23_1	(elselr23.BIT_NUMBER.bit1)
	#define	ELSELR23_2	(elselr23.BIT_NUMBER.bit2)
	#define	ELSELR23_3	(elselr23.BIT_NUMBER.bit3)
	#define	ELSELR23_4	(elselr23.BIT_NUMBER.bit4)
	#define	ELSELR23_5	(elselr23.BIT_NUMBER.bit5)
	#define	ELSELR23_6	(elselr23.BIT_NUMBER.bit6)
	#define	ELSELR23_7	(elselr23.BIT_NUMBER.bit7)
	#define	ELSELR23	(elselr23.ALL)
#endif

/* ELSELR24 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR24;

SFR_GLOBAL	SFR_ELSELR24	elselr24;

#ifdef __RL78__
	#define	ELSELR24_0	(ELSELR24.0)
	#define	ELSELR24_1	(ELSELR24.1)
	#define	ELSELR24_2	(ELSELR24.2)
	#define	ELSELR24_3	(ELSELR24.3)
	#define	ELSELR24_4	(ELSELR24.4)
	#define	ELSELR24_5	(ELSELR24.5)
	#define	ELSELR24_6	(ELSELR24.6)
	#define	ELSELR24_7	(ELSELR24.7)
#else
	#define	ELSELR24_0	(elselr24.BIT_NUMBER.bit0)
	#define	ELSELR24_1	(elselr24.BIT_NUMBER.bit1)
	#define	ELSELR24_2	(elselr24.BIT_NUMBER.bit2)
	#define	ELSELR24_3	(elselr24.BIT_NUMBER.bit3)
	#define	ELSELR24_4	(elselr24.BIT_NUMBER.bit4)
	#define	ELSELR24_5	(elselr24.BIT_NUMBER.bit5)
	#define	ELSELR24_6	(elselr24.BIT_NUMBER.bit6)
	#define	ELSELR24_7	(elselr24.BIT_NUMBER.bit7)
	#define	ELSELR24	(elselr24.ALL)
#endif

/* ELSELR25 */
typedef union{
	SFR_BIT8	BIT_NUMBER;
	SFR_UNSIGNED_CHAR	ALL;
}SFR_ELSELR25;

SFR_GLOBAL	SFR_ELSELR25	elselr25;

#ifdef __RL78__
	#define	ELSELR25_0	(ELSELR25.0)
	#define	ELSELR25_1	(ELSELR25.1)
	#define	ELSELR25_2	(ELSELR25.2)
	#define	ELSELR25_3	(ELSELR25.3)
	#define	ELSELR25_4	(ELSELR25.4)
	#define	ELSELR25_5	(ELSELR25.5)
	#define	ELSELR25_6	(ELSELR25.6)
	#define	ELSELR25_7	(ELSELR25.7)
#else
	#define	ELSELR25_0	(elselr25.BIT_NUMBER.bit0)
	#define	ELSELR25_1	(elselr25.BIT_NUMBER.bit1)
	#define	ELSELR25_2	(elselr25.BIT_NUMBER.bit2)
	#define	ELSELR25_3	(elselr25.BIT_NUMBER.bit3)
	#define	ELSELR25_4	(elselr25.BIT_NUMBER.bit4)
	#define	ELSELR25_5	(elselr25.BIT_NUMBER.bit5)
	#define	ELSELR25_6	(elselr25.BIT_NUMBER.bit6)
	#define	ELSELR25_7	(elselr25.BIT_NUMBER.bit7)
	#define	ELSELR25	(elselr25.ALL)
#endif

/* 16進数表現,CPU制御命令,DI/EI命令の置換を追加 20150715 kurokawa */
/******************************************************************************/
/*                       2進表現を16進表現に変換                              */
/******************************************************************************/

	/* 1 bit */
	#define	b0		(0x00)	/* 0 */
	#define	b1		(0x01)	/* 1 */

	/* 2 bit */
	#define	b00		(0x00)	/* 0 */
	#define	b01		(0x01)	/* 1 */
	#define	b10		(0x02)	/* 2 */
	#define	b11		(0x03)	/* 3 */

	/*  3bit */
	#define	b000	(0x00)	/* 0 */
	#define	b001	(0x01)	/* 1 */
	#define	b010	(0x02)	/* 2 */
	#define	b011	(0x03)	/* 3 */
	#define	b100	(0x04)	/* 4 */
	#define	b101	(0x05)	/* 5 */
	#define	b110	(0x06)	/* 6 */
	#define	b111	(0x07)	/* 7 */

	/*  4bit */
	#define	b0000	(0x00)	/* 0 */
	#define	b0001	(0x01)	/* 1 */
	#define	b0010	(0x02)	/* 2 */
	#define	b0011	(0x03)	/* 3 */
	#define	b0100	(0x04)	/* 4 */
	#define	b0101	(0x05)	/* 5 */
	#define	b0110	(0x06)	/* 6 */
	#define	b0111	(0x07)	/* 7 */
	#define	b1000	(0x08)	/* 8 */
	#define	b1001	(0x09)	/* 9 */
	#define	b1010	(0x0A)	/* 10 */
	#define	b1011	(0x0B)	/* 11 */
	#define	b1100	(0x0C)	/* 12 */
	#define	b1101	(0x0D)	/* 13 */
	#define	b1110	(0x0E)	/* 14 */
	#define	b1111	(0x0F)	/* 15 */

	/*  5bit */
	#define	b00000	(0x00)	/* 0 */
	#define	b00001	(0x01)	/* 1 */
	#define	b00010	(0x02)	/* 2 */
	#define	b00011	(0x03)	/* 3 */
	#define	b00100	(0x04)	/* 4 */
	#define	b00101	(0x05)	/* 5 */
	#define	b00110	(0x06)	/* 6 */
	#define	b00111	(0x07)	/* 7 */
	#define	b01000	(0x08)	/* 8 */
	#define	b01001	(0x09)	/* 9 */
	#define	b01010	(0x0A)	/* 10 */
	#define	b01011	(0x0B)	/* 11 */
	#define	b01100	(0x0C)	/* 12 */
	#define	b01101	(0x0D)	/* 13 */
	#define	b01110	(0x0E)	/* 14 */
	#define	b01111	(0x0F)	/* 15 */
	#define	b10000	(0x10)	/* 16 */
	#define	b10001	(0x11)	/* 17 */
	#define	b10010	(0x12)	/* 18 */
	#define	b10011	(0x13)	/* 19 */
	#define	b10100	(0x14)	/* 20 */
	#define	b10101	(0x15)	/* 21 */
	#define	b10110	(0x16)	/* 22 */
	#define	b10111	(0x17)	/* 23 */
	#define	b11000	(0x18)	/* 24 */
	#define	b11001	(0x19)	/* 25 */
	#define	b11010	(0x1A)	/* 26 */
	#define	b11011	(0x1B)	/* 27 */
	#define	b11100	(0x1C)	/* 28 */
	#define	b11101	(0x1D)	/* 29 */
	#define	b11110	(0x1E)	/* 30 */
	#define	b11111	(0x1F)	/* 31 */

	/*  6bit */
	#define	b000000	(0x00)	/* 0 */
	#define	b000001	(0x01)	/* 1 */
	#define	b000010	(0x02)	/* 2 */
	#define	b000011	(0x03)	/* 3 */
	#define	b000100	(0x04)	/* 4 */
	#define	b000101	(0x05)	/* 5 */
	#define	b000110	(0x06)	/* 6 */
	#define	b000111	(0x07)	/* 7 */
	#define	b001000	(0x08)	/* 8 */
	#define	b001001	(0x09)	/* 9 */
	#define	b001010	(0x0A)	/* 10 */
	#define	b001011	(0x0B)	/* 11 */
	#define	b001100	(0x0C)	/* 12 */
	#define	b001101	(0x0D)	/* 13 */
	#define	b001110	(0x0E)	/* 14 */
	#define	b001111	(0x0F)	/* 15 */
	#define	b010000	(0x10)	/* 16 */
	#define	b010001	(0x11)	/* 17 */
	#define	b010010	(0x12)	/* 18 */
	#define	b010011	(0x13)	/* 19 */
	#define	b010100	(0x14)	/* 20 */
	#define	b010101	(0x15)	/* 21 */
	#define	b010110	(0x16)	/* 22 */
	#define	b010111	(0x17)	/* 23 */
	#define	b011000	(0x18)	/* 24 */
	#define	b011001	(0x19)	/* 25 */
	#define	b011010	(0x1A)	/* 26 */
	#define	b011011	(0x1B)	/* 27 */
	#define	b011100	(0x1C)	/* 28 */
	#define	b011101	(0x1D)	/* 29 */
	#define	b011110	(0x1E)	/* 30 */
	#define	b011111	(0x1F)	/* 31 */
	#define	b100000	(0x20)	/* 32 */
	#define	b100001	(0x21)	/* 33 */
	#define	b100010	(0x22)	/* 34 */
	#define	b100011	(0x23)	/* 35 */
	#define	b100100	(0x24)	/* 36 */
	#define	b100101	(0x25)	/* 37 */
	#define	b100110	(0x26)	/* 38 */
	#define	b100111	(0x27)	/* 39 */
	#define	b101000	(0x28)	/* 40 */
	#define	b101001	(0x29)	/* 41 */
	#define	b101010	(0x2A)	/* 42 */
	#define	b101011	(0x2B)	/* 43 */
	#define	b101100	(0x2C)	/* 44 */
	#define	b101101	(0x2D)	/* 45 */
	#define	b101110	(0x2E)	/* 46 */
	#define	b101111	(0x2F)	/* 47 */
	#define	b110000	(0x30)	/* 48 */
	#define	b110001	(0x31)	/* 49 */
	#define	b110010	(0x32)	/* 50 */
	#define	b110011	(0x33)	/* 51 */
	#define	b110100	(0x34)	/* 52 */
	#define	b110101	(0x35)	/* 53 */
	#define	b110110	(0x36)	/* 54 */
	#define	b110111	(0x37)	/* 55 */
	#define	b111000	(0x38)	/* 56 */
	#define	b111001	(0x39)	/* 57 */
	#define	b111010	(0x3A)	/* 58 */
	#define	b111011	(0x3B)	/* 59 */
	#define	b111100	(0x3C)	/* 60 */
	#define	b111101	(0x3D)	/* 61 */
	#define	b111110	(0x3E)	/* 62 */
	#define	b111111	(0x3F)	/* 63 */

	/*  7bit */
	#define	b0000000	(0x00)	/* 0 */
	#define	b0000001	(0x01)	/* 1 */
	#define	b0000010	(0x02)	/* 2 */
	#define	b0000011	(0x03)	/* 3 */
	#define	b0000100	(0x04)	/* 4 */
	#define	b0000101	(0x05)	/* 5 */
	#define	b0000110	(0x06)	/* 6 */
	#define	b0000111	(0x07)	/* 7 */
	#define	b0001000	(0x08)	/* 8 */
	#define	b0001001	(0x09)	/* 9 */
	#define	b0001010	(0x0A)	/* 10 */
	#define	b0001011	(0x0B)	/* 11 */
	#define	b0001100	(0x0C)	/* 12 */
	#define	b0001101	(0x0D)	/* 13 */
	#define	b0001110	(0x0E)	/* 14 */
	#define	b0001111	(0x0F)	/* 15 */
	#define	b0010000	(0x10)	/* 16 */
	#define	b0010001	(0x11)	/* 17 */
	#define	b0010010	(0x12)	/* 18 */
	#define	b0010011	(0x13)	/* 19 */
	#define	b0010100	(0x14)	/* 20 */
	#define	b0010101	(0x15)	/* 21 */
	#define	b0010110	(0x16)	/* 22 */
	#define	b0010111	(0x17)	/* 23 */
	#define	b0011000	(0x18)	/* 24 */
	#define	b0011001	(0x19)	/* 25 */
	#define	b0011010	(0x1A)	/* 26 */
	#define	b0011011	(0x1B)	/* 27 */
	#define	b0011100	(0x1C)	/* 28 */
	#define	b0011101	(0x1D)	/* 29 */
	#define	b0011110	(0x1E)	/* 30 */
	#define	b0011111	(0x1F)	/* 31 */
	#define	b0100000	(0x20)	/* 32 */
	#define	b0100001	(0x21)	/* 33 */
	#define	b0100010	(0x22)	/* 34 */
	#define	b0100011	(0x23)	/* 35 */
	#define	b0100100	(0x24)	/* 36 */
	#define	b0100101	(0x25)	/* 37 */
	#define	b0100110	(0x26)	/* 38 */
	#define	b0100111	(0x27)	/* 39 */
	#define	b0101000	(0x28)	/* 40 */
	#define	b0101001	(0x29)	/* 41 */
	#define	b0101010	(0x2A)	/* 42 */
	#define	b0101011	(0x2B)	/* 43 */
	#define	b0101100	(0x2C)	/* 44 */
	#define	b0101101	(0x2D)	/* 45 */
	#define	b0101110	(0x2E)	/* 46 */
	#define	b0101111	(0x2F)	/* 47 */
	#define	b0110000	(0x30)	/* 48 */
	#define	b0110001	(0x31)	/* 49 */
	#define	b0110010	(0x32)	/* 50 */
	#define	b0110011	(0x33)	/* 51 */
	#define	b0110100	(0x34)	/* 52 */
	#define	b0110101	(0x35)	/* 53 */
	#define	b0110110	(0x36)	/* 54 */
	#define	b0110111	(0x37)	/* 55 */
	#define	b0111000	(0x38)	/* 56 */
	#define	b0111001	(0x39)	/* 57 */
	#define	b0111010	(0x3A)	/* 58 */
	#define	b0111011	(0x3B)	/* 59 */
	#define	b0111100	(0x3C)	/* 60 */
	#define	b0111101	(0x3D)	/* 61 */
	#define	b0111110	(0x3E)	/* 62 */
	#define	b0111111	(0x3F)	/* 63 */
	#define	b1000000	(0x40)	/* 64 */
	#define	b1000001	(0x41)	/* 65 */
	#define	b1000010	(0x42)	/* 66 */
	#define	b1000011	(0x43)	/* 67 */
	#define	b1000100	(0x44)	/* 68 */
	#define	b1000101	(0x45)	/* 69 */
	#define	b1000110	(0x46)	/* 70 */
	#define	b1000111	(0x47)	/* 71 */
	#define	b1001000	(0x48)	/* 72 */
	#define	b1001001	(0x49)	/* 73 */
	#define	b1001010	(0x4A)	/* 74 */
	#define	b1001011	(0x4B)	/* 75 */
	#define	b1001100	(0x4C)	/* 76 */
	#define	b1001101	(0x4D)	/* 77 */
	#define	b1001110	(0x4E)	/* 78 */
	#define	b1001111	(0x4F)	/* 79 */
	#define	b1010000	(0x50)	/* 80 */
	#define	b1010001	(0x51)	/* 81 */
	#define	b1010010	(0x52)	/* 82 */
	#define	b1010011	(0x53)	/* 83 */
	#define	b1010100	(0x54)	/* 84 */
	#define	b1010101	(0x55)	/* 85 */
	#define	b1010110	(0x56)	/* 86 */
	#define	b1010111	(0x57)	/* 87 */
	#define	b1011000	(0x58)	/* 88 */
	#define	b1011001	(0x59)	/* 89 */
	#define	b1011010	(0x5A)	/* 90 */
	#define	b1011011	(0x5B)	/* 91 */
	#define	b1011100	(0x5C)	/* 92 */
	#define	b1011101	(0x5D)	/* 93 */
	#define	b1011110	(0x5E)	/* 94 */
	#define	b1011111	(0x5F)	/* 95 */
	#define	b1100000	(0x60)	/* 96 */
	#define	b1100001	(0x61)	/* 97 */
	#define	b1100010	(0x62)	/* 98 */
	#define	b1100011	(0x63)	/* 99 */
	#define	b1100100	(0x64)	/* 100 */
	#define	b1100101	(0x65)	/* 101 */
	#define	b1100110	(0x66)	/* 102 */
	#define	b1100111	(0x67)	/* 103 */
	#define	b1101000	(0x68)	/* 104 */
	#define	b1101001	(0x69)	/* 105 */
	#define	b1101010	(0x6A)	/* 106 */
	#define	b1101011	(0x6B)	/* 107 */
	#define	b1101100	(0x6C)	/* 108 */
	#define	b1101101	(0x6D)	/* 109 */
	#define	b1101110	(0x6E)	/* 110 */
	#define	b1101111	(0x6F)	/* 111 */
	#define	b1110000	(0x70)	/* 112 */
	#define	b1110001	(0x71)	/* 113 */
	#define	b1110010	(0x72)	/* 114 */
	#define	b1110011	(0x73)	/* 115 */
	#define	b1110100	(0x74)	/* 116 */
	#define	b1110101	(0x75)	/* 117 */
	#define	b1110110	(0x76)	/* 118 */
	#define	b1110111	(0x77)	/* 119 */
	#define	b1111000	(0x78)	/* 120 */
	#define	b1111001	(0x79)	/* 121 */
	#define	b1111010	(0x7A)	/* 122 */
	#define	b1111011	(0x7B)	/* 123 */
	#define	b1111100	(0x7C)	/* 124 */
	#define	b1111101	(0x7D)	/* 125 */
	#define	b1111110	(0x7E)	/* 126 */
	#define	b1111111	(0x7F)	/* 127 */

	/*  8bit */
	#define	b00000000	(0x00)	/* 0 */
	#define	b00000001	(0x01)	/* 1 */
	#define	b00000010	(0x02)	/* 2 */
	#define	b00000011	(0x03)	/* 3 */
	#define	b00000100	(0x04)	/* 4 */
	#define	b00000101	(0x05)	/* 5 */
	#define	b00000110	(0x06)	/* 6 */
	#define	b00000111	(0x07)	/* 7 */
	#define	b00001000	(0x08)	/* 8 */
	#define	b00001001	(0x09)	/* 9 */
	#define	b00001010	(0x0A)	/* 10 */
	#define	b00001011	(0x0B)	/* 11 */
	#define	b00001100	(0x0C)	/* 12 */
	#define	b00001101	(0x0D)	/* 13 */
	#define	b00001110	(0x0E)	/* 14 */
	#define	b00001111	(0x0F)	/* 15 */
	#define	b00010000	(0x10)	/* 16 */
	#define	b00010001	(0x11)	/* 17 */
	#define	b00010010	(0x12)	/* 18 */
	#define	b00010011	(0x13)	/* 19 */
	#define	b00010100	(0x14)	/* 20 */
	#define	b00010101	(0x15)	/* 21 */
	#define	b00010110	(0x16)	/* 22 */
	#define	b00010111	(0x17)	/* 23 */
	#define	b00011000	(0x18)	/* 24 */
	#define	b00011001	(0x19)	/* 25 */
	#define	b00011010	(0x1A)	/* 26 */
	#define	b00011011	(0x1B)	/* 27 */
	#define	b00011100	(0x1C)	/* 28 */
	#define	b00011101	(0x1D)	/* 29 */
	#define	b00011110	(0x1E)	/* 30 */
	#define	b00011111	(0x1F)	/* 31 */
	#define	b00100000	(0x20)	/* 32 */
	#define	b00100001	(0x21)	/* 33 */
	#define	b00100010	(0x22)	/* 34 */
	#define	b00100011	(0x23)	/* 35 */
	#define	b00100100	(0x24)	/* 36 */
	#define	b00100101	(0x25)	/* 37 */
	#define	b00100110	(0x26)	/* 38 */
	#define	b00100111	(0x27)	/* 39 */
	#define	b00101000	(0x28)	/* 40 */
	#define	b00101001	(0x29)	/* 41 */
	#define	b00101010	(0x2A)	/* 42 */
	#define	b00101011	(0x2B)	/* 43 */
	#define	b00101100	(0x2C)	/* 44 */
	#define	b00101101	(0x2D)	/* 45 */
	#define	b00101110	(0x2E)	/* 46 */
	#define	b00101111	(0x2F)	/* 47 */
	#define	b00110000	(0x30)	/* 48 */
	#define	b00110001	(0x31)	/* 49 */
	#define	b00110010	(0x32)	/* 50 */
	#define	b00110011	(0x33)	/* 51 */
	#define	b00110100	(0x34)	/* 52 */
	#define	b00110101	(0x35)	/* 53 */
	#define	b00110110	(0x36)	/* 54 */
	#define	b00110111	(0x37)	/* 55 */
	#define	b00111000	(0x38)	/* 56 */
	#define	b00111001	(0x39)	/* 57 */
	#define	b00111010	(0x3A)	/* 58 */
	#define	b00111011	(0x3B)	/* 59 */
	#define	b00111100	(0x3C)	/* 60 */
	#define	b00111101	(0x3D)	/* 61 */
	#define	b00111110	(0x3E)	/* 62 */
	#define	b00111111	(0x3F)	/* 63 */
	#define	b01000000	(0x40)	/* 64 */
	#define	b01000001	(0x41)	/* 65 */
	#define	b01000010	(0x42)	/* 66 */
	#define	b01000011	(0x43)	/* 67 */
	#define	b01000100	(0x44)	/* 68 */
	#define	b01000101	(0x45)	/* 69 */
	#define	b01000110	(0x46)	/* 70 */
	#define	b01000111	(0x47)	/* 71 */
	#define	b01001000	(0x48)	/* 72 */
	#define	b01001001	(0x49)	/* 73 */
	#define	b01001010	(0x4A)	/* 74 */
	#define	b01001011	(0x4B)	/* 75 */
	#define	b01001100	(0x4C)	/* 76 */
	#define	b01001101	(0x4D)	/* 77 */
	#define	b01001110	(0x4E)	/* 78 */
	#define	b01001111	(0x4F)	/* 79 */
	#define	b01010000	(0x50)	/* 80 */
	#define	b01010001	(0x51)	/* 81 */
	#define	b01010010	(0x52)	/* 82 */
	#define	b01010011	(0x53)	/* 83 */
	#define	b01010100	(0x54)	/* 84 */
	#define	b01010101	(0x55)	/* 85 */
	#define	b01010110	(0x56)	/* 86 */
	#define	b01010111	(0x57)	/* 87 */
	#define	b01011000	(0x58)	/* 88 */
	#define	b01011001	(0x59)	/* 89 */
	#define	b01011010	(0x5A)	/* 90 */
	#define	b01011011	(0x5B)	/* 91 */
	#define	b01011100	(0x5C)	/* 92 */
	#define	b01011101	(0x5D)	/* 93 */
	#define	b01011110	(0x5E)	/* 94 */
	#define	b01011111	(0x5F)	/* 95 */
	#define	b01100000	(0x60)	/* 96 */
	#define	b01100001	(0x61)	/* 97 */
	#define	b01100010	(0x62)	/* 98 */
	#define	b01100011	(0x63)	/* 99 */
	#define	b01100100	(0x64)	/* 100 */
	#define	b01100101	(0x65)	/* 101 */
	#define	b01100110	(0x66)	/* 102 */
	#define	b01100111	(0x67)	/* 103 */
	#define	b01101000	(0x68)	/* 104 */
	#define	b01101001	(0x69)	/* 105 */
	#define	b01101010	(0x6A)	/* 106 */
	#define	b01101011	(0x6B)	/* 107 */
	#define	b01101100	(0x6C)	/* 108 */
	#define	b01101101	(0x6D)	/* 109 */
	#define	b01101110	(0x6E)	/* 110 */
	#define	b01101111	(0x6F)	/* 111 */
	#define	b01110000	(0x70)	/* 112 */
	#define	b01110001	(0x71)	/* 113 */
	#define	b01110010	(0x72)	/* 114 */
	#define	b01110011	(0x73)	/* 115 */
	#define	b01110100	(0x74)	/* 116 */
	#define	b01110101	(0x75)	/* 117 */
	#define	b01110110	(0x76)	/* 118 */
	#define	b01110111	(0x77)	/* 119 */
	#define	b01111000	(0x78)	/* 120 */
	#define	b01111001	(0x79)	/* 121 */
	#define	b01111010	(0x7A)	/* 122 */
	#define	b01111011	(0x7B)	/* 123 */
	#define	b01111100	(0x7C)	/* 124 */
	#define	b01111101	(0x7D)	/* 125 */
	#define	b01111110	(0x7E)	/* 126 */
	#define	b01111111	(0x7F)	/* 127 */
	#define	b10000000	(0x80)	/* 128 */
	#define	b10000001	(0x81)	/* 129 */
	#define	b10000010	(0x82)	/* 130 */
	#define	b10000011	(0x83)	/* 131 */
	#define	b10000100	(0x84)	/* 132 */
	#define	b10000101	(0x85)	/* 133 */
	#define	b10000110	(0x86)	/* 134 */
	#define	b10000111	(0x87)	/* 135 */
	#define	b10001000	(0x88)	/* 136 */
	#define	b10001001	(0x89)	/* 137 */
	#define	b10001010	(0x8A)	/* 138 */
	#define	b10001011	(0x8B)	/* 139 */
	#define	b10001100	(0x8C)	/* 140 */
	#define	b10001101	(0x8D)	/* 141 */
	#define	b10001110	(0x8E)	/* 142 */
	#define	b10001111	(0x8F)	/* 143 */
	#define	b10010000	(0x90)	/* 144 */
	#define	b10010001	(0x91)	/* 145 */
	#define	b10010010	(0x92)	/* 146 */
	#define	b10010011	(0x93)	/* 147 */
	#define	b10010100	(0x94)	/* 148 */
	#define	b10010101	(0x95)	/* 149 */
	#define	b10010110	(0x96)	/* 150 */
	#define	b10010111	(0x97)	/* 151 */
	#define	b10011000	(0x98)	/* 152 */
	#define	b10011001	(0x99)	/* 153 */
	#define	b10011010	(0x9A)	/* 154 */
	#define	b10011011	(0x9B)	/* 155 */
	#define	b10011100	(0x9C)	/* 156 */
	#define	b10011101	(0x9D)	/* 157 */
	#define	b10011110	(0x9E)	/* 158 */
	#define	b10011111	(0x9F)	/* 159 */
	#define	b10100000	(0xA0)	/* 160 */
	#define	b10100001	(0xA1)	/* 161 */
	#define	b10100010	(0xA2)	/* 162 */
	#define	b10100011	(0xA3)	/* 163 */
	#define	b10100100	(0xA4)	/* 164 */
	#define	b10100101	(0xA5)	/* 165 */
	#define	b10100110	(0xA6)	/* 166 */
	#define	b10100111	(0xA7)	/* 167 */
	#define	b10101000	(0xA8)	/* 168 */
	#define	b10101001	(0xA9)	/* 169 */
	#define	b10101010	(0xAA)	/* 170 */
	#define	b10101011	(0xAB)	/* 171 */
	#define	b10101100	(0xAC)	/* 172 */
	#define	b10101101	(0xAD)	/* 173 */
	#define	b10101110	(0xAE)	/* 174 */
	#define	b10101111	(0xAF)	/* 175 */
	#define	b10110000	(0xB0)	/* 176 */
	#define	b10110001	(0xB1)	/* 177 */
	#define	b10110010	(0xB2)	/* 178 */
	#define	b10110011	(0xB3)	/* 179 */
	#define	b10110100	(0xB4)	/* 180 */
	#define	b10110101	(0xB5)	/* 181 */
	#define	b10110110	(0xB6)	/* 182 */
	#define	b10110111	(0xB7)	/* 183 */
	#define	b10111000	(0xB8)	/* 184 */
	#define	b10111001	(0xB9)	/* 185 */
	#define	b10111010	(0xBA)	/* 186 */
	#define	b10111011	(0xBB)	/* 187 */
	#define	b10111100	(0xBC)	/* 188 */
	#define	b10111101	(0xBD)	/* 189 */
	#define	b10111110	(0xBE)	/* 190 */
	#define	b10111111	(0xBF)	/* 191 */
	#define	b11000000	(0xC0)	/* 192 */
	#define	b11000001	(0xC1)	/* 193 */
	#define	b11000010	(0xC2)	/* 194 */
	#define	b11000011	(0xC3)	/* 195 */
	#define	b11000100	(0xC4)	/* 196 */
	#define	b11000101	(0xC5)	/* 197 */
	#define	b11000110	(0xC6)	/* 198 */
	#define	b11000111	(0xC7)	/* 199 */
	#define	b11001000	(0xC8)	/* 200 */
	#define	b11001001	(0xC9)	/* 201 */
	#define	b11001010	(0xCA)	/* 202 */
	#define	b11001011	(0xCB)	/* 203 */
	#define	b11001100	(0xCC)	/* 204 */
	#define	b11001101	(0xCD)	/* 205 */
	#define	b11001110	(0xCE)	/* 206 */
	#define	b11001111	(0xCF)	/* 207 */
	#define	b11010000	(0xD0)	/* 208 */
	#define	b11010001	(0xD1)	/* 209 */
	#define	b11010010	(0xD2)	/* 210 */
	#define	b11010011	(0xD3)	/* 211 */
	#define	b11010100	(0xD4)	/* 212 */
	#define	b11010101	(0xD5)	/* 213 */
	#define	b11010110	(0xD6)	/* 214 */
	#define	b11010111	(0xD7)	/* 215 */
	#define	b11011000	(0xD8)	/* 216 */
	#define	b11011001	(0xD9)	/* 217 */
	#define	b11011010	(0xDA)	/* 218 */
	#define	b11011011	(0xDB)	/* 219 */
	#define	b11011100	(0xDC)	/* 220 */
	#define	b11011101	(0xDD)	/* 221 */
	#define	b11011110	(0xDE)	/* 222 */
	#define	b11011111	(0xDF)	/* 223 */
	#define	b11100000	(0xE0)	/* 224 */
	#define	b11100001	(0xE1)	/* 225 */
	#define	b11100010	(0xE2)	/* 226 */
	#define	b11100011	(0xE3)	/* 227 */
	#define	b11100100	(0xE4)	/* 228 */
	#define	b11100101	(0xE5)	/* 229 */
	#define	b11100110	(0xE6)	/* 230 */
	#define	b11100111	(0xE7)	/* 231 */
	#define	b11101000	(0xE8)	/* 232 */
	#define	b11101001	(0xE9)	/* 233 */
	#define	b11101010	(0xEA)	/* 234 */
	#define	b11101011	(0xEB)	/* 235 */
	#define	b11101100	(0xEC)	/* 236 */
	#define	b11101101	(0xED)	/* 237 */
	#define	b11101110	(0xEE)	/* 238 */
	#define	b11101111	(0xEF)	/* 239 */
	#define	b11110000	(0xF0)	/* 240 */
	#define	b11110001	(0xF1)	/* 241 */
	#define	b11110010	(0xF2)	/* 242 */
	#define	b11110011	(0xF3)	/* 243 */
	#define	b11110100	(0xF4)	/* 244 */
	#define	b11110101	(0xF5)	/* 245 */
	#define	b11110110	(0xF6)	/* 246 */
	#define	b11110111	(0xF7)	/* 247 */
	#define	b11111000	(0xF8)	/* 248 */
	#define	b11111001	(0xF9)	/* 249 */
	#define	b11111010	(0xFA)	/* 250 */
	#define	b11111011	(0xFB)	/* 251 */
	#define	b11111100	(0xFC)	/* 252 */
	#define	b11111101	(0xFD)	/* 253 */
	#define	b11111110	(0xFE)	/* 254 */
	#define	b11111111	(0xFF)	/* 255 */

/******************************************************************************/
/*                       CPU制御命令,DI/EI命令の置換                          */
/******************************************************************************/
#ifdef __RL78__
#else
	void	HALT(void);
	void	BRK(void);
	void	STOP(void);
	void	NOP(void);
	void	EI(void);
	void	DI(void);
	#ifdef DEFINE_SFR_GLOBAL
		void	HALT(void){}
		void	BRK(void){}
		void	STOP(void){}
		void	NOP(void){}
		void	EI(void){}
		void	DI(void){}
	#endif
#endif

/* 16進数表現,CPU制御命令,DI/EI命令の置換を追加 end 20150715 kurokawa */

#endif	/* rl78_ca78k0r_h */
